ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
#define SERCOM_I2CS_CTRLA_SWRST_Pos _UINT32_(0) /* (SERCOM_I2CS_CTRLA) Software Reset Position */
#define SERCOM_I2CS_CTRLA_SWRST_Msk                                                                                    \
        (_UINT32_(0x1) << SERCOM_I2CS_CTRLA_SWRST_Pos) /* (SERCOM_I2CS_CTRLA) Software Reset Mask */
#define SERCOM_I2CS_CTRLA_SWRST(value)                                                                                 \
        (SERCOM_I2CS_CTRLA_SWRST_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the SERCOM_I2CS_CTRLA register */
#define SERCOM_I2CS_CTRLA_ENABLE_Pos _UINT32_(1) /* (SERCOM_I2CS_CTRLA) Enable Position */
#define SERCOM_I2CS_CTRLA_ENABLE_Msk                                                                                   \
        (_UINT32_(0x1) << SERCOM_I2CS_CTRLA_ENABLE_Pos) /* (SERCOM_I2CS_CTRLA) Enable Mask */
#define SERCOM_I2CS_CTRLA_ENABLE(value)                                                                                \
        (SERCOM_I2CS_CTRLA_ENABLE_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the SERCOM_I2CS_CTRLA register */
#define SERCOM_I2CS_CTRLA_MODE_Pos _UINT32_(2) /* (SERCOM_I2CS_CTRLA) Operating Mode Position */
#define SERCOM_I2CS_CTRLA_MODE_Msk                                                                                     \
        (_UINT32_(0x7) << SERCOM_I2CS_CTRLA_MODE_Pos) /* (SERCOM_I2CS_CTRLA) Operating Mode Mask */
#define SERCOM_I2CS_CTRLA_MODE(value)                                                                                  \
        (SERCOM_I2CS_CTRLA_MODE_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLA_MODE_Pos)) /* Assigment of value for MODE in the SERCOM_I2CS_CTRLA register */
#define SERCOM_I2CS_CTRLA_MODE_USART_EXT_CLK_Val _UINT32_(0x0) /* (SERCOM_I2CS_CTRLA) USART with external clock  */
#define SERCOM_I2CS_CTRLA_MODE_USART_INT_CLK_Val _UINT32_(0x1) /* (SERCOM_I2CS_CTRLA) USART with internal clock  */
#define SERCOM_I2CS_CTRLA_MODE_SPI_SLAVE_Val _UINT32_(0x2) /* (SERCOM_I2CS_CTRLA) SPI in slave operation  */
#define SERCOM_I2CS_CTRLA_MODE_SPI_MASTER_Val _UINT32_(0x3) /* (SERCOM_I2CS_CTRLA) SPI in master operation  */
#define SERCOM_I2CS_CTRLA_MODE_I2C_SLAVE_Val _UINT32_(0x4) /* (SERCOM_I2CS_CTRLA) I2C slave operation  */
#define SERCOM_I2CS_CTRLA_MODE_I2C_MASTER_Val _UINT32_(0x5) /* (SERCOM_I2CS_CTRLA) I2C master operation  */
#define SERCOM_I2CS_CTRLA_MODE_USART_EXT_CLK                                                                           \
        (SERCOM_I2CS_CTRLA_MODE_USART_EXT_CLK_Val                                                                      \
         << SERCOM_I2CS_CTRLA_MODE_Pos) /* (SERCOM_I2CS_CTRLA) USART with external clock Position  */
#define SERCOM_I2CS_CTRLA_MODE_USART_INT_CLK                                                                           \
        (SERCOM_I2CS_CTRLA_MODE_USART_INT_CLK_Val                                                                      \
         << SERCOM_I2CS_CTRLA_MODE_Pos) /* (SERCOM_I2CS_CTRLA) USART with internal clock Position  */
#define SERCOM_I2CS_CTRLA_MODE_SPI_SLAVE                                                                               \
        (SERCOM_I2CS_CTRLA_MODE_SPI_SLAVE_Val                                                                          \
         << SERCOM_I2CS_CTRLA_MODE_Pos) /* (SERCOM_I2CS_CTRLA) SPI in slave operation Position  */
#define SERCOM_I2CS_CTRLA_MODE_SPI_MASTER                                                                              \
        (SERCOM_I2CS_CTRLA_MODE_SPI_MASTER_Val                                                                         \
         << SERCOM_I2CS_CTRLA_MODE_Pos) /* (SERCOM_I2CS_CTRLA) SPI in master operation Position  */
#define SERCOM_I2CS_CTRLA_MODE_I2C_SLAVE                                                                               \
        (SERCOM_I2CS_CTRLA_MODE_I2C_SLAVE_Val                                                                          \
         << SERCOM_I2CS_CTRLA_MODE_Pos) /* (SERCOM_I2CS_CTRLA) I2C slave operation Position  */
#define SERCOM_I2CS_CTRLA_MODE_I2C_MASTER                                                                              \
        (SERCOM_I2CS_CTRLA_MODE_I2C_MASTER_Val                                                                         \
         << SERCOM_I2CS_CTRLA_MODE_Pos) /* (SERCOM_I2CS_CTRLA) I2C master operation Position  */
#define SERCOM_I2CS_CTRLA_RUNSTDBY_Pos _UINT32_(7) /* (SERCOM_I2CS_CTRLA) Run during Standby Position */
#define SERCOM_I2CS_CTRLA_RUNSTDBY_Msk                                                                                 \
        (_UINT32_(0x1) << SERCOM_I2CS_CTRLA_RUNSTDBY_Pos) /* (SERCOM_I2CS_CTRLA) Run during Standby Mask */
#define SERCOM_I2CS_CTRLA_RUNSTDBY(value)                                                                              \
        (SERCOM_I2CS_CTRLA_RUNSTDBY_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SERCOM_I2CS_CTRLA register */
#define SERCOM_I2CS_CTRLA_PINOUT_Pos _UINT32_(16) /* (SERCOM_I2CS_CTRLA) Pin Usage Position */
#define SERCOM_I2CS_CTRLA_PINOUT_Msk                                                                                   \
        (_UINT32_(0x1) << SERCOM_I2CS_CTRLA_PINOUT_Pos) /* (SERCOM_I2CS_CTRLA) Pin Usage Mask */
#define SERCOM_I2CS_CTRLA_PINOUT(value)                                                                                \
        (SERCOM_I2CS_CTRLA_PINOUT_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLA_PINOUT_Pos)) /* Assigment of value for PINOUT in the SERCOM_I2CS_CTRLA register */
#define SERCOM_I2CS_CTRLA_SDAHOLD_Pos _UINT32_(20) /* (SERCOM_I2CS_CTRLA) SDA Hold Time Position */
#define SERCOM_I2CS_CTRLA_SDAHOLD_Msk                                                                                  \
        (_UINT32_(0x3) << SERCOM_I2CS_CTRLA_SDAHOLD_Pos) /* (SERCOM_I2CS_CTRLA) SDA Hold Time Mask */
#define SERCOM_I2CS_CTRLA_SDAHOLD(value)                                                                               \
        (SERCOM_I2CS_CTRLA_SDAHOLD_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLA_SDAHOLD_Pos)) /* Assigment of value for SDAHOLD in the SERCOM_I2CS_CTRLA register */
#define SERCOM_I2CS_CTRLA_SDAHOLD_DISABLE_Val _UINT32_(0x0) /* (SERCOM_I2CS_CTRLA) Disabled  */
#define SERCOM_I2CS_CTRLA_SDAHOLD_75NS_Val _UINT32_(0x1) /* (SERCOM_I2CS_CTRLA) 50-100ns hold time  */
#define SERCOM_I2CS_CTRLA_SDAHOLD_450NS_Val _UINT32_(0x2) /* (SERCOM_I2CS_CTRLA) 300-600ns hold time  */
#define SERCOM_I2CS_CTRLA_SDAHOLD_600NS_Val _UINT32_(0x3) /* (SERCOM_I2CS_CTRLA) 400-800ns hold time  */
#define SERCOM_I2CS_CTRLA_SDAHOLD_DISABLE                                                                              \
        (SERCOM_I2CS_CTRLA_SDAHOLD_DISABLE_Val                                                                         \
         << SERCOM_I2CS_CTRLA_SDAHOLD_Pos) /* (SERCOM_I2CS_CTRLA) Disabled Position  */
#define SERCOM_I2CS_CTRLA_SDAHOLD_75NS                                                                                 \
        (SERCOM_I2CS_CTRLA_SDAHOLD_75NS_Val                                                                            \
         << SERCOM_I2CS_CTRLA_SDAHOLD_Pos) /* (SERCOM_I2CS_CTRLA) 50-100ns hold time Position  */
#define SERCOM_I2CS_CTRLA_SDAHOLD_450NS                                                                                \
        (SERCOM_I2CS_CTRLA_SDAHOLD_450NS_Val                                                                           \
         << SERCOM_I2CS_CTRLA_SDAHOLD_Pos) /* (SERCOM_I2CS_CTRLA) 300-600ns hold time Position  */
#define SERCOM_I2CS_CTRLA_SDAHOLD_600NS                                                                                \
        (SERCOM_I2CS_CTRLA_SDAHOLD_600NS_Val                                                                           \
         << SERCOM_I2CS_CTRLA_SDAHOLD_Pos) /* (SERCOM_I2CS_CTRLA) 400-800ns hold time Position  */
#define SERCOM_I2CS_CTRLA_SEXTTOEN_Pos _UINT32_(23) /* (SERCOM_I2CS_CTRLA) Slave SCL Low Extend Timeout Position */
#define SERCOM_I2CS_CTRLA_SEXTTOEN_Msk                                                                                 \
        (_UINT32_(0x1) << SERCOM_I2CS_CTRLA_SEXTTOEN_Pos) /* (SERCOM_I2CS_CTRLA) Slave SCL Low Extend Timeout Mask */
#define SERCOM_I2CS_CTRLA_SEXTTOEN(value)                                                                              \
        (SERCOM_I2CS_CTRLA_SEXTTOEN_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLA_SEXTTOEN_Pos)) /* Assigment of value for SEXTTOEN in the SERCOM_I2CS_CTRLA register */
#define SERCOM_I2CS_CTRLA_SPEED_Pos _UINT32_(24) /* (SERCOM_I2CS_CTRLA) Transfer Speed Position */
#define SERCOM_I2CS_CTRLA_SPEED_Msk                                                                                    \
        (_UINT32_(0x3) << SERCOM_I2CS_CTRLA_SPEED_Pos) /* (SERCOM_I2CS_CTRLA) Transfer Speed Mask */
#define SERCOM_I2CS_CTRLA_SPEED(value)                                                                                 \
        (SERCOM_I2CS_CTRLA_SPEED_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLA_SPEED_Pos)) /* Assigment of value for SPEED in the SERCOM_I2CS_CTRLA register */
#define SERCOM_I2CS_CTRLA_SPEED_STANDARD_AND_FAST_MODE_Val                                                             \
        _UINT32_(0x0) /* (SERCOM_I2CS_CTRLA) Standard Mode(Sm) Upto 100kHz and Fast Mode(Fm) Upto 400kHz   */
#define SERCOM_I2CS_CTRLA_SPEED_FASTPLUS_MODE_Val _UINT32_(0x1) /* (SERCOM_I2CS_CTRLA) Fast-mode Plus Upto 1MHz  */
#define SERCOM_I2CS_CTRLA_SPEED_HIGH_SPEED_MODE_Val _UINT32_(0x2) /* (SERCOM_I2CS_CTRLA) High-speed mode Upto 3.4MHz   \
                                                                   */
#define SERCOM_I2CS_CTRLA_SPEED_STANDARD_AND_FAST_MODE                                                                 \
        (SERCOM_I2CS_CTRLA_SPEED_STANDARD_AND_FAST_MODE_Val                                                            \
         << SERCOM_I2CS_CTRLA_SPEED_Pos) /* (SERCOM_I2CS_CTRLA) Standard Mode(Sm) Upto 100kHz and Fast Mode(Fm) Upto   \
                                            400kHz  Position  */
#define SERCOM_I2CS_CTRLA_SPEED_FASTPLUS_MODE                                                                          \
        (SERCOM_I2CS_CTRLA_SPEED_FASTPLUS_MODE_Val                                                                     \
         << SERCOM_I2CS_CTRLA_SPEED_Pos) /* (SERCOM_I2CS_CTRLA) Fast-mode Plus Upto 1MHz Position  */
#define SERCOM_I2CS_CTRLA_SPEED_HIGH_SPEED_MODE                                                                        \
        (SERCOM_I2CS_CTRLA_SPEED_HIGH_SPEED_MODE_Val                                                                   \
         << SERCOM_I2CS_CTRLA_SPEED_Pos) /* (SERCOM_I2CS_CTRLA) High-speed mode Upto 3.4MHz Position  */
#define SERCOM_I2CS_CTRLA_SCLSM_Pos _UINT32_(27) /* (SERCOM_I2CS_CTRLA) SCL Clock Stretch Mode Position */
#define SERCOM_I2CS_CTRLA_SCLSM_Msk                                                                                    \
        (_UINT32_(0x1) << SERCOM_I2CS_CTRLA_SCLSM_Pos) /* (SERCOM_I2CS_CTRLA) SCL Clock Stretch Mode Mask */
#define SERCOM_I2CS_CTRLA_SCLSM(value)                                                                                 \
        (SERCOM_I2CS_CTRLA_SCLSM_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLA_SCLSM_Pos)) /* Assigment of value for SCLSM in the SERCOM_I2CS_CTRLA register */
#define SERCOM_I2CS_CTRLA_LOWTOUTEN_Pos _UINT32_(30) /* (SERCOM_I2CS_CTRLA) SCL Low Timeout Enable Position */
#define SERCOM_I2CS_CTRLA_LOWTOUTEN_Msk                                                                                \
        (_UINT32_(0x1) << SERCOM_I2CS_CTRLA_LOWTOUTEN_Pos) /* (SERCOM_I2CS_CTRLA) SCL Low Timeout Enable Mask */
#define SERCOM_I2CS_CTRLA_LOWTOUTEN(value)                                                                             \
        (SERCOM_I2CS_CTRLA_LOWTOUTEN_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_I2CS_CTRLA_LOWTOUTEN_Pos)) /* Assigment of value for LOWTOUTEN in the              \
                                                                  SERCOM_I2CS_CTRLA register */
#define SERCOM_I2CS_CTRLA_Msk _UINT32_(0x4BB1009F) /* (SERCOM_I2CS_CTRLA) Register Mask  */


/* -------- SERCOM_SPIM_CTRLA : (SERCOM Offset: 0x00) (R/W 32) SPIM Control A -------- */
#define SERCOM_SPIM_CTRLA_RESETVALUE _UINT32_(0x00) /*  (SERCOM_SPIM_CTRLA) SPIM Control A  Reset Value */

