ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
#define SERCOM_SPIS_CTRLA_SWRST_Pos _UINT32_(0) /* (SERCOM_SPIS_CTRLA) Software Reset Position */
#define SERCOM_SPIS_CTRLA_SWRST_Msk                                                                                    \
        (_UINT32_(0x1) << SERCOM_SPIS_CTRLA_SWRST_Pos) /* (SERCOM_SPIS_CTRLA) Software Reset Mask */
#define SERCOM_SPIS_CTRLA_SWRST(value)                                                                                 \
        (SERCOM_SPIS_CTRLA_SWRST_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the SERCOM_SPIS_CTRLA register */
#define SERCOM_SPIS_CTRLA_ENABLE_Pos _UINT32_(1) /* (SERCOM_SPIS_CTRLA) Enable Position */
#define SERCOM_SPIS_CTRLA_ENABLE_Msk                                                                                   \
        (_UINT32_(0x1) << SERCOM_SPIS_CTRLA_ENABLE_Pos) /* (SERCOM_SPIS_CTRLA) Enable Mask */
#define SERCOM_SPIS_CTRLA_ENABLE(value)                                                                                \
        (SERCOM_SPIS_CTRLA_ENABLE_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the SERCOM_SPIS_CTRLA register */
#define SERCOM_SPIS_CTRLA_MODE_Pos _UINT32_(2) /* (SERCOM_SPIS_CTRLA) Operating Mode Position */
#define SERCOM_SPIS_CTRLA_MODE_Msk                                                                                     \
        (_UINT32_(0x7) << SERCOM_SPIS_CTRLA_MODE_Pos) /* (SERCOM_SPIS_CTRLA) Operating Mode Mask */
#define SERCOM_SPIS_CTRLA_MODE(value)                                                                                  \
        (SERCOM_SPIS_CTRLA_MODE_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLA_MODE_Pos)) /* Assigment of value for MODE in the SERCOM_SPIS_CTRLA register */
#define SERCOM_SPIS_CTRLA_MODE_USART_EXT_CLK_Val _UINT32_(0x0) /* (SERCOM_SPIS_CTRLA) USART with external clock  */
#define SERCOM_SPIS_CTRLA_MODE_USART_INT_CLK_Val _UINT32_(0x1) /* (SERCOM_SPIS_CTRLA) USART with internal clock  */
#define SERCOM_SPIS_CTRLA_MODE_SPI_SLAVE_Val _UINT32_(0x2) /* (SERCOM_SPIS_CTRLA) SPI in slave operation  */
#define SERCOM_SPIS_CTRLA_MODE_SPI_MASTER_Val _UINT32_(0x3) /* (SERCOM_SPIS_CTRLA) SPI in master operation  */
#define SERCOM_SPIS_CTRLA_MODE_I2C_SLAVE_Val _UINT32_(0x4) /* (SERCOM_SPIS_CTRLA) I2C slave operation  */
#define SERCOM_SPIS_CTRLA_MODE_I2C_MASTER_Val _UINT32_(0x5) /* (SERCOM_SPIS_CTRLA) I2C master operation  */
#define SERCOM_SPIS_CTRLA_MODE_USART_EXT_CLK                                                                           \
        (SERCOM_SPIS_CTRLA_MODE_USART_EXT_CLK_Val                                                                      \
         << SERCOM_SPIS_CTRLA_MODE_Pos) /* (SERCOM_SPIS_CTRLA) USART with external clock Position  */
#define SERCOM_SPIS_CTRLA_MODE_USART_INT_CLK                                                                           \
        (SERCOM_SPIS_CTRLA_MODE_USART_INT_CLK_Val                                                                      \
         << SERCOM_SPIS_CTRLA_MODE_Pos) /* (SERCOM_SPIS_CTRLA) USART with internal clock Position  */
#define SERCOM_SPIS_CTRLA_MODE_SPI_SLAVE                                                                               \
        (SERCOM_SPIS_CTRLA_MODE_SPI_SLAVE_Val                                                                          \
         << SERCOM_SPIS_CTRLA_MODE_Pos) /* (SERCOM_SPIS_CTRLA) SPI in slave operation Position  */
#define SERCOM_SPIS_CTRLA_MODE_SPI_MASTER                                                                              \
        (SERCOM_SPIS_CTRLA_MODE_SPI_MASTER_Val                                                                         \
         << SERCOM_SPIS_CTRLA_MODE_Pos) /* (SERCOM_SPIS_CTRLA) SPI in master operation Position  */
#define SERCOM_SPIS_CTRLA_MODE_I2C_SLAVE                                                                               \
        (SERCOM_SPIS_CTRLA_MODE_I2C_SLAVE_Val                                                                          \
         << SERCOM_SPIS_CTRLA_MODE_Pos) /* (SERCOM_SPIS_CTRLA) I2C slave operation Position  */
#define SERCOM_SPIS_CTRLA_MODE_I2C_MASTER                                                                              \
        (SERCOM_SPIS_CTRLA_MODE_I2C_MASTER_Val                                                                         \
         << SERCOM_SPIS_CTRLA_MODE_Pos) /* (SERCOM_SPIS_CTRLA) I2C master operation Position  */
#define SERCOM_SPIS_CTRLA_RUNSTDBY_Pos _UINT32_(7) /* (SERCOM_SPIS_CTRLA) Run during Standby Position */
#define SERCOM_SPIS_CTRLA_RUNSTDBY_Msk                                                                                 \
        (_UINT32_(0x1) << SERCOM_SPIS_CTRLA_RUNSTDBY_Pos) /* (SERCOM_SPIS_CTRLA) Run during Standby Mask */
#define SERCOM_SPIS_CTRLA_RUNSTDBY(value)                                                                              \
        (SERCOM_SPIS_CTRLA_RUNSTDBY_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SERCOM_SPIS_CTRLA register */
#define SERCOM_SPIS_CTRLA_IBON_Pos _UINT32_(8) /* (SERCOM_SPIS_CTRLA) Immediate Buffer Overflow Notification Position  \
                                                */
#define SERCOM_SPIS_CTRLA_IBON_Msk                                                                                     \
        (_UINT32_(0x1)                                                                                                 \
         << SERCOM_SPIS_CTRLA_IBON_Pos) /* (SERCOM_SPIS_CTRLA) Immediate Buffer Overflow Notification Mask */
#define SERCOM_SPIS_CTRLA_IBON(value)                                                                                  \
        (SERCOM_SPIS_CTRLA_IBON_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLA_IBON_Pos)) /* Assigment of value for IBON in the SERCOM_SPIS_CTRLA register */
#define SERCOM_SPIS_CTRLA_DOPO_Pos _UINT32_(16) /* (SERCOM_SPIS_CTRLA) Data Out Pinout Position */
#define SERCOM_SPIS_CTRLA_DOPO_Msk                                                                                     \
        (_UINT32_(0x3) << SERCOM_SPIS_CTRLA_DOPO_Pos) /* (SERCOM_SPIS_CTRLA) Data Out Pinout Mask */
#define SERCOM_SPIS_CTRLA_DOPO(value)                                                                                  \
        (SERCOM_SPIS_CTRLA_DOPO_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLA_DOPO_Pos)) /* Assigment of value for DOPO in the SERCOM_SPIS_CTRLA register */
#define SERCOM_SPIS_CTRLA_DOPO_PAD0_Val                                                                                \
        _UINT32_(0x0) /* (SERCOM_SPIS_CTRLA) DO on PAD[0], SCK on PAD[1] and SS on PAD[2]  */
#define SERCOM_SPIS_CTRLA_DOPO_PAD1_Val                                                                                \
        _UINT32_(0x1) /* (SERCOM_SPIS_CTRLA) DO on PAD[2], SCK on PAD[3] and SS on PAD[1]  */
#define SERCOM_SPIS_CTRLA_DOPO_PAD2_Val                                                                                \
        _UINT32_(0x2) /* (SERCOM_SPIS_CTRLA) DO on PAD[3], SCK on PAD[1] and SS on PAD[2]  */
#define SERCOM_SPIS_CTRLA_DOPO_PAD3_Val                                                                                \
        _UINT32_(0x3) /* (SERCOM_SPIS_CTRLA) DO on PAD[0], SCK on PAD[3] and SS on PAD[1]  */
#define SERCOM_SPIS_CTRLA_DOPO_PAD0                                                                                    \
        (SERCOM_SPIS_CTRLA_DOPO_PAD0_Val << SERCOM_SPIS_CTRLA_DOPO_Pos) /* (SERCOM_SPIS_CTRLA) DO on PAD[0], SCK on    \
                                                                           PAD[1] and SS on PAD[2] Position  */
#define SERCOM_SPIS_CTRLA_DOPO_PAD1                                                                                    \
        (SERCOM_SPIS_CTRLA_DOPO_PAD1_Val << SERCOM_SPIS_CTRLA_DOPO_Pos) /* (SERCOM_SPIS_CTRLA) DO on PAD[2], SCK on    \
                                                                           PAD[3] and SS on PAD[1] Position  */
#define SERCOM_SPIS_CTRLA_DOPO_PAD2                                                                                    \
        (SERCOM_SPIS_CTRLA_DOPO_PAD2_Val << SERCOM_SPIS_CTRLA_DOPO_Pos) /* (SERCOM_SPIS_CTRLA) DO on PAD[3], SCK on    \
                                                                           PAD[1] and SS on PAD[2] Position  */
#define SERCOM_SPIS_CTRLA_DOPO_PAD3                                                                                    \
        (SERCOM_SPIS_CTRLA_DOPO_PAD3_Val << SERCOM_SPIS_CTRLA_DOPO_Pos) /* (SERCOM_SPIS_CTRLA) DO on PAD[0], SCK on    \
                                                                           PAD[3] and SS on PAD[1] Position  */
#define SERCOM_SPIS_CTRLA_DIPO_Pos _UINT32_(20) /* (SERCOM_SPIS_CTRLA) Data In Pinout Position */
#define SERCOM_SPIS_CTRLA_DIPO_Msk                                                                                     \
        (_UINT32_(0x3) << SERCOM_SPIS_CTRLA_DIPO_Pos) /* (SERCOM_SPIS_CTRLA) Data In Pinout Mask */
#define SERCOM_SPIS_CTRLA_DIPO(value)                                                                                  \
        (SERCOM_SPIS_CTRLA_DIPO_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLA_DIPO_Pos)) /* Assigment of value for DIPO in the SERCOM_SPIS_CTRLA register */
#define SERCOM_SPIS_CTRLA_DIPO_PAD0_Val _UINT32_(0x0) /* (SERCOM_SPIS_CTRLA) SERCOM PAD[0]  */
#define SERCOM_SPIS_CTRLA_DIPO_PAD1_Val _UINT32_(0x1) /* (SERCOM_SPIS_CTRLA) SERCOM PAD[1]  */
#define SERCOM_SPIS_CTRLA_DIPO_PAD2_Val _UINT32_(0x2) /* (SERCOM_SPIS_CTRLA) SERCOM PAD[2]  */
#define SERCOM_SPIS_CTRLA_DIPO_PAD3_Val _UINT32_(0x3) /* (SERCOM_SPIS_CTRLA) SERCOM PAD[3]  */
#define SERCOM_SPIS_CTRLA_DIPO_PAD0                                                                                    \
        (                                                                                                              \
                SERCOM_SPIS_CTRLA_DIPO_PAD0_Val                                                                        \
                << SERCOM_SPIS_CTRLA_DIPO_Pos) /* (SERCOM_SPIS_CTRLA) SERCOM PAD[0] Position  */
#define SERCOM_SPIS_CTRLA_DIPO_PAD1                                                                                    \
        (                                                                                                              \
                SERCOM_SPIS_CTRLA_DIPO_PAD1_Val                                                                        \
                << SERCOM_SPIS_CTRLA_DIPO_Pos) /* (SERCOM_SPIS_CTRLA) SERCOM PAD[1] Position  */
#define SERCOM_SPIS_CTRLA_DIPO_PAD2                                                                                    \
        (                                                                                                              \
                SERCOM_SPIS_CTRLA_DIPO_PAD2_Val                                                                        \
                << SERCOM_SPIS_CTRLA_DIPO_Pos) /* (SERCOM_SPIS_CTRLA) SERCOM PAD[2] Position  */
#define SERCOM_SPIS_CTRLA_DIPO_PAD3                                                                                    \
        (                                                                                                              \
                SERCOM_SPIS_CTRLA_DIPO_PAD3_Val                                                                        \
                << SERCOM_SPIS_CTRLA_DIPO_Pos) /* (SERCOM_SPIS_CTRLA) SERCOM PAD[3] Position  */
#define SERCOM_SPIS_CTRLA_FORM_Pos _UINT32_(24) /* (SERCOM_SPIS_CTRLA) Frame Format Position */
#define SERCOM_SPIS_CTRLA_FORM_Msk                                                                                     \
        (_UINT32_(0xF) << SERCOM_SPIS_CTRLA_FORM_Pos) /* (SERCOM_SPIS_CTRLA) Frame Format Mask */
#define SERCOM_SPIS_CTRLA_FORM(value)                                                                                  \
        (SERCOM_SPIS_CTRLA_FORM_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLA_FORM_Pos)) /* Assigment of value for FORM in the SERCOM_SPIS_CTRLA register */
#define SERCOM_SPIS_CTRLA_FORM_SPI_FRAME_Val _UINT32_(0x0) /* (SERCOM_SPIS_CTRLA) SPI Frame  */
#define SERCOM_SPIS_CTRLA_FORM_SPI_FRAME_WITH_ADDR_Val _UINT32_(0x2) /* (SERCOM_SPIS_CTRLA) SPI Frame with Addr  */
#define SERCOM_SPIS_CTRLA_FORM_SPI_FRAME                                                                               \
        (SERCOM_SPIS_CTRLA_FORM_SPI_FRAME_Val                                                                          \
         << SERCOM_SPIS_CTRLA_FORM_Pos) /* (SERCOM_SPIS_CTRLA) SPI Frame Position  */
#define SERCOM_SPIS_CTRLA_FORM_SPI_FRAME_WITH_ADDR                                                                     \
        (SERCOM_SPIS_CTRLA_FORM_SPI_FRAME_WITH_ADDR_Val                                                                \
         << SERCOM_SPIS_CTRLA_FORM_Pos) /* (SERCOM_SPIS_CTRLA) SPI Frame with Addr Position  */
#define SERCOM_SPIS_CTRLA_CPHA_Pos _UINT32_(28) /* (SERCOM_SPIS_CTRLA) Clock Phase Position */
#define SERCOM_SPIS_CTRLA_CPHA_Msk                                                                                     \
        (_UINT32_(0x1) << SERCOM_SPIS_CTRLA_CPHA_Pos) /* (SERCOM_SPIS_CTRLA) Clock Phase Mask */
#define SERCOM_SPIS_CTRLA_CPHA(value)                                                                                  \
        (SERCOM_SPIS_CTRLA_CPHA_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLA_CPHA_Pos)) /* Assigment of value for CPHA in the SERCOM_SPIS_CTRLA register */
#define SERCOM_SPIS_CTRLA_CPHA_LEADING_EDGE_Val                                                                        \
        _UINT32_(0x0) /* (SERCOM_SPIS_CTRLA) The data is sampled on a leading SCK edge and changed on a trailing SCK   \
                         edge  */
#define SERCOM_SPIS_CTRLA_CPHA_TRAILING_EDGE_Val                                                                       \
        _UINT32_(0x1) /* (SERCOM_SPIS_CTRLA) The data is sampled on a trailing SCK edge and changed on a leading SCK   \
                         edge  */
#define SERCOM_SPIS_CTRLA_CPHA_LEADING_EDGE                                                                            \
        (SERCOM_SPIS_CTRLA_CPHA_LEADING_EDGE_Val                                                                       \
         << SERCOM_SPIS_CTRLA_CPHA_Pos) /* (SERCOM_SPIS_CTRLA) The data is sampled on a leading SCK edge and changed   \
                                           on a trailing SCK edge Position  */
#define SERCOM_SPIS_CTRLA_CPHA_TRAILING_EDGE                                                                           \
        (SERCOM_SPIS_CTRLA_CPHA_TRAILING_EDGE_Val                                                                      \
         << SERCOM_SPIS_CTRLA_CPHA_Pos) /* (SERCOM_SPIS_CTRLA) The data is sampled on a trailing SCK edge and changed  \
                                           on a leading SCK edge Position  */
#define SERCOM_SPIS_CTRLA_CPOL_Pos _UINT32_(29) /* (SERCOM_SPIS_CTRLA) Clock Polarity Position */
#define SERCOM_SPIS_CTRLA_CPOL_Msk                                                                                     \
        (_UINT32_(0x1) << SERCOM_SPIS_CTRLA_CPOL_Pos) /* (SERCOM_SPIS_CTRLA) Clock Polarity Mask */
#define SERCOM_SPIS_CTRLA_CPOL(value)                                                                                  \
        (SERCOM_SPIS_CTRLA_CPOL_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLA_CPOL_Pos)) /* Assigment of value for CPOL in the SERCOM_SPIS_CTRLA register */
#define SERCOM_SPIS_CTRLA_CPOL_IDLE_LOW_Val _UINT32_(0x0) /* (SERCOM_SPIS_CTRLA) SCK is low when idle  */
#define SERCOM_SPIS_CTRLA_CPOL_IDLE_HIGH_Val _UINT32_(0x1) /* (SERCOM_SPIS_CTRLA) SCK is high when idle  */
#define SERCOM_SPIS_CTRLA_CPOL_IDLE_LOW                                                                                \
        (SERCOM_SPIS_CTRLA_CPOL_IDLE_LOW_Val                                                                           \
         << SERCOM_SPIS_CTRLA_CPOL_Pos) /* (SERCOM_SPIS_CTRLA) SCK is low when idle Position  */
#define SERCOM_SPIS_CTRLA_CPOL_IDLE_HIGH                                                                               \
        (SERCOM_SPIS_CTRLA_CPOL_IDLE_HIGH_Val                                                                          \
         << SERCOM_SPIS_CTRLA_CPOL_Pos) /* (SERCOM_SPIS_CTRLA) SCK is high when idle Position  */
#define SERCOM_SPIS_CTRLA_DORD_Pos _UINT32_(30) /* (SERCOM_SPIS_CTRLA) Data Order Position */
#define SERCOM_SPIS_CTRLA_DORD_Msk                                                                                     \
        (_UINT32_(0x1) << SERCOM_SPIS_CTRLA_DORD_Pos) /* (SERCOM_SPIS_CTRLA) Data Order Mask */
#define SERCOM_SPIS_CTRLA_DORD(value)                                                                                  \
        (SERCOM_SPIS_CTRLA_DORD_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLA_DORD_Pos)) /* Assigment of value for DORD in the SERCOM_SPIS_CTRLA register */
#define SERCOM_SPIS_CTRLA_DORD_MSB_Val _UINT32_(0x0) /* (SERCOM_SPIS_CTRLA) MSB is transferred first  */
#define SERCOM_SPIS_CTRLA_DORD_LSB_Val _UINT32_(0x1) /* (SERCOM_SPIS_CTRLA) LSB is transferred first  */
#define SERCOM_SPIS_CTRLA_DORD_MSB                                                                                     \
        (                                                                                                              \
                SERCOM_SPIS_CTRLA_DORD_MSB_Val                                                                         \
                << SERCOM_SPIS_CTRLA_DORD_Pos) /* (SERCOM_SPIS_CTRLA) MSB is transferred first Position  */
#define SERCOM_SPIS_CTRLA_DORD_LSB                                                                                     \
        (                                                                                                              \
                SERCOM_SPIS_CTRLA_DORD_LSB_Val                                                                         \
                << SERCOM_SPIS_CTRLA_DORD_Pos) /* (SERCOM_SPIS_CTRLA) LSB is transferred first Position  */
#define SERCOM_SPIS_CTRLA_Msk _UINT32_(0x7F33019F) /* (SERCOM_SPIS_CTRLA) Register Mask  */


/* -------- SERCOM_USART_EXT_CTRLA : (SERCOM Offset: 0x00) (R/W 32) USART_EXT Control A -------- */
#define SERCOM_USART_EXT_CTRLA_RESETVALUE                                                                              \
        _UINT32_(0x00) /*  (SERCOM_USART_EXT_CTRLA) USART_EXT Control A  Reset Value */

