ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
#define SERCOM_USART_EXT_CTRLA_SWRST_Pos _UINT32_(0) /* (SERCOM_USART_EXT_CTRLA) Software Reset Position */
#define SERCOM_USART_EXT_CTRLA_SWRST_Msk                                                                               \
        (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLA_SWRST_Pos) /* (SERCOM_USART_EXT_CTRLA) Software Reset Mask */
#define SERCOM_USART_EXT_CTRLA_SWRST(value)                                                                            \
        (SERCOM_USART_EXT_CTRLA_SWRST_Msk &                                                                            \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the                 \
                                                                   SERCOM_USART_EXT_CTRLA register */
#define SERCOM_USART_EXT_CTRLA_ENABLE_Pos _UINT32_(1) /* (SERCOM_USART_EXT_CTRLA) Enable Position */
#define SERCOM_USART_EXT_CTRLA_ENABLE_Msk                                                                              \
        (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLA_ENABLE_Pos) /* (SERCOM_USART_EXT_CTRLA) Enable Mask */
#define SERCOM_USART_EXT_CTRLA_ENABLE(value)                                                                           \
        (SERCOM_USART_EXT_CTRLA_ENABLE_Msk &                                                                           \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the               \
                                                                    SERCOM_USART_EXT_CTRLA register */
#define SERCOM_USART_EXT_CTRLA_MODE_Pos _UINT32_(2) /* (SERCOM_USART_EXT_CTRLA) Operating Mode Position */
#define SERCOM_USART_EXT_CTRLA_MODE_Msk                                                                                \
        (_UINT32_(0x7) << SERCOM_USART_EXT_CTRLA_MODE_Pos) /* (SERCOM_USART_EXT_CTRLA) Operating Mode Mask */
#define SERCOM_USART_EXT_CTRLA_MODE(value)                                                                             \
        (SERCOM_USART_EXT_CTRLA_MODE_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLA_MODE_Pos)) /* Assigment of value for MODE in the                   \
                                                                  SERCOM_USART_EXT_CTRLA register */
#define SERCOM_USART_EXT_CTRLA_MODE_USART_EXT_CLK_Val                                                                  \
        _UINT32_(0x0) /* (SERCOM_USART_EXT_CTRLA) USART with external clock  */
#define SERCOM_USART_EXT_CTRLA_MODE_USART_INT_CLK_Val                                                                  \
        _UINT32_(0x1) /* (SERCOM_USART_EXT_CTRLA) USART with internal clock  */
#define SERCOM_USART_EXT_CTRLA_MODE_SPI_SLAVE_Val _UINT32_(0x2) /* (SERCOM_USART_EXT_CTRLA) SPI in slave operation  */
#define SERCOM_USART_EXT_CTRLA_MODE_SPI_MASTER_Val _UINT32_(0x3) /* (SERCOM_USART_EXT_CTRLA) SPI in master operation   \
                                                                  */
#define SERCOM_USART_EXT_CTRLA_MODE_I2C_SLAVE_Val _UINT32_(0x4) /* (SERCOM_USART_EXT_CTRLA) I2C slave operation  */
#define SERCOM_USART_EXT_CTRLA_MODE_I2C_MASTER_Val _UINT32_(0x5) /* (SERCOM_USART_EXT_CTRLA) I2C master operation  */
#define SERCOM_USART_EXT_CTRLA_MODE_USART_EXT_CLK                                                                      \
        (SERCOM_USART_EXT_CTRLA_MODE_USART_EXT_CLK_Val                                                                 \
         << SERCOM_USART_EXT_CTRLA_MODE_Pos) /* (SERCOM_USART_EXT_CTRLA) USART with external clock Position  */
#define SERCOM_USART_EXT_CTRLA_MODE_USART_INT_CLK                                                                      \
        (SERCOM_USART_EXT_CTRLA_MODE_USART_INT_CLK_Val                                                                 \
         << SERCOM_USART_EXT_CTRLA_MODE_Pos) /* (SERCOM_USART_EXT_CTRLA) USART with internal clock Position  */
#define SERCOM_USART_EXT_CTRLA_MODE_SPI_SLAVE                                                                          \
        (SERCOM_USART_EXT_CTRLA_MODE_SPI_SLAVE_Val                                                                     \
         << SERCOM_USART_EXT_CTRLA_MODE_Pos) /* (SERCOM_USART_EXT_CTRLA) SPI in slave operation Position  */
#define SERCOM_USART_EXT_CTRLA_MODE_SPI_MASTER                                                                         \
        (SERCOM_USART_EXT_CTRLA_MODE_SPI_MASTER_Val                                                                    \
         << SERCOM_USART_EXT_CTRLA_MODE_Pos) /* (SERCOM_USART_EXT_CTRLA) SPI in master operation Position  */
#define SERCOM_USART_EXT_CTRLA_MODE_I2C_SLAVE                                                                          \
        (SERCOM_USART_EXT_CTRLA_MODE_I2C_SLAVE_Val                                                                     \
         << SERCOM_USART_EXT_CTRLA_MODE_Pos) /* (SERCOM_USART_EXT_CTRLA) I2C slave operation Position  */
#define SERCOM_USART_EXT_CTRLA_MODE_I2C_MASTER                                                                         \
        (SERCOM_USART_EXT_CTRLA_MODE_I2C_MASTER_Val                                                                    \
         << SERCOM_USART_EXT_CTRLA_MODE_Pos) /* (SERCOM_USART_EXT_CTRLA) I2C master operation Position  */
#define SERCOM_USART_EXT_CTRLA_RUNSTDBY_Pos _UINT32_(7) /* (SERCOM_USART_EXT_CTRLA) Run during Standby Position */
#define SERCOM_USART_EXT_CTRLA_RUNSTDBY_Msk                                                                            \
        (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLA_RUNSTDBY_Pos) /* (SERCOM_USART_EXT_CTRLA) Run during Standby Mask */
#define SERCOM_USART_EXT_CTRLA_RUNSTDBY(value)                                                                         \
        (SERCOM_USART_EXT_CTRLA_RUNSTDBY_Msk &                                                                         \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the           \
                                                                      SERCOM_USART_EXT_CTRLA register */
#define SERCOM_USART_EXT_CTRLA_IBON_Pos                                                                                \
        _UINT32_(8) /* (SERCOM_USART_EXT_CTRLA) Immediate Buffer Overflow Notification Position */
#define SERCOM_USART_EXT_CTRLA_IBON_Msk                                                                                \
        (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLA_IBON_Pos) /* (SERCOM_USART_EXT_CTRLA) Immediate Buffer Overflow       \
                                                              Notification Mask */
#define SERCOM_USART_EXT_CTRLA_IBON(value)                                                                             \
        (SERCOM_USART_EXT_CTRLA_IBON_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLA_IBON_Pos)) /* Assigment of value for IBON in the                   \
                                                                  SERCOM_USART_EXT_CTRLA register */
#define SERCOM_USART_EXT_CTRLA_SAMPR_Pos _UINT32_(13) /* (SERCOM_USART_EXT_CTRLA) Sample Position */
#define SERCOM_USART_EXT_CTRLA_SAMPR_Msk                                                                               \
        (_UINT32_(0x7) << SERCOM_USART_EXT_CTRLA_SAMPR_Pos) /* (SERCOM_USART_EXT_CTRLA) Sample Mask */
#define SERCOM_USART_EXT_CTRLA_SAMPR(value)                                                                            \
        (SERCOM_USART_EXT_CTRLA_SAMPR_Msk &                                                                            \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLA_SAMPR_Pos)) /* Assigment of value for SAMPR in the                 \
                                                                   SERCOM_USART_EXT_CTRLA register */
#define SERCOM_USART_EXT_CTRLA_SAMPR_16X_ARITHMETIC_Val                                                                \
        _UINT32_(0x0) /* (SERCOM_USART_EXT_CTRLA) 16x over-sampling using arithmetic baudrate generation  */
#define SERCOM_USART_EXT_CTRLA_SAMPR_16X_FRACTIONAL_Val                                                                \
        _UINT32_(0x1) /* (SERCOM_USART_EXT_CTRLA) 16x over-sampling using fractional baudrate generation  */
#define SERCOM_USART_EXT_CTRLA_SAMPR_8X_ARITHMETIC_Val                                                                 \
        _UINT32_(0x2) /* (SERCOM_USART_EXT_CTRLA) 8x over-sampling using arithmetic baudrate generation  */
#define SERCOM_USART_EXT_CTRLA_SAMPR_8X_FRACTIONAL_Val                                                                 \
        _UINT32_(0x3) /* (SERCOM_USART_EXT_CTRLA) 8x over-sampling using fractional baudrate generation  */
#define SERCOM_USART_EXT_CTRLA_SAMPR_3X_ARITHMETIC_Val                                                                 \
        _UINT32_(0x4) /* (SERCOM_USART_EXT_CTRLA) 3x over-sampling using arithmetic baudrate generation  */
#define SERCOM_USART_EXT_CTRLA_SAMPR_16X_ARITHMETIC                                                                    \
        (SERCOM_USART_EXT_CTRLA_SAMPR_16X_ARITHMETIC_Val                                                               \
         << SERCOM_USART_EXT_CTRLA_SAMPR_Pos) /* (SERCOM_USART_EXT_CTRLA) 16x over-sampling using arithmetic baudrate  \
                                                 generation Position  */
#define SERCOM_USART_EXT_CTRLA_SAMPR_16X_FRACTIONAL                                                                    \
        (SERCOM_USART_EXT_CTRLA_SAMPR_16X_FRACTIONAL_Val                                                               \
         << SERCOM_USART_EXT_CTRLA_SAMPR_Pos) /* (SERCOM_USART_EXT_CTRLA) 16x over-sampling using fractional baudrate  \
                                                 generation Position  */
#define SERCOM_USART_EXT_CTRLA_SAMPR_8X_ARITHMETIC                                                                     \
        (SERCOM_USART_EXT_CTRLA_SAMPR_8X_ARITHMETIC_Val                                                                \
         << SERCOM_USART_EXT_CTRLA_SAMPR_Pos) /* (SERCOM_USART_EXT_CTRLA) 8x over-sampling using arithmetic baudrate   \
                                                 generation Position  */
#define SERCOM_USART_EXT_CTRLA_SAMPR_8X_FRACTIONAL                                                                     \
        (SERCOM_USART_EXT_CTRLA_SAMPR_8X_FRACTIONAL_Val                                                                \
         << SERCOM_USART_EXT_CTRLA_SAMPR_Pos) /* (SERCOM_USART_EXT_CTRLA) 8x over-sampling using fractional baudrate   \
                                                 generation Position  */
#define SERCOM_USART_EXT_CTRLA_SAMPR_3X_ARITHMETIC                                                                     \
        (SERCOM_USART_EXT_CTRLA_SAMPR_3X_ARITHMETIC_Val                                                                \
         << SERCOM_USART_EXT_CTRLA_SAMPR_Pos) /* (SERCOM_USART_EXT_CTRLA) 3x over-sampling using arithmetic baudrate   \
                                                 generation Position  */
#define SERCOM_USART_EXT_CTRLA_TXPO_Pos _UINT32_(16) /* (SERCOM_USART_EXT_CTRLA) Transmit Data Pinout Position */
#define SERCOM_USART_EXT_CTRLA_TXPO_Msk                                                                                \
        (_UINT32_(0x3) << SERCOM_USART_EXT_CTRLA_TXPO_Pos) /* (SERCOM_USART_EXT_CTRLA) Transmit Data Pinout Mask */
#define SERCOM_USART_EXT_CTRLA_TXPO(value)                                                                             \
        (SERCOM_USART_EXT_CTRLA_TXPO_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLA_TXPO_Pos)) /* Assigment of value for TXPO in the                   \
                                                                  SERCOM_USART_EXT_CTRLA register */
#define SERCOM_USART_EXT_CTRLA_TXPO_PAD0_Val _UINT32_(0x0) /* (SERCOM_USART_EXT_CTRLA) PAD[0] = TxD; PAD[1] = XCK  */
#define SERCOM_USART_EXT_CTRLA_TXPO_PAD1_Val _UINT32_(0x1) /* (SERCOM_USART_EXT_CTRLA) PAD[2] = TxD; PAD[3] = XCK  */
#define SERCOM_USART_EXT_CTRLA_TXPO_PAD2_Val                                                                           \
        _UINT32_(0x2) /* (SERCOM_USART_EXT_CTRLA) PAD[0] = TxD; PAD[2] = RTS; PAD[3] = CTS  */
#define SERCOM_USART_EXT_CTRLA_TXPO_PAD0                                                                               \
        (SERCOM_USART_EXT_CTRLA_TXPO_PAD0_Val                                                                          \
         << SERCOM_USART_EXT_CTRLA_TXPO_Pos) /* (SERCOM_USART_EXT_CTRLA) PAD[0] = TxD; PAD[1] = XCK Position  */
#define SERCOM_USART_EXT_CTRLA_TXPO_PAD1                                                                               \
        (SERCOM_USART_EXT_CTRLA_TXPO_PAD1_Val                                                                          \
         << SERCOM_USART_EXT_CTRLA_TXPO_Pos) /* (SERCOM_USART_EXT_CTRLA) PAD[2] = TxD; PAD[3] = XCK Position  */
#define SERCOM_USART_EXT_CTRLA_TXPO_PAD2                                                                               \
        (SERCOM_USART_EXT_CTRLA_TXPO_PAD2_Val                                                                          \
         << SERCOM_USART_EXT_CTRLA_TXPO_Pos) /* (SERCOM_USART_EXT_CTRLA) PAD[0] = TxD; PAD[2] = RTS; PAD[3] = CTS      \
                                                Position  */
#define SERCOM_USART_EXT_CTRLA_RXPO_Pos _UINT32_(20) /* (SERCOM_USART_EXT_CTRLA) Receive Data Pinout Position */
#define SERCOM_USART_EXT_CTRLA_RXPO_Msk                                                                                \
        (_UINT32_(0x3) << SERCOM_USART_EXT_CTRLA_RXPO_Pos) /* (SERCOM_USART_EXT_CTRLA) Receive Data Pinout Mask */
#define SERCOM_USART_EXT_CTRLA_RXPO(value)                                                                             \
        (SERCOM_USART_EXT_CTRLA_RXPO_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLA_RXPO_Pos)) /* Assigment of value for RXPO in the                   \
                                                                  SERCOM_USART_EXT_CTRLA register */
#define SERCOM_USART_EXT_CTRLA_RXPO_PAD0_Val                                                                           \
        _UINT32_(0x0) /* (SERCOM_USART_EXT_CTRLA) SERCOM PAD[0] is used for data reception  */
#define SERCOM_USART_EXT_CTRLA_RXPO_PAD1_Val                                                                           \
        _UINT32_(0x1) /* (SERCOM_USART_EXT_CTRLA) SERCOM PAD[1] is used for data reception  */
#define SERCOM_USART_EXT_CTRLA_RXPO_PAD2_Val                                                                           \
        _UINT32_(0x2) /* (SERCOM_USART_EXT_CTRLA) SERCOM PAD[2] is used for data reception  */
#define SERCOM_USART_EXT_CTRLA_RXPO_PAD3_Val                                                                           \
        _UINT32_(0x3) /* (SERCOM_USART_EXT_CTRLA) SERCOM PAD[3] is used for data reception  */
#define SERCOM_USART_EXT_CTRLA_RXPO_PAD0                                                                               \
        (SERCOM_USART_EXT_CTRLA_RXPO_PAD0_Val                                                                          \
         << SERCOM_USART_EXT_CTRLA_RXPO_Pos) /* (SERCOM_USART_EXT_CTRLA) SERCOM PAD[0] is used for data reception      \
                                                Position  */
#define SERCOM_USART_EXT_CTRLA_RXPO_PAD1                                                                               \
        (SERCOM_USART_EXT_CTRLA_RXPO_PAD1_Val                                                                          \
         << SERCOM_USART_EXT_CTRLA_RXPO_Pos) /* (SERCOM_USART_EXT_CTRLA) SERCOM PAD[1] is used for data reception      \
                                                Position  */
#define SERCOM_USART_EXT_CTRLA_RXPO_PAD2                                                                               \
        (SERCOM_USART_EXT_CTRLA_RXPO_PAD2_Val                                                                          \
         << SERCOM_USART_EXT_CTRLA_RXPO_Pos) /* (SERCOM_USART_EXT_CTRLA) SERCOM PAD[2] is used for data reception      \
                                                Position  */
#define SERCOM_USART_EXT_CTRLA_RXPO_PAD3                                                                               \
        (SERCOM_USART_EXT_CTRLA_RXPO_PAD3_Val                                                                          \
         << SERCOM_USART_EXT_CTRLA_RXPO_Pos) /* (SERCOM_USART_EXT_CTRLA) SERCOM PAD[3] is used for data reception      \
                                                Position  */
#define SERCOM_USART_EXT_CTRLA_SAMPA_Pos _UINT32_(22) /* (SERCOM_USART_EXT_CTRLA) Sample Adjustment Position */
#define SERCOM_USART_EXT_CTRLA_SAMPA_Msk                                                                               \
        (_UINT32_(0x3) << SERCOM_USART_EXT_CTRLA_SAMPA_Pos) /* (SERCOM_USART_EXT_CTRLA) Sample Adjustment Mask */
#define SERCOM_USART_EXT_CTRLA_SAMPA(value)                                                                            \
        (SERCOM_USART_EXT_CTRLA_SAMPA_Msk &                                                                            \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLA_SAMPA_Pos)) /* Assigment of value for SAMPA in the                 \
                                                                   SERCOM_USART_EXT_CTRLA register */
#define SERCOM_USART_EXT_CTRLA_SAMPA_ADJ0_Val                                                                          \
        _UINT32_(0x0) /* (SERCOM_USART_EXT_CTRLA) 16x Over-sampling = 7-8-9; 8x Over-sampling = 3-4-5  */
#define SERCOM_USART_EXT_CTRLA_SAMPA_ADJ1_Val                                                                          \
        _UINT32_(0x1) /* (SERCOM_USART_EXT_CTRLA) 16x Over-sampling = 9-10-11; 8x Over-sampling = 4-5-6  */
#define SERCOM_USART_EXT_CTRLA_SAMPA_ADJ2_Val                                                                          \
        _UINT32_(0x2) /* (SERCOM_USART_EXT_CTRLA) 16x Over-sampling = 11-12-13; 8x Over-sampling = 5-6-7  */
#define SERCOM_USART_EXT_CTRLA_SAMPA_ADJ3_Val                                                                          \
        _UINT32_(0x3) /* (SERCOM_USART_EXT_CTRLA) 16x Over-sampling = 13-14-15; 8x Over-sampling = 6-7-8  */
#define SERCOM_USART_EXT_CTRLA_SAMPA_ADJ0                                                                              \
        (SERCOM_USART_EXT_CTRLA_SAMPA_ADJ0_Val                                                                         \
         << SERCOM_USART_EXT_CTRLA_SAMPA_Pos) /* (SERCOM_USART_EXT_CTRLA) 16x Over-sampling = 7-8-9; 8x Over-sampling  \
                                                 = 3-4-5 Position  */
#define SERCOM_USART_EXT_CTRLA_SAMPA_ADJ1                                                                              \
        (SERCOM_USART_EXT_CTRLA_SAMPA_ADJ1_Val                                                                         \
         << SERCOM_USART_EXT_CTRLA_SAMPA_Pos) /* (SERCOM_USART_EXT_CTRLA) 16x Over-sampling = 9-10-11; 8x              \
                                                 Over-sampling = 4-5-6 Position  */
#define SERCOM_USART_EXT_CTRLA_SAMPA_ADJ2                                                                              \
        (SERCOM_USART_EXT_CTRLA_SAMPA_ADJ2_Val                                                                         \
         << SERCOM_USART_EXT_CTRLA_SAMPA_Pos) /* (SERCOM_USART_EXT_CTRLA) 16x Over-sampling = 11-12-13; 8x             \
                                                 Over-sampling = 5-6-7 Position  */
#define SERCOM_USART_EXT_CTRLA_SAMPA_ADJ3                                                                              \
        (SERCOM_USART_EXT_CTRLA_SAMPA_ADJ3_Val                                                                         \
         << SERCOM_USART_EXT_CTRLA_SAMPA_Pos) /* (SERCOM_USART_EXT_CTRLA) 16x Over-sampling = 13-14-15; 8x             \
                                                 Over-sampling = 6-7-8 Position  */
#define SERCOM_USART_EXT_CTRLA_FORM_Pos _UINT32_(24) /* (SERCOM_USART_EXT_CTRLA) Frame Format Position */
#define SERCOM_USART_EXT_CTRLA_FORM_Msk                                                                                \
        (_UINT32_(0xF) << SERCOM_USART_EXT_CTRLA_FORM_Pos) /* (SERCOM_USART_EXT_CTRLA) Frame Format Mask */
#define SERCOM_USART_EXT_CTRLA_FORM(value)                                                                             \
        (SERCOM_USART_EXT_CTRLA_FORM_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLA_FORM_Pos)) /* Assigment of value for FORM in the                   \
                                                                  SERCOM_USART_EXT_CTRLA register */
#define SERCOM_USART_EXT_CTRLA_FORM_USART_FRAME_NO_PARITY_Val _UINT32_(0x0) /* (SERCOM_USART_EXT_CTRLA) USART frame */
#define SERCOM_USART_EXT_CTRLA_FORM_USART_FRAME_WITH_PARITY_Val                                                        \
        _UINT32_(0x1) /* (SERCOM_USART_EXT_CTRLA) USART frame with parity  */
#define SERCOM_USART_EXT_CTRLA_FORM_USART_FRAME_AUTO_BAUD_NO_PARITY_Val                                                \
        _UINT32_(0x4) /* (SERCOM_USART_EXT_CTRLA) Auto-baud - break detection and auto-baud  */
#define SERCOM_USART_EXT_CTRLA_FORM_USART_FRAME_AUTO_BAUD_WITH_PARITY_Val                                              \
        _UINT32_(0x5) /* (SERCOM_USART_EXT_CTRLA) Auto-baud - break detection and auto-baud with parity  */
#define SERCOM_USART_EXT_CTRLA_FORM_USART_FRAME_NO_PARITY                                                              \
        (SERCOM_USART_EXT_CTRLA_FORM_USART_FRAME_NO_PARITY_Val                                                         \
         << SERCOM_USART_EXT_CTRLA_FORM_Pos) /* (SERCOM_USART_EXT_CTRLA) USART frame Position  */
#define SERCOM_USART_EXT_CTRLA_FORM_USART_FRAME_WITH_PARITY                                                            \
        (SERCOM_USART_EXT_CTRLA_FORM_USART_FRAME_WITH_PARITY_Val                                                       \
         << SERCOM_USART_EXT_CTRLA_FORM_Pos) /* (SERCOM_USART_EXT_CTRLA) USART frame with parity Position  */
#define SERCOM_USART_EXT_CTRLA_FORM_USART_FRAME_AUTO_BAUD_NO_PARITY                                                    \
        (SERCOM_USART_EXT_CTRLA_FORM_USART_FRAME_AUTO_BAUD_NO_PARITY_Val                                               \
         << SERCOM_USART_EXT_CTRLA_FORM_Pos) /* (SERCOM_USART_EXT_CTRLA) Auto-baud - break detection and auto-baud     \
                                                Position  */
#define SERCOM_USART_EXT_CTRLA_FORM_USART_FRAME_AUTO_BAUD_WITH_PARITY                                                  \
        (SERCOM_USART_EXT_CTRLA_FORM_USART_FRAME_AUTO_BAUD_WITH_PARITY_Val                                             \
         << SERCOM_USART_EXT_CTRLA_FORM_Pos) /* (SERCOM_USART_EXT_CTRLA) Auto-baud - break detection and auto-baud     \
                                                with parity Position  */
#define SERCOM_USART_EXT_CTRLA_CMODE_Pos _UINT32_(28) /* (SERCOM_USART_EXT_CTRLA) Communication Mode Position */
