ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
#define SERCOM_USART_EXT_CTRLA_CMODE_Msk                                                                               \
        (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLA_CMODE_Pos) /* (SERCOM_USART_EXT_CTRLA) Communication Mode Mask */
#define SERCOM_USART_EXT_CTRLA_CMODE(value)                                                                            \
        (SERCOM_USART_EXT_CTRLA_CMODE_Msk &                                                                            \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLA_CMODE_Pos)) /* Assigment of value for CMODE in the                 \
                                                                   SERCOM_USART_EXT_CTRLA register */
#define SERCOM_USART_EXT_CTRLA_CMODE_ASYNC_Val _UINT32_(0x0) /* (SERCOM_USART_EXT_CTRLA) Asynchronous Communication */
#define SERCOM_USART_EXT_CTRLA_CMODE_SYNC_Val _UINT32_(0x1) /* (SERCOM_USART_EXT_CTRLA) Synchronous Communication  */
#define SERCOM_USART_EXT_CTRLA_CMODE_ASYNC                                                                             \
        (SERCOM_USART_EXT_CTRLA_CMODE_ASYNC_Val                                                                        \
         << SERCOM_USART_EXT_CTRLA_CMODE_Pos) /* (SERCOM_USART_EXT_CTRLA) Asynchronous Communication Position  */
#define SERCOM_USART_EXT_CTRLA_CMODE_SYNC                                                                              \
        (SERCOM_USART_EXT_CTRLA_CMODE_SYNC_Val                                                                         \
         << SERCOM_USART_EXT_CTRLA_CMODE_Pos) /* (SERCOM_USART_EXT_CTRLA) Synchronous Communication Position  */
#define SERCOM_USART_EXT_CTRLA_CPOL_Pos _UINT32_(29) /* (SERCOM_USART_EXT_CTRLA) Clock Polarity Position */
#define SERCOM_USART_EXT_CTRLA_CPOL_Msk                                                                                \
        (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLA_CPOL_Pos) /* (SERCOM_USART_EXT_CTRLA) Clock Polarity Mask */
#define SERCOM_USART_EXT_CTRLA_CPOL(value)                                                                             \
        (SERCOM_USART_EXT_CTRLA_CPOL_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLA_CPOL_Pos)) /* Assigment of value for CPOL in the                   \
                                                                  SERCOM_USART_EXT_CTRLA register */
#define SERCOM_USART_EXT_CTRLA_CPOL_IDLE_LOW_Val                                                                       \
        _UINT32_(0x0) /* (SERCOM_USART_EXT_CTRLA) TxD Change:- Rising XCK edge, RxD Sample:- Falling XCK edge  */
#define SERCOM_USART_EXT_CTRLA_CPOL_IDLE_HIGH_Val                                                                      \
        _UINT32_(0x1) /* (SERCOM_USART_EXT_CTRLA) TxD Change:- Falling XCK edge, RxD Sample:- Rising XCK edge  */
#define SERCOM_USART_EXT_CTRLA_CPOL_IDLE_LOW                                                                           \
        (SERCOM_USART_EXT_CTRLA_CPOL_IDLE_LOW_Val                                                                      \
         << SERCOM_USART_EXT_CTRLA_CPOL_Pos) /* (SERCOM_USART_EXT_CTRLA) TxD Change:- Rising XCK edge, RxD Sample:-    \
                                                Falling XCK edge Position  */
#define SERCOM_USART_EXT_CTRLA_CPOL_IDLE_HIGH                                                                          \
        (SERCOM_USART_EXT_CTRLA_CPOL_IDLE_HIGH_Val                                                                     \
         << SERCOM_USART_EXT_CTRLA_CPOL_Pos) /* (SERCOM_USART_EXT_CTRLA) TxD Change:- Falling XCK edge, RxD Sample:-   \
                                                Rising XCK edge Position  */
#define SERCOM_USART_EXT_CTRLA_DORD_Pos _UINT32_(30) /* (SERCOM_USART_EXT_CTRLA) Data Order Position */
#define SERCOM_USART_EXT_CTRLA_DORD_Msk                                                                                \
        (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLA_DORD_Pos) /* (SERCOM_USART_EXT_CTRLA) Data Order Mask */
#define SERCOM_USART_EXT_CTRLA_DORD(value)                                                                             \
        (SERCOM_USART_EXT_CTRLA_DORD_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLA_DORD_Pos)) /* Assigment of value for DORD in the                   \
                                                                  SERCOM_USART_EXT_CTRLA register */
#define SERCOM_USART_EXT_CTRLA_DORD_MSB_Val _UINT32_(0x0) /* (SERCOM_USART_EXT_CTRLA) MSB is transmitted first  */
#define SERCOM_USART_EXT_CTRLA_DORD_LSB_Val _UINT32_(0x1) /* (SERCOM_USART_EXT_CTRLA) LSB is transmitted first  */
#define SERCOM_USART_EXT_CTRLA_DORD_MSB                                                                                \
        (SERCOM_USART_EXT_CTRLA_DORD_MSB_Val                                                                           \
         << SERCOM_USART_EXT_CTRLA_DORD_Pos) /* (SERCOM_USART_EXT_CTRLA) MSB is transmitted first Position  */
#define SERCOM_USART_EXT_CTRLA_DORD_LSB                                                                                \
        (SERCOM_USART_EXT_CTRLA_DORD_LSB_Val                                                                           \
         << SERCOM_USART_EXT_CTRLA_DORD_Pos) /* (SERCOM_USART_EXT_CTRLA) LSB is transmitted first Position  */
#define SERCOM_USART_EXT_CTRLA_Msk _UINT32_(0x7FF3E19F) /* (SERCOM_USART_EXT_CTRLA) Register Mask  */


/* -------- SERCOM_USART_INT_CTRLA : (SERCOM Offset: 0x00) (R/W 32) USART_INT Control A -------- */
#define SERCOM_USART_INT_CTRLA_RESETVALUE                                                                              \
        _UINT32_(0x00) /*  (SERCOM_USART_INT_CTRLA) USART_INT Control A  Reset Value */

#define SERCOM_USART_INT_CTRLA_SWRST_Pos _UINT32_(0) /* (SERCOM_USART_INT_CTRLA) Software Reset Position */
#define SERCOM_USART_INT_CTRLA_SWRST_Msk                                                                               \
        (_UINT32_(0x1) << SERCOM_USART_INT_CTRLA_SWRST_Pos) /* (SERCOM_USART_INT_CTRLA) Software Reset Mask */
#define SERCOM_USART_INT_CTRLA_SWRST(value)                                                                            \
        (SERCOM_USART_INT_CTRLA_SWRST_Msk &                                                                            \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the                 \
                                                                   SERCOM_USART_INT_CTRLA register */
#define SERCOM_USART_INT_CTRLA_ENABLE_Pos _UINT32_(1) /* (SERCOM_USART_INT_CTRLA) Enable Position */
#define SERCOM_USART_INT_CTRLA_ENABLE_Msk                                                                              \
        (_UINT32_(0x1) << SERCOM_USART_INT_CTRLA_ENABLE_Pos) /* (SERCOM_USART_INT_CTRLA) Enable Mask */
#define SERCOM_USART_INT_CTRLA_ENABLE(value)                                                                           \
        (SERCOM_USART_INT_CTRLA_ENABLE_Msk &                                                                           \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the               \
                                                                    SERCOM_USART_INT_CTRLA register */
#define SERCOM_USART_INT_CTRLA_MODE_Pos _UINT32_(2) /* (SERCOM_USART_INT_CTRLA) Operating Mode Position */
#define SERCOM_USART_INT_CTRLA_MODE_Msk                                                                                \
        (_UINT32_(0x7) << SERCOM_USART_INT_CTRLA_MODE_Pos) /* (SERCOM_USART_INT_CTRLA) Operating Mode Mask */
#define SERCOM_USART_INT_CTRLA_MODE(value)                                                                             \
        (SERCOM_USART_INT_CTRLA_MODE_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLA_MODE_Pos)) /* Assigment of value for MODE in the                   \
                                                                  SERCOM_USART_INT_CTRLA register */
#define SERCOM_USART_INT_CTRLA_MODE_USART_EXT_CLK_Val                                                                  \
        _UINT32_(0x0) /* (SERCOM_USART_INT_CTRLA) USART with external clock  */
#define SERCOM_USART_INT_CTRLA_MODE_USART_INT_CLK_Val                                                                  \
        _UINT32_(0x1) /* (SERCOM_USART_INT_CTRLA) USART with internal clock  */
#define SERCOM_USART_INT_CTRLA_MODE_SPI_SLAVE_Val _UINT32_(0x2) /* (SERCOM_USART_INT_CTRLA) SPI in slave operation  */
#define SERCOM_USART_INT_CTRLA_MODE_SPI_MASTER_Val _UINT32_(0x3) /* (SERCOM_USART_INT_CTRLA) SPI in master operation   \
                                                                  */
#define SERCOM_USART_INT_CTRLA_MODE_I2C_SLAVE_Val _UINT32_(0x4) /* (SERCOM_USART_INT_CTRLA) I2C slave operation  */
#define SERCOM_USART_INT_CTRLA_MODE_I2C_MASTER_Val _UINT32_(0x5) /* (SERCOM_USART_INT_CTRLA) I2C master operation  */
#define SERCOM_USART_INT_CTRLA_MODE_USART_EXT_CLK                                                                      \
        (SERCOM_USART_INT_CTRLA_MODE_USART_EXT_CLK_Val                                                                 \
         << SERCOM_USART_INT_CTRLA_MODE_Pos) /* (SERCOM_USART_INT_CTRLA) USART with external clock Position  */
#define SERCOM_USART_INT_CTRLA_MODE_USART_INT_CLK                                                                      \
        (SERCOM_USART_INT_CTRLA_MODE_USART_INT_CLK_Val                                                                 \
         << SERCOM_USART_INT_CTRLA_MODE_Pos) /* (SERCOM_USART_INT_CTRLA) USART with internal clock Position  */
#define SERCOM_USART_INT_CTRLA_MODE_SPI_SLAVE                                                                          \
        (SERCOM_USART_INT_CTRLA_MODE_SPI_SLAVE_Val                                                                     \
         << SERCOM_USART_INT_CTRLA_MODE_Pos) /* (SERCOM_USART_INT_CTRLA) SPI in slave operation Position  */
#define SERCOM_USART_INT_CTRLA_MODE_SPI_MASTER                                                                         \
        (SERCOM_USART_INT_CTRLA_MODE_SPI_MASTER_Val                                                                    \
         << SERCOM_USART_INT_CTRLA_MODE_Pos) /* (SERCOM_USART_INT_CTRLA) SPI in master operation Position  */
#define SERCOM_USART_INT_CTRLA_MODE_I2C_SLAVE                                                                          \
        (SERCOM_USART_INT_CTRLA_MODE_I2C_SLAVE_Val                                                                     \
         << SERCOM_USART_INT_CTRLA_MODE_Pos) /* (SERCOM_USART_INT_CTRLA) I2C slave operation Position  */
#define SERCOM_USART_INT_CTRLA_MODE_I2C_MASTER                                                                         \
        (SERCOM_USART_INT_CTRLA_MODE_I2C_MASTER_Val                                                                    \
         << SERCOM_USART_INT_CTRLA_MODE_Pos) /* (SERCOM_USART_INT_CTRLA) I2C master operation Position  */
#define SERCOM_USART_INT_CTRLA_RUNSTDBY_Pos _UINT32_(7) /* (SERCOM_USART_INT_CTRLA) Run during Standby Position */
#define SERCOM_USART_INT_CTRLA_RUNSTDBY_Msk                                                                            \
        (_UINT32_(0x1) << SERCOM_USART_INT_CTRLA_RUNSTDBY_Pos) /* (SERCOM_USART_INT_CTRLA) Run during Standby Mask */
#define SERCOM_USART_INT_CTRLA_RUNSTDBY(value)                                                                         \
        (SERCOM_USART_INT_CTRLA_RUNSTDBY_Msk &                                                                         \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the           \
                                                                      SERCOM_USART_INT_CTRLA register */
#define SERCOM_USART_INT_CTRLA_IBON_Pos                                                                                \
        _UINT32_(8) /* (SERCOM_USART_INT_CTRLA) Immediate Buffer Overflow Notification Position */
#define SERCOM_USART_INT_CTRLA_IBON_Msk                                                                                \
        (_UINT32_(0x1) << SERCOM_USART_INT_CTRLA_IBON_Pos) /* (SERCOM_USART_INT_CTRLA) Immediate Buffer Overflow       \
                                                              Notification Mask */
#define SERCOM_USART_INT_CTRLA_IBON(value)                                                                             \
        (SERCOM_USART_INT_CTRLA_IBON_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLA_IBON_Pos)) /* Assigment of value for IBON in the                   \
                                                                  SERCOM_USART_INT_CTRLA register */
#define SERCOM_USART_INT_CTRLA_SAMPR_Pos _UINT32_(13) /* (SERCOM_USART_INT_CTRLA) Sample Position */
#define SERCOM_USART_INT_CTRLA_SAMPR_Msk                                                                               \
        (_UINT32_(0x7) << SERCOM_USART_INT_CTRLA_SAMPR_Pos) /* (SERCOM_USART_INT_CTRLA) Sample Mask */
#define SERCOM_USART_INT_CTRLA_SAMPR(value)                                                                            \
        (SERCOM_USART_INT_CTRLA_SAMPR_Msk &                                                                            \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLA_SAMPR_Pos)) /* Assigment of value for SAMPR in the                 \
                                                                   SERCOM_USART_INT_CTRLA register */
#define SERCOM_USART_INT_CTRLA_SAMPR_16X_ARITHMETIC_Val                                                                \
        _UINT32_(0x0) /* (SERCOM_USART_INT_CTRLA) 16x over-sampling using arithmetic baudrate generation  */
#define SERCOM_USART_INT_CTRLA_SAMPR_16X_FRACTIONAL_Val                                                                \
        _UINT32_(0x1) /* (SERCOM_USART_INT_CTRLA) 16x over-sampling using fractional baudrate generation  */
#define SERCOM_USART_INT_CTRLA_SAMPR_8X_ARITHMETIC_Val                                                                 \
        _UINT32_(0x2) /* (SERCOM_USART_INT_CTRLA) 8x over-sampling using arithmetic baudrate generation  */
#define SERCOM_USART_INT_CTRLA_SAMPR_8X_FRACTIONAL_Val                                                                 \
        _UINT32_(0x3) /* (SERCOM_USART_INT_CTRLA) 8x over-sampling using fractional baudrate generation  */
#define SERCOM_USART_INT_CTRLA_SAMPR_3X_ARITHMETIC_Val                                                                 \
        _UINT32_(0x4) /* (SERCOM_USART_INT_CTRLA) 3x over-sampling using arithmetic baudrate generation  */
#define SERCOM_USART_INT_CTRLA_SAMPR_16X_ARITHMETIC                                                                    \
        (SERCOM_USART_INT_CTRLA_SAMPR_16X_ARITHMETIC_Val                                                               \
         << SERCOM_USART_INT_CTRLA_SAMPR_Pos) /* (SERCOM_USART_INT_CTRLA) 16x over-sampling using arithmetic baudrate  \
                                                 generation Position  */
#define SERCOM_USART_INT_CTRLA_SAMPR_16X_FRACTIONAL                                                                    \
        (SERCOM_USART_INT_CTRLA_SAMPR_16X_FRACTIONAL_Val                                                               \
         << SERCOM_USART_INT_CTRLA_SAMPR_Pos) /* (SERCOM_USART_INT_CTRLA) 16x over-sampling using fractional baudrate  \
                                                 generation Position  */
#define SERCOM_USART_INT_CTRLA_SAMPR_8X_ARITHMETIC                                                                     \
        (SERCOM_USART_INT_CTRLA_SAMPR_8X_ARITHMETIC_Val                                                                \
         << SERCOM_USART_INT_CTRLA_SAMPR_Pos) /* (SERCOM_USART_INT_CTRLA) 8x over-sampling using arithmetic baudrate   \
                                                 generation Position  */
#define SERCOM_USART_INT_CTRLA_SAMPR_8X_FRACTIONAL                                                                     \
        (SERCOM_USART_INT_CTRLA_SAMPR_8X_FRACTIONAL_Val                                                                \
         << SERCOM_USART_INT_CTRLA_SAMPR_Pos) /* (SERCOM_USART_INT_CTRLA) 8x over-sampling using fractional baudrate   \
                                                 generation Position  */
#define SERCOM_USART_INT_CTRLA_SAMPR_3X_ARITHMETIC                                                                     \
        (SERCOM_USART_INT_CTRLA_SAMPR_3X_ARITHMETIC_Val                                                                \
         << SERCOM_USART_INT_CTRLA_SAMPR_Pos) /* (SERCOM_USART_INT_CTRLA) 3x over-sampling using arithmetic baudrate   \
                                                 generation Position  */
#define SERCOM_USART_INT_CTRLA_TXPO_Pos _UINT32_(16) /* (SERCOM_USART_INT_CTRLA) Transmit Data Pinout Position */
#define SERCOM_USART_INT_CTRLA_TXPO_Msk                                                                                \
        (_UINT32_(0x3) << SERCOM_USART_INT_CTRLA_TXPO_Pos) /* (SERCOM_USART_INT_CTRLA) Transmit Data Pinout Mask */
#define SERCOM_USART_INT_CTRLA_TXPO(value)                                                                             \
        (SERCOM_USART_INT_CTRLA_TXPO_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLA_TXPO_Pos)) /* Assigment of value for TXPO in the                   \
                                                                  SERCOM_USART_INT_CTRLA register */
#define SERCOM_USART_INT_CTRLA_TXPO_PAD0_Val _UINT32_(0x0) /* (SERCOM_USART_INT_CTRLA) PAD[0] = TxD; PAD[1] = XCK  */
#define SERCOM_USART_INT_CTRLA_TXPO_PAD1_Val _UINT32_(0x1) /* (SERCOM_USART_INT_CTRLA) PAD[2] = TxD; PAD[3] = XCK  */
#define SERCOM_USART_INT_CTRLA_TXPO_PAD2_Val                                                                           \
        _UINT32_(0x2) /* (SERCOM_USART_INT_CTRLA) PAD[0] = TxD; PAD[2] = RTS; PAD[3] = CTS  */
#define SERCOM_USART_INT_CTRLA_TXPO_PAD0                                                                               \
        (SERCOM_USART_INT_CTRLA_TXPO_PAD0_Val                                                                          \
         << SERCOM_USART_INT_CTRLA_TXPO_Pos) /* (SERCOM_USART_INT_CTRLA) PAD[0] = TxD; PAD[1] = XCK Position  */
#define SERCOM_USART_INT_CTRLA_TXPO_PAD1                                                                               \
        (SERCOM_USART_INT_CTRLA_TXPO_PAD1_Val                                                                          \
         << SERCOM_USART_INT_CTRLA_TXPO_Pos) /* (SERCOM_USART_INT_CTRLA) PAD[2] = TxD; PAD[3] = XCK Position  */
#define SERCOM_USART_INT_CTRLA_TXPO_PAD2                                                                               \
        (SERCOM_USART_INT_CTRLA_TXPO_PAD2_Val                                                                          \
         << SERCOM_USART_INT_CTRLA_TXPO_Pos) /* (SERCOM_USART_INT_CTRLA) PAD[0] = TxD; PAD[2] = RTS; PAD[3] = CTS      \
                                                Position  */
#define SERCOM_USART_INT_CTRLA_RXPO_Pos _UINT32_(20) /* (SERCOM_USART_INT_CTRLA) Receive Data Pinout Position */
#define SERCOM_USART_INT_CTRLA_RXPO_Msk                                                                                \
        (_UINT32_(0x3) << SERCOM_USART_INT_CTRLA_RXPO_Pos) /* (SERCOM_USART_INT_CTRLA) Receive Data Pinout Mask */
#define SERCOM_USART_INT_CTRLA_RXPO(value)                                                                             \
        (SERCOM_USART_INT_CTRLA_RXPO_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLA_RXPO_Pos)) /* Assigment of value for RXPO in the                   \
                                                                  SERCOM_USART_INT_CTRLA register */
#define SERCOM_USART_INT_CTRLA_RXPO_PAD0_Val                                                                           \
        _UINT32_(0x0) /* (SERCOM_USART_INT_CTRLA) SERCOM PAD[0] is used for data reception  */
#define SERCOM_USART_INT_CTRLA_RXPO_PAD1_Val                                                                           \
        _UINT32_(0x1) /* (SERCOM_USART_INT_CTRLA) SERCOM PAD[1] is used for data reception  */
#define SERCOM_USART_INT_CTRLA_RXPO_PAD2_Val                                                                           \
        _UINT32_(0x2) /* (SERCOM_USART_INT_CTRLA) SERCOM PAD[2] is used for data reception  */
#define SERCOM_USART_INT_CTRLA_RXPO_PAD3_Val                                                                           \
        _UINT32_(0x3) /* (SERCOM_USART_INT_CTRLA) SERCOM PAD[3] is used for data reception  */
#define SERCOM_USART_INT_CTRLA_RXPO_PAD0                                                                               \
        (SERCOM_USART_INT_CTRLA_RXPO_PAD0_Val                                                                          \
         << SERCOM_USART_INT_CTRLA_RXPO_Pos) /* (SERCOM_USART_INT_CTRLA) SERCOM PAD[0] is used for data reception      \
                                                Position  */
#define SERCOM_USART_INT_CTRLA_RXPO_PAD1                                                                               \
        (SERCOM_USART_INT_CTRLA_RXPO_PAD1_Val                                                                          \
         << SERCOM_USART_INT_CTRLA_RXPO_Pos) /* (SERCOM_USART_INT_CTRLA) SERCOM PAD[1] is used for data reception      \
                                                Position  */
#define SERCOM_USART_INT_CTRLA_RXPO_PAD2                                                                               \
        (SERCOM_USART_INT_CTRLA_RXPO_PAD2_Val                                                                          \
         << SERCOM_USART_INT_CTRLA_RXPO_Pos) /* (SERCOM_USART_INT_CTRLA) SERCOM PAD[2] is used for data reception      \
                                                Position  */
#define SERCOM_USART_INT_CTRLA_RXPO_PAD3                                                                               \
        (SERCOM_USART_INT_CTRLA_RXPO_PAD3_Val                                                                          \
         << SERCOM_USART_INT_CTRLA_RXPO_Pos) /* (SERCOM_USART_INT_CTRLA) SERCOM PAD[3] is used for data reception      \
                                                Position  */
#define SERCOM_USART_INT_CTRLA_SAMPA_Pos _UINT32_(22) /* (SERCOM_USART_INT_CTRLA) Sample Adjustment Position */
#define SERCOM_USART_INT_CTRLA_SAMPA_Msk                                                                               \
        (_UINT32_(0x3) << SERCOM_USART_INT_CTRLA_SAMPA_Pos) /* (SERCOM_USART_INT_CTRLA) Sample Adjustment Mask */
#define SERCOM_USART_INT_CTRLA_SAMPA(value)                                                                            \
        (SERCOM_USART_INT_CTRLA_SAMPA_Msk &                                                                            \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLA_SAMPA_Pos)) /* Assigment of value for SAMPA in the                 \
                                                                   SERCOM_USART_INT_CTRLA register */
