ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
#define SERCOM_USART_INT_CTRLA_SAMPA_ADJ0_Val                                                                          \
        _UINT32_(0x0) /* (SERCOM_USART_INT_CTRLA) 16x Over-sampling = 7-8-9; 8x Over-sampling = 3-4-5  */
#define SERCOM_USART_INT_CTRLA_SAMPA_ADJ1_Val                                                                          \
        _UINT32_(0x1) /* (SERCOM_USART_INT_CTRLA) 16x Over-sampling = 9-10-11; 8x Over-sampling = 4-5-6  */
#define SERCOM_USART_INT_CTRLA_SAMPA_ADJ2_Val                                                                          \
        _UINT32_(0x2) /* (SERCOM_USART_INT_CTRLA) 16x Over-sampling = 11-12-13; 8x Over-sampling = 5-6-7  */
#define SERCOM_USART_INT_CTRLA_SAMPA_ADJ3_Val                                                                          \
        _UINT32_(0x3) /* (SERCOM_USART_INT_CTRLA) 16x Over-sampling = 13-14-15; 8x Over-sampling = 6-7-8  */
#define SERCOM_USART_INT_CTRLA_SAMPA_ADJ0                                                                              \
        (SERCOM_USART_INT_CTRLA_SAMPA_ADJ0_Val                                                                         \
         << SERCOM_USART_INT_CTRLA_SAMPA_Pos) /* (SERCOM_USART_INT_CTRLA) 16x Over-sampling = 7-8-9; 8x Over-sampling  \
                                                 = 3-4-5 Position  */
#define SERCOM_USART_INT_CTRLA_SAMPA_ADJ1                                                                              \
        (SERCOM_USART_INT_CTRLA_SAMPA_ADJ1_Val                                                                         \
         << SERCOM_USART_INT_CTRLA_SAMPA_Pos) /* (SERCOM_USART_INT_CTRLA) 16x Over-sampling = 9-10-11; 8x              \
                                                 Over-sampling = 4-5-6 Position  */
#define SERCOM_USART_INT_CTRLA_SAMPA_ADJ2                                                                              \
        (SERCOM_USART_INT_CTRLA_SAMPA_ADJ2_Val                                                                         \
         << SERCOM_USART_INT_CTRLA_SAMPA_Pos) /* (SERCOM_USART_INT_CTRLA) 16x Over-sampling = 11-12-13; 8x             \
                                                 Over-sampling = 5-6-7 Position  */
#define SERCOM_USART_INT_CTRLA_SAMPA_ADJ3                                                                              \
        (SERCOM_USART_INT_CTRLA_SAMPA_ADJ3_Val                                                                         \
         << SERCOM_USART_INT_CTRLA_SAMPA_Pos) /* (SERCOM_USART_INT_CTRLA) 16x Over-sampling = 13-14-15; 8x             \
                                                 Over-sampling = 6-7-8 Position  */
#define SERCOM_USART_INT_CTRLA_FORM_Pos _UINT32_(24) /* (SERCOM_USART_INT_CTRLA) Frame Format Position */
#define SERCOM_USART_INT_CTRLA_FORM_Msk                                                                                \
        (_UINT32_(0xF) << SERCOM_USART_INT_CTRLA_FORM_Pos) /* (SERCOM_USART_INT_CTRLA) Frame Format Mask */
#define SERCOM_USART_INT_CTRLA_FORM(value)                                                                             \
        (SERCOM_USART_INT_CTRLA_FORM_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLA_FORM_Pos)) /* Assigment of value for FORM in the                   \
                                                                  SERCOM_USART_INT_CTRLA register */
#define SERCOM_USART_INT_CTRLA_FORM_USART_FRAME_NO_PARITY_Val _UINT32_(0x0) /* (SERCOM_USART_INT_CTRLA) USART frame */
#define SERCOM_USART_INT_CTRLA_FORM_USART_FRAME_WITH_PARITY_Val                                                        \
        _UINT32_(0x1) /* (SERCOM_USART_INT_CTRLA) USART frame with parity  */
#define SERCOM_USART_INT_CTRLA_FORM_USART_FRAME_AUTO_BAUD_NO_PARITY_Val                                                \
        _UINT32_(0x4) /* (SERCOM_USART_INT_CTRLA) Auto-baud - break detection and auto-baud  */
#define SERCOM_USART_INT_CTRLA_FORM_USART_FRAME_AUTO_BAUD_WITH_PARITY_Val                                              \
        _UINT32_(0x5) /* (SERCOM_USART_INT_CTRLA) Auto-baud - break detection and auto-baud with parity  */
#define SERCOM_USART_INT_CTRLA_FORM_USART_FRAME_NO_PARITY                                                              \
        (SERCOM_USART_INT_CTRLA_FORM_USART_FRAME_NO_PARITY_Val                                                         \
         << SERCOM_USART_INT_CTRLA_FORM_Pos) /* (SERCOM_USART_INT_CTRLA) USART frame Position  */
#define SERCOM_USART_INT_CTRLA_FORM_USART_FRAME_WITH_PARITY                                                            \
        (SERCOM_USART_INT_CTRLA_FORM_USART_FRAME_WITH_PARITY_Val                                                       \
         << SERCOM_USART_INT_CTRLA_FORM_Pos) /* (SERCOM_USART_INT_CTRLA) USART frame with parity Position  */
#define SERCOM_USART_INT_CTRLA_FORM_USART_FRAME_AUTO_BAUD_NO_PARITY                                                    \
        (SERCOM_USART_INT_CTRLA_FORM_USART_FRAME_AUTO_BAUD_NO_PARITY_Val                                               \
         << SERCOM_USART_INT_CTRLA_FORM_Pos) /* (SERCOM_USART_INT_CTRLA) Auto-baud - break detection and auto-baud     \
                                                Position  */
#define SERCOM_USART_INT_CTRLA_FORM_USART_FRAME_AUTO_BAUD_WITH_PARITY                                                  \
        (SERCOM_USART_INT_CTRLA_FORM_USART_FRAME_AUTO_BAUD_WITH_PARITY_Val                                             \
         << SERCOM_USART_INT_CTRLA_FORM_Pos) /* (SERCOM_USART_INT_CTRLA) Auto-baud - break detection and auto-baud     \
                                                with parity Position  */
#define SERCOM_USART_INT_CTRLA_CMODE_Pos _UINT32_(28) /* (SERCOM_USART_INT_CTRLA) Communication Mode Position */
#define SERCOM_USART_INT_CTRLA_CMODE_Msk                                                                               \
        (_UINT32_(0x1) << SERCOM_USART_INT_CTRLA_CMODE_Pos) /* (SERCOM_USART_INT_CTRLA) Communication Mode Mask */
#define SERCOM_USART_INT_CTRLA_CMODE(value)                                                                            \
        (SERCOM_USART_INT_CTRLA_CMODE_Msk &                                                                            \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLA_CMODE_Pos)) /* Assigment of value for CMODE in the                 \
                                                                   SERCOM_USART_INT_CTRLA register */
#define SERCOM_USART_INT_CTRLA_CMODE_ASYNC_Val _UINT32_(0x0) /* (SERCOM_USART_INT_CTRLA) Asynchronous Communication */
#define SERCOM_USART_INT_CTRLA_CMODE_SYNC_Val _UINT32_(0x1) /* (SERCOM_USART_INT_CTRLA) Synchronous Communication  */
#define SERCOM_USART_INT_CTRLA_CMODE_ASYNC                                                                             \
        (SERCOM_USART_INT_CTRLA_CMODE_ASYNC_Val                                                                        \
         << SERCOM_USART_INT_CTRLA_CMODE_Pos) /* (SERCOM_USART_INT_CTRLA) Asynchronous Communication Position  */
#define SERCOM_USART_INT_CTRLA_CMODE_SYNC                                                                              \
        (SERCOM_USART_INT_CTRLA_CMODE_SYNC_Val                                                                         \
         << SERCOM_USART_INT_CTRLA_CMODE_Pos) /* (SERCOM_USART_INT_CTRLA) Synchronous Communication Position  */
#define SERCOM_USART_INT_CTRLA_CPOL_Pos _UINT32_(29) /* (SERCOM_USART_INT_CTRLA) Clock Polarity Position */
#define SERCOM_USART_INT_CTRLA_CPOL_Msk                                                                                \
        (_UINT32_(0x1) << SERCOM_USART_INT_CTRLA_CPOL_Pos) /* (SERCOM_USART_INT_CTRLA) Clock Polarity Mask */
#define SERCOM_USART_INT_CTRLA_CPOL(value)                                                                             \
        (SERCOM_USART_INT_CTRLA_CPOL_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLA_CPOL_Pos)) /* Assigment of value for CPOL in the                   \
                                                                  SERCOM_USART_INT_CTRLA register */
#define SERCOM_USART_INT_CTRLA_CPOL_IDLE_LOW_Val                                                                       \
        _UINT32_(0x0) /* (SERCOM_USART_INT_CTRLA) TxD Change:- Rising XCK edge, RxD Sample:- Falling XCK edge  */
#define SERCOM_USART_INT_CTRLA_CPOL_IDLE_HIGH_Val                                                                      \
        _UINT32_(0x1) /* (SERCOM_USART_INT_CTRLA) TxD Change:- Falling XCK edge, RxD Sample:- Rising XCK edge  */
#define SERCOM_USART_INT_CTRLA_CPOL_IDLE_LOW                                                                           \
        (SERCOM_USART_INT_CTRLA_CPOL_IDLE_LOW_Val                                                                      \
         << SERCOM_USART_INT_CTRLA_CPOL_Pos) /* (SERCOM_USART_INT_CTRLA) TxD Change:- Rising XCK edge, RxD Sample:-    \
                                                Falling XCK edge Position  */
#define SERCOM_USART_INT_CTRLA_CPOL_IDLE_HIGH                                                                          \
        (SERCOM_USART_INT_CTRLA_CPOL_IDLE_HIGH_Val                                                                     \
         << SERCOM_USART_INT_CTRLA_CPOL_Pos) /* (SERCOM_USART_INT_CTRLA) TxD Change:- Falling XCK edge, RxD Sample:-   \
                                                Rising XCK edge Position  */
#define SERCOM_USART_INT_CTRLA_DORD_Pos _UINT32_(30) /* (SERCOM_USART_INT_CTRLA) Data Order Position */
#define SERCOM_USART_INT_CTRLA_DORD_Msk                                                                                \
        (_UINT32_(0x1) << SERCOM_USART_INT_CTRLA_DORD_Pos) /* (SERCOM_USART_INT_CTRLA) Data Order Mask */
#define SERCOM_USART_INT_CTRLA_DORD(value)                                                                             \
        (SERCOM_USART_INT_CTRLA_DORD_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLA_DORD_Pos)) /* Assigment of value for DORD in the                   \
                                                                  SERCOM_USART_INT_CTRLA register */
#define SERCOM_USART_INT_CTRLA_DORD_MSB_Val _UINT32_(0x0) /* (SERCOM_USART_INT_CTRLA) MSB is transmitted first  */
#define SERCOM_USART_INT_CTRLA_DORD_LSB_Val _UINT32_(0x1) /* (SERCOM_USART_INT_CTRLA) LSB is transmitted first  */
#define SERCOM_USART_INT_CTRLA_DORD_MSB                                                                                \
        (SERCOM_USART_INT_CTRLA_DORD_MSB_Val                                                                           \
         << SERCOM_USART_INT_CTRLA_DORD_Pos) /* (SERCOM_USART_INT_CTRLA) MSB is transmitted first Position  */
#define SERCOM_USART_INT_CTRLA_DORD_LSB                                                                                \
        (SERCOM_USART_INT_CTRLA_DORD_LSB_Val                                                                           \
         << SERCOM_USART_INT_CTRLA_DORD_Pos) /* (SERCOM_USART_INT_CTRLA) LSB is transmitted first Position  */
#define SERCOM_USART_INT_CTRLA_Msk _UINT32_(0x7FF3E19F) /* (SERCOM_USART_INT_CTRLA) Register Mask  */


