ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
/* -------- SERCOM_I2CM_CTRLB : (SERCOM Offset: 0x04) (R/W 32) I2CM Control B -------- */
#define SERCOM_I2CM_CTRLB_RESETVALUE _UINT32_(0x00) /*  (SERCOM_I2CM_CTRLB) I2CM Control B  Reset Value */

#define SERCOM_I2CM_CTRLB_SMEN_Pos _UINT32_(8) /* (SERCOM_I2CM_CTRLB) Smart Mode Enable Position */
#define SERCOM_I2CM_CTRLB_SMEN_Msk                                                                                     \
        (_UINT32_(0x1) << SERCOM_I2CM_CTRLB_SMEN_Pos) /* (SERCOM_I2CM_CTRLB) Smart Mode Enable Mask */
#define SERCOM_I2CM_CTRLB_SMEN(value)                                                                                  \
        (SERCOM_I2CM_CTRLB_SMEN_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CM_CTRLB_SMEN_Pos)) /* Assigment of value for SMEN in the SERCOM_I2CM_CTRLB register */
#define SERCOM_I2CM_CTRLB_QCEN_Pos _UINT32_(9) /* (SERCOM_I2CM_CTRLB) Quick Command Enable Position */
#define SERCOM_I2CM_CTRLB_QCEN_Msk                                                                                     \
        (_UINT32_(0x1) << SERCOM_I2CM_CTRLB_QCEN_Pos) /* (SERCOM_I2CM_CTRLB) Quick Command Enable Mask */
#define SERCOM_I2CM_CTRLB_QCEN(value)                                                                                  \
        (SERCOM_I2CM_CTRLB_QCEN_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CM_CTRLB_QCEN_Pos)) /* Assigment of value for QCEN in the SERCOM_I2CM_CTRLB register */
#define SERCOM_I2CM_CTRLB_CMD_Pos _UINT32_(16) /* (SERCOM_I2CM_CTRLB) Command Position */
#define SERCOM_I2CM_CTRLB_CMD_Msk (_UINT32_(0x3) << SERCOM_I2CM_CTRLB_CMD_Pos) /* (SERCOM_I2CM_CTRLB) Command Mask */
#define SERCOM_I2CM_CTRLB_CMD(value)                                                                                   \
        (SERCOM_I2CM_CTRLB_CMD_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CM_CTRLB_CMD_Pos)) /* Assigment of value for CMD in the SERCOM_I2CM_CTRLB register */
#define SERCOM_I2CM_CTRLB_ACKACT_Pos _UINT32_(18) /* (SERCOM_I2CM_CTRLB) Acknowledge Action Position */
#define SERCOM_I2CM_CTRLB_ACKACT_Msk                                                                                   \
        (_UINT32_(0x1) << SERCOM_I2CM_CTRLB_ACKACT_Pos) /* (SERCOM_I2CM_CTRLB) Acknowledge Action Mask */
#define SERCOM_I2CM_CTRLB_ACKACT(value)                                                                                \
        (SERCOM_I2CM_CTRLB_ACKACT_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CM_CTRLB_ACKACT_Pos)) /* Assigment of value for ACKACT in the SERCOM_I2CM_CTRLB register */
#define SERCOM_I2CM_CTRLB_Msk _UINT32_(0x00070300) /* (SERCOM_I2CM_CTRLB) Register Mask  */


/* -------- SERCOM_I2CS_CTRLB : (SERCOM Offset: 0x04) (R/W 32) I2CS Control B -------- */
#define SERCOM_I2CS_CTRLB_RESETVALUE _UINT32_(0x00) /*  (SERCOM_I2CS_CTRLB) I2CS Control B  Reset Value */

#define SERCOM_I2CS_CTRLB_SMEN_Pos _UINT32_(8) /* (SERCOM_I2CS_CTRLB) Smart Mode Enable Position */
#define SERCOM_I2CS_CTRLB_SMEN_Msk                                                                                     \
        (_UINT32_(0x1) << SERCOM_I2CS_CTRLB_SMEN_Pos) /* (SERCOM_I2CS_CTRLB) Smart Mode Enable Mask */
#define SERCOM_I2CS_CTRLB_SMEN(value)                                                                                  \
        (SERCOM_I2CS_CTRLB_SMEN_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLB_SMEN_Pos)) /* Assigment of value for SMEN in the SERCOM_I2CS_CTRLB register */
#define SERCOM_I2CS_CTRLB_GCMD_Pos _UINT32_(9) /* (SERCOM_I2CS_CTRLB) PMBus Group Command Position */
#define SERCOM_I2CS_CTRLB_GCMD_Msk                                                                                     \
        (_UINT32_(0x1) << SERCOM_I2CS_CTRLB_GCMD_Pos) /* (SERCOM_I2CS_CTRLB) PMBus Group Command Mask */
#define SERCOM_I2CS_CTRLB_GCMD(value)                                                                                  \
        (SERCOM_I2CS_CTRLB_GCMD_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLB_GCMD_Pos)) /* Assigment of value for GCMD in the SERCOM_I2CS_CTRLB register */
#define SERCOM_I2CS_CTRLB_AACKEN_Pos _UINT32_(10) /* (SERCOM_I2CS_CTRLB) Automatic Address Acknowledge Position */
#define SERCOM_I2CS_CTRLB_AACKEN_Msk                                                                                   \
        (_UINT32_(0x1) << SERCOM_I2CS_CTRLB_AACKEN_Pos) /* (SERCOM_I2CS_CTRLB) Automatic Address Acknowledge Mask */
#define SERCOM_I2CS_CTRLB_AACKEN(value)                                                                                \
        (SERCOM_I2CS_CTRLB_AACKEN_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLB_AACKEN_Pos)) /* Assigment of value for AACKEN in the SERCOM_I2CS_CTRLB register */
#define SERCOM_I2CS_CTRLB_AMODE_Pos _UINT32_(14) /* (SERCOM_I2CS_CTRLB) Address Mode Position */
#define SERCOM_I2CS_CTRLB_AMODE_Msk                                                                                    \
        (_UINT32_(0x3) << SERCOM_I2CS_CTRLB_AMODE_Pos) /* (SERCOM_I2CS_CTRLB) Address Mode Mask */
#define SERCOM_I2CS_CTRLB_AMODE(value)                                                                                 \
        (SERCOM_I2CS_CTRLB_AMODE_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLB_AMODE_Pos)) /* Assigment of value for AMODE in the SERCOM_I2CS_CTRLB register */
#define SERCOM_I2CS_CTRLB_CMD_Pos _UINT32_(16) /* (SERCOM_I2CS_CTRLB) Command Position */
#define SERCOM_I2CS_CTRLB_CMD_Msk (_UINT32_(0x3) << SERCOM_I2CS_CTRLB_CMD_Pos) /* (SERCOM_I2CS_CTRLB) Command Mask */
#define SERCOM_I2CS_CTRLB_CMD(value)                                                                                   \
        (SERCOM_I2CS_CTRLB_CMD_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLB_CMD_Pos)) /* Assigment of value for CMD in the SERCOM_I2CS_CTRLB register */
#define SERCOM_I2CS_CTRLB_ACKACT_Pos _UINT32_(18) /* (SERCOM_I2CS_CTRLB) Acknowledge Action Position */
#define SERCOM_I2CS_CTRLB_ACKACT_Msk                                                                                   \
        (_UINT32_(0x1) << SERCOM_I2CS_CTRLB_ACKACT_Pos) /* (SERCOM_I2CS_CTRLB) Acknowledge Action Mask */
#define SERCOM_I2CS_CTRLB_ACKACT(value)                                                                                \
        (SERCOM_I2CS_CTRLB_ACKACT_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_CTRLB_ACKACT_Pos)) /* Assigment of value for ACKACT in the SERCOM_I2CS_CTRLB register */
#define SERCOM_I2CS_CTRLB_Msk _UINT32_(0x0007C700) /* (SERCOM_I2CS_CTRLB) Register Mask  */


/* -------- SERCOM_SPIM_CTRLB : (SERCOM Offset: 0x04) (R/W 32) SPIM Control B -------- */
#define SERCOM_SPIM_CTRLB_RESETVALUE _UINT32_(0x00) /*  (SERCOM_SPIM_CTRLB) SPIM Control B  Reset Value */

