ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
#define SERCOM_SPIM_CTRLB_CHSIZE_Pos _UINT32_(0) /* (SERCOM_SPIM_CTRLB) Character Size Position */
#define SERCOM_SPIM_CTRLB_CHSIZE_Msk                                                                                   \
        (_UINT32_(0x7) << SERCOM_SPIM_CTRLB_CHSIZE_Pos) /* (SERCOM_SPIM_CTRLB) Character Size Mask */
#define SERCOM_SPIM_CTRLB_CHSIZE(value)                                                                                \
        (SERCOM_SPIM_CTRLB_CHSIZE_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIM_CTRLB_CHSIZE_Pos)) /* Assigment of value for CHSIZE in the SERCOM_SPIM_CTRLB register */
#define SERCOM_SPIM_CTRLB_CHSIZE_8_BIT_Val _UINT32_(0x0) /* (SERCOM_SPIM_CTRLB) 8 bits  */
#define SERCOM_SPIM_CTRLB_CHSIZE_9_BIT_Val _UINT32_(0x1) /* (SERCOM_SPIM_CTRLB) 9 bits  */
#define SERCOM_SPIM_CTRLB_CHSIZE_8_BIT                                                                                 \
        (SERCOM_SPIM_CTRLB_CHSIZE_8_BIT_Val << SERCOM_SPIM_CTRLB_CHSIZE_Pos) /* (SERCOM_SPIM_CTRLB) 8 bits Position */
#define SERCOM_SPIM_CTRLB_CHSIZE_9_BIT                                                                                 \
        (SERCOM_SPIM_CTRLB_CHSIZE_9_BIT_Val << SERCOM_SPIM_CTRLB_CHSIZE_Pos) /* (SERCOM_SPIM_CTRLB) 9 bits Position */
#define SERCOM_SPIM_CTRLB_PLOADEN_Pos _UINT32_(6) /* (SERCOM_SPIM_CTRLB) Data Preload Enable Position */
#define SERCOM_SPIM_CTRLB_PLOADEN_Msk                                                                                  \
        (_UINT32_(0x1) << SERCOM_SPIM_CTRLB_PLOADEN_Pos) /* (SERCOM_SPIM_CTRLB) Data Preload Enable Mask */
#define SERCOM_SPIM_CTRLB_PLOADEN(value)                                                                               \
        (SERCOM_SPIM_CTRLB_PLOADEN_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIM_CTRLB_PLOADEN_Pos)) /* Assigment of value for PLOADEN in the SERCOM_SPIM_CTRLB register */
#define SERCOM_SPIM_CTRLB_SSDE_Pos _UINT32_(9) /* (SERCOM_SPIM_CTRLB) Slave Select Low Detect Enable Position */
#define SERCOM_SPIM_CTRLB_SSDE_Msk                                                                                     \
        (_UINT32_(0x1) << SERCOM_SPIM_CTRLB_SSDE_Pos) /* (SERCOM_SPIM_CTRLB) Slave Select Low Detect Enable Mask */
#define SERCOM_SPIM_CTRLB_SSDE(value)                                                                                  \
        (SERCOM_SPIM_CTRLB_SSDE_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIM_CTRLB_SSDE_Pos)) /* Assigment of value for SSDE in the SERCOM_SPIM_CTRLB register */
#define SERCOM_SPIM_CTRLB_MSSEN_Pos _UINT32_(13) /* (SERCOM_SPIM_CTRLB) Master Slave Select Enable Position */
#define SERCOM_SPIM_CTRLB_MSSEN_Msk                                                                                    \
        (_UINT32_(0x1) << SERCOM_SPIM_CTRLB_MSSEN_Pos) /* (SERCOM_SPIM_CTRLB) Master Slave Select Enable Mask */
#define SERCOM_SPIM_CTRLB_MSSEN(value)                                                                                 \
        (SERCOM_SPIM_CTRLB_MSSEN_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIM_CTRLB_MSSEN_Pos)) /* Assigment of value for MSSEN in the SERCOM_SPIM_CTRLB register */
#define SERCOM_SPIM_CTRLB_AMODE_Pos _UINT32_(14) /* (SERCOM_SPIM_CTRLB) Address Mode Position */
#define SERCOM_SPIM_CTRLB_AMODE_Msk                                                                                    \
        (_UINT32_(0x3) << SERCOM_SPIM_CTRLB_AMODE_Pos) /* (SERCOM_SPIM_CTRLB) Address Mode Mask */
#define SERCOM_SPIM_CTRLB_AMODE(value)                                                                                 \
        (SERCOM_SPIM_CTRLB_AMODE_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIM_CTRLB_AMODE_Pos)) /* Assigment of value for AMODE in the SERCOM_SPIM_CTRLB register */
#define SERCOM_SPIM_CTRLB_AMODE_MASK_Val _UINT32_(0x0) /* (SERCOM_SPIM_CTRLB) SPI Address mask   */
#define SERCOM_SPIM_CTRLB_AMODE_2_ADDRESSES_Val _UINT32_(0x1) /* (SERCOM_SPIM_CTRLB) Two unique Addressess  */
#define SERCOM_SPIM_CTRLB_AMODE_RANGE_Val _UINT32_(0x2) /* (SERCOM_SPIM_CTRLB) Address Range  */
#define SERCOM_SPIM_CTRLB_AMODE_MASK                                                                                   \
        (SERCOM_SPIM_CTRLB_AMODE_MASK_Val                                                                              \
         << SERCOM_SPIM_CTRLB_AMODE_Pos) /* (SERCOM_SPIM_CTRLB) SPI Address mask  Position  */
#define SERCOM_SPIM_CTRLB_AMODE_2_ADDRESSES                                                                            \
        (SERCOM_SPIM_CTRLB_AMODE_2_ADDRESSES_Val                                                                       \
         << SERCOM_SPIM_CTRLB_AMODE_Pos) /* (SERCOM_SPIM_CTRLB) Two unique Addressess Position  */
#define SERCOM_SPIM_CTRLB_AMODE_RANGE                                                                                  \
        (SERCOM_SPIM_CTRLB_AMODE_RANGE_Val                                                                             \
         << SERCOM_SPIM_CTRLB_AMODE_Pos) /* (SERCOM_SPIM_CTRLB) Address Range Position  */
#define SERCOM_SPIM_CTRLB_RXEN_Pos _UINT32_(17) /* (SERCOM_SPIM_CTRLB) Receiver Enable Position */
#define SERCOM_SPIM_CTRLB_RXEN_Msk                                                                                     \
        (_UINT32_(0x1) << SERCOM_SPIM_CTRLB_RXEN_Pos) /* (SERCOM_SPIM_CTRLB) Receiver Enable Mask */
#define SERCOM_SPIM_CTRLB_RXEN(value)                                                                                  \
        (SERCOM_SPIM_CTRLB_RXEN_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIM_CTRLB_RXEN_Pos)) /* Assigment of value for RXEN in the SERCOM_SPIM_CTRLB register */
#define SERCOM_SPIM_CTRLB_Msk _UINT32_(0x0002E247) /* (SERCOM_SPIM_CTRLB) Register Mask  */


/* -------- SERCOM_SPIS_CTRLB : (SERCOM Offset: 0x04) (R/W 32) SPIS Control B -------- */
#define SERCOM_SPIS_CTRLB_RESETVALUE _UINT32_(0x00) /*  (SERCOM_SPIS_CTRLB) SPIS Control B  Reset Value */

#define SERCOM_SPIS_CTRLB_CHSIZE_Pos _UINT32_(0) /* (SERCOM_SPIS_CTRLB) Character Size Position */
#define SERCOM_SPIS_CTRLB_CHSIZE_Msk                                                                                   \
        (_UINT32_(0x7) << SERCOM_SPIS_CTRLB_CHSIZE_Pos) /* (SERCOM_SPIS_CTRLB) Character Size Mask */
#define SERCOM_SPIS_CTRLB_CHSIZE(value)                                                                                \
        (SERCOM_SPIS_CTRLB_CHSIZE_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLB_CHSIZE_Pos)) /* Assigment of value for CHSIZE in the SERCOM_SPIS_CTRLB register */
#define SERCOM_SPIS_CTRLB_CHSIZE_8_BIT_Val _UINT32_(0x0) /* (SERCOM_SPIS_CTRLB) 8 bits  */
#define SERCOM_SPIS_CTRLB_CHSIZE_9_BIT_Val _UINT32_(0x1) /* (SERCOM_SPIS_CTRLB) 9 bits  */
#define SERCOM_SPIS_CTRLB_CHSIZE_8_BIT                                                                                 \
        (SERCOM_SPIS_CTRLB_CHSIZE_8_BIT_Val << SERCOM_SPIS_CTRLB_CHSIZE_Pos) /* (SERCOM_SPIS_CTRLB) 8 bits Position */
#define SERCOM_SPIS_CTRLB_CHSIZE_9_BIT                                                                                 \
        (SERCOM_SPIS_CTRLB_CHSIZE_9_BIT_Val << SERCOM_SPIS_CTRLB_CHSIZE_Pos) /* (SERCOM_SPIS_CTRLB) 9 bits Position */
#define SERCOM_SPIS_CTRLB_PLOADEN_Pos _UINT32_(6) /* (SERCOM_SPIS_CTRLB) Data Preload Enable Position */
#define SERCOM_SPIS_CTRLB_PLOADEN_Msk                                                                                  \
        (_UINT32_(0x1) << SERCOM_SPIS_CTRLB_PLOADEN_Pos) /* (SERCOM_SPIS_CTRLB) Data Preload Enable Mask */
#define SERCOM_SPIS_CTRLB_PLOADEN(value)                                                                               \
        (SERCOM_SPIS_CTRLB_PLOADEN_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLB_PLOADEN_Pos)) /* Assigment of value for PLOADEN in the SERCOM_SPIS_CTRLB register */
#define SERCOM_SPIS_CTRLB_SSDE_Pos _UINT32_(9) /* (SERCOM_SPIS_CTRLB) Slave Select Low Detect Enable Position */
#define SERCOM_SPIS_CTRLB_SSDE_Msk                                                                                     \
        (_UINT32_(0x1) << SERCOM_SPIS_CTRLB_SSDE_Pos) /* (SERCOM_SPIS_CTRLB) Slave Select Low Detect Enable Mask */
#define SERCOM_SPIS_CTRLB_SSDE(value)                                                                                  \
        (SERCOM_SPIS_CTRLB_SSDE_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLB_SSDE_Pos)) /* Assigment of value for SSDE in the SERCOM_SPIS_CTRLB register */
#define SERCOM_SPIS_CTRLB_MSSEN_Pos _UINT32_(13) /* (SERCOM_SPIS_CTRLB) Master Slave Select Enable Position */
#define SERCOM_SPIS_CTRLB_MSSEN_Msk                                                                                    \
        (_UINT32_(0x1) << SERCOM_SPIS_CTRLB_MSSEN_Pos) /* (SERCOM_SPIS_CTRLB) Master Slave Select Enable Mask */
#define SERCOM_SPIS_CTRLB_MSSEN(value)                                                                                 \
        (SERCOM_SPIS_CTRLB_MSSEN_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLB_MSSEN_Pos)) /* Assigment of value for MSSEN in the SERCOM_SPIS_CTRLB register */
#define SERCOM_SPIS_CTRLB_AMODE_Pos _UINT32_(14) /* (SERCOM_SPIS_CTRLB) Address Mode Position */
#define SERCOM_SPIS_CTRLB_AMODE_Msk                                                                                    \
        (_UINT32_(0x3) << SERCOM_SPIS_CTRLB_AMODE_Pos) /* (SERCOM_SPIS_CTRLB) Address Mode Mask */
#define SERCOM_SPIS_CTRLB_AMODE(value)                                                                                 \
        (SERCOM_SPIS_CTRLB_AMODE_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLB_AMODE_Pos)) /* Assigment of value for AMODE in the SERCOM_SPIS_CTRLB register */
#define SERCOM_SPIS_CTRLB_AMODE_MASK_Val _UINT32_(0x0) /* (SERCOM_SPIS_CTRLB) SPI Address mask   */
#define SERCOM_SPIS_CTRLB_AMODE_2_ADDRESSES_Val _UINT32_(0x1) /* (SERCOM_SPIS_CTRLB) Two unique Addressess  */
#define SERCOM_SPIS_CTRLB_AMODE_RANGE_Val _UINT32_(0x2) /* (SERCOM_SPIS_CTRLB) Address Range  */
#define SERCOM_SPIS_CTRLB_AMODE_MASK                                                                                   \
        (SERCOM_SPIS_CTRLB_AMODE_MASK_Val                                                                              \
         << SERCOM_SPIS_CTRLB_AMODE_Pos) /* (SERCOM_SPIS_CTRLB) SPI Address mask  Position  */
#define SERCOM_SPIS_CTRLB_AMODE_2_ADDRESSES                                                                            \
        (SERCOM_SPIS_CTRLB_AMODE_2_ADDRESSES_Val                                                                       \
         << SERCOM_SPIS_CTRLB_AMODE_Pos) /* (SERCOM_SPIS_CTRLB) Two unique Addressess Position  */
#define SERCOM_SPIS_CTRLB_AMODE_RANGE                                                                                  \
        (SERCOM_SPIS_CTRLB_AMODE_RANGE_Val                                                                             \
         << SERCOM_SPIS_CTRLB_AMODE_Pos) /* (SERCOM_SPIS_CTRLB) Address Range Position  */
#define SERCOM_SPIS_CTRLB_RXEN_Pos _UINT32_(17) /* (SERCOM_SPIS_CTRLB) Receiver Enable Position */
#define SERCOM_SPIS_CTRLB_RXEN_Msk                                                                                     \
        (_UINT32_(0x1) << SERCOM_SPIS_CTRLB_RXEN_Pos) /* (SERCOM_SPIS_CTRLB) Receiver Enable Mask */
#define SERCOM_SPIS_CTRLB_RXEN(value)                                                                                  \
        (SERCOM_SPIS_CTRLB_RXEN_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_CTRLB_RXEN_Pos)) /* Assigment of value for RXEN in the SERCOM_SPIS_CTRLB register */
#define SERCOM_SPIS_CTRLB_Msk _UINT32_(0x0002E247) /* (SERCOM_SPIS_CTRLB) Register Mask  */


