ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
/* -------- SERCOM_USART_EXT_CTRLB : (SERCOM Offset: 0x04) (R/W 32) USART_EXT Control B -------- */
#define SERCOM_USART_EXT_CTRLB_RESETVALUE                                                                              \
        _UINT32_(0x00) /*  (SERCOM_USART_EXT_CTRLB) USART_EXT Control B  Reset Value */

#define SERCOM_USART_EXT_CTRLB_CHSIZE_Pos _UINT32_(0) /* (SERCOM_USART_EXT_CTRLB) Character Size Position */
#define SERCOM_USART_EXT_CTRLB_CHSIZE_Msk                                                                              \
        (_UINT32_(0x7) << SERCOM_USART_EXT_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_EXT_CTRLB) Character Size Mask */
#define SERCOM_USART_EXT_CTRLB_CHSIZE(value)                                                                           \
        (SERCOM_USART_EXT_CTRLB_CHSIZE_Msk &                                                                           \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLB_CHSIZE_Pos)) /* Assigment of value for CHSIZE in the               \
                                                                    SERCOM_USART_EXT_CTRLB register */
#define SERCOM_USART_EXT_CTRLB_CHSIZE_8_BIT_Val _UINT32_(0x0) /* (SERCOM_USART_EXT_CTRLB) 8 Bits  */
#define SERCOM_USART_EXT_CTRLB_CHSIZE_9_BIT_Val _UINT32_(0x1) /* (SERCOM_USART_EXT_CTRLB) 9 Bits  */
#define SERCOM_USART_EXT_CTRLB_CHSIZE_5_BIT_Val _UINT32_(0x5) /* (SERCOM_USART_EXT_CTRLB) 5 Bits  */
#define SERCOM_USART_EXT_CTRLB_CHSIZE_6_BIT_Val _UINT32_(0x6) /* (SERCOM_USART_EXT_CTRLB) 6 Bits  */
#define SERCOM_USART_EXT_CTRLB_CHSIZE_7_BIT_Val _UINT32_(0x7) /* (SERCOM_USART_EXT_CTRLB) 7 Bits  */
#define SERCOM_USART_EXT_CTRLB_CHSIZE_8_BIT                                                                            \
        (SERCOM_USART_EXT_CTRLB_CHSIZE_8_BIT_Val                                                                       \
         << SERCOM_USART_EXT_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_EXT_CTRLB) 8 Bits Position  */
#define SERCOM_USART_EXT_CTRLB_CHSIZE_9_BIT                                                                            \
        (SERCOM_USART_EXT_CTRLB_CHSIZE_9_BIT_Val                                                                       \
         << SERCOM_USART_EXT_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_EXT_CTRLB) 9 Bits Position  */
#define SERCOM_USART_EXT_CTRLB_CHSIZE_5_BIT                                                                            \
        (SERCOM_USART_EXT_CTRLB_CHSIZE_5_BIT_Val                                                                       \
         << SERCOM_USART_EXT_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_EXT_CTRLB) 5 Bits Position  */
#define SERCOM_USART_EXT_CTRLB_CHSIZE_6_BIT                                                                            \
        (SERCOM_USART_EXT_CTRLB_CHSIZE_6_BIT_Val                                                                       \
         << SERCOM_USART_EXT_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_EXT_CTRLB) 6 Bits Position  */
#define SERCOM_USART_EXT_CTRLB_CHSIZE_7_BIT                                                                            \
        (SERCOM_USART_EXT_CTRLB_CHSIZE_7_BIT_Val                                                                       \
         << SERCOM_USART_EXT_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_EXT_CTRLB) 7 Bits Position  */
#define SERCOM_USART_EXT_CTRLB_SBMODE_Pos _UINT32_(6) /* (SERCOM_USART_EXT_CTRLB) Stop Bit Mode Position */
#define SERCOM_USART_EXT_CTRLB_SBMODE_Msk                                                                              \
        (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLB_SBMODE_Pos) /* (SERCOM_USART_EXT_CTRLB) Stop Bit Mode Mask */
#define SERCOM_USART_EXT_CTRLB_SBMODE(value)                                                                           \
        (SERCOM_USART_EXT_CTRLB_SBMODE_Msk &                                                                           \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLB_SBMODE_Pos)) /* Assigment of value for SBMODE in the               \
                                                                    SERCOM_USART_EXT_CTRLB register */
#define SERCOM_USART_EXT_CTRLB_SBMODE_1_BIT_Val _UINT32_(0x0) /* (SERCOM_USART_EXT_CTRLB) One Stop Bit  */
#define SERCOM_USART_EXT_CTRLB_SBMODE_2_BIT_Val _UINT32_(0x1) /* (SERCOM_USART_EXT_CTRLB) Two Stop Bits  */
#define SERCOM_USART_EXT_CTRLB_SBMODE_1_BIT                                                                            \
        (SERCOM_USART_EXT_CTRLB_SBMODE_1_BIT_Val                                                                       \
         << SERCOM_USART_EXT_CTRLB_SBMODE_Pos) /* (SERCOM_USART_EXT_CTRLB) One Stop Bit Position  */
#define SERCOM_USART_EXT_CTRLB_SBMODE_2_BIT                                                                            \
        (SERCOM_USART_EXT_CTRLB_SBMODE_2_BIT_Val                                                                       \
         << SERCOM_USART_EXT_CTRLB_SBMODE_Pos) /* (SERCOM_USART_EXT_CTRLB) Two Stop Bits Position  */
#define SERCOM_USART_EXT_CTRLB_COLDEN_Pos _UINT32_(8) /* (SERCOM_USART_EXT_CTRLB) Collision Detection Enable Position  \
                                                       */
#define SERCOM_USART_EXT_CTRLB_COLDEN_Msk                                                                              \
        (_UINT32_(0x1)                                                                                                 \
         << SERCOM_USART_EXT_CTRLB_COLDEN_Pos) /* (SERCOM_USART_EXT_CTRLB) Collision Detection Enable Mask */
#define SERCOM_USART_EXT_CTRLB_COLDEN(value)                                                                           \
        (SERCOM_USART_EXT_CTRLB_COLDEN_Msk &                                                                           \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLB_COLDEN_Pos)) /* Assigment of value for COLDEN in the               \
                                                                    SERCOM_USART_EXT_CTRLB register */
#define SERCOM_USART_EXT_CTRLB_SFDE_Pos                                                                                \
        _UINT32_(9) /* (SERCOM_USART_EXT_CTRLB) Start of Frame Detection Enable Position */
#define SERCOM_USART_EXT_CTRLB_SFDE_Msk                                                                                \
        (_UINT32_(0x1)                                                                                                 \
         << SERCOM_USART_EXT_CTRLB_SFDE_Pos) /* (SERCOM_USART_EXT_CTRLB) Start of Frame Detection Enable Mask */
#define SERCOM_USART_EXT_CTRLB_SFDE(value)                                                                             \
        (SERCOM_USART_EXT_CTRLB_SFDE_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLB_SFDE_Pos)) /* Assigment of value for SFDE in the                   \
                                                                  SERCOM_USART_EXT_CTRLB register */
#define SERCOM_USART_EXT_CTRLB_ENC_Pos _UINT32_(10) /* (SERCOM_USART_EXT_CTRLB) Encoding Format Position */
#define SERCOM_USART_EXT_CTRLB_ENC_Msk                                                                                 \
        (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLB_ENC_Pos) /* (SERCOM_USART_EXT_CTRLB) Encoding Format Mask */
#define SERCOM_USART_EXT_CTRLB_ENC(value)                                                                              \
        (SERCOM_USART_EXT_CTRLB_ENC_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SERCOM_USART_EXT_CTRLB_ENC_Pos)) /* Assigment of value for ENC in the SERCOM_USART_EXT_CTRLB register */
#define SERCOM_USART_EXT_CTRLB_PMODE_Pos _UINT32_(13) /* (SERCOM_USART_EXT_CTRLB) Parity Mode Position */
#define SERCOM_USART_EXT_CTRLB_PMODE_Msk                                                                               \
        (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLB_PMODE_Pos) /* (SERCOM_USART_EXT_CTRLB) Parity Mode Mask */
#define SERCOM_USART_EXT_CTRLB_PMODE(value)                                                                            \
        (SERCOM_USART_EXT_CTRLB_PMODE_Msk &                                                                            \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLB_PMODE_Pos)) /* Assigment of value for PMODE in the                 \
                                                                   SERCOM_USART_EXT_CTRLB register */
#define SERCOM_USART_EXT_CTRLB_PMODE_EVEN_Val _UINT32_(0x0) /* (SERCOM_USART_EXT_CTRLB) Even Parity  */
#define SERCOM_USART_EXT_CTRLB_PMODE_ODD_Val _UINT32_(0x1) /* (SERCOM_USART_EXT_CTRLB) Odd Parity  */
#define SERCOM_USART_EXT_CTRLB_PMODE_EVEN                                                                              \
        (SERCOM_USART_EXT_CTRLB_PMODE_EVEN_Val                                                                         \
         << SERCOM_USART_EXT_CTRLB_PMODE_Pos) /* (SERCOM_USART_EXT_CTRLB) Even Parity Position  */
#define SERCOM_USART_EXT_CTRLB_PMODE_ODD                                                                               \
        (SERCOM_USART_EXT_CTRLB_PMODE_ODD_Val                                                                          \
         << SERCOM_USART_EXT_CTRLB_PMODE_Pos) /* (SERCOM_USART_EXT_CTRLB) Odd Parity Position  */
#define SERCOM_USART_EXT_CTRLB_TXEN_Pos _UINT32_(16) /* (SERCOM_USART_EXT_CTRLB) Transmitter Enable Position */
#define SERCOM_USART_EXT_CTRLB_TXEN_Msk                                                                                \
        (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLB_TXEN_Pos) /* (SERCOM_USART_EXT_CTRLB) Transmitter Enable Mask */
#define SERCOM_USART_EXT_CTRLB_TXEN(value)                                                                             \
        (SERCOM_USART_EXT_CTRLB_TXEN_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLB_TXEN_Pos)) /* Assigment of value for TXEN in the                   \
                                                                  SERCOM_USART_EXT_CTRLB register */
#define SERCOM_USART_EXT_CTRLB_RXEN_Pos _UINT32_(17) /* (SERCOM_USART_EXT_CTRLB) Receiver Enable Position */
#define SERCOM_USART_EXT_CTRLB_RXEN_Msk                                                                                \
        (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLB_RXEN_Pos) /* (SERCOM_USART_EXT_CTRLB) Receiver Enable Mask */
#define SERCOM_USART_EXT_CTRLB_RXEN(value)                                                                             \
        (SERCOM_USART_EXT_CTRLB_RXEN_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_EXT_CTRLB_RXEN_Pos)) /* Assigment of value for RXEN in the                   \
                                                                  SERCOM_USART_EXT_CTRLB register */
#define SERCOM_USART_EXT_CTRLB_Msk _UINT32_(0x00032747) /* (SERCOM_USART_EXT_CTRLB) Register Mask  */


/* -------- SERCOM_USART_INT_CTRLB : (SERCOM Offset: 0x04) (R/W 32) USART_INT Control B -------- */
#define SERCOM_USART_INT_CTRLB_RESETVALUE                                                                              \
        _UINT32_(0x00) /*  (SERCOM_USART_INT_CTRLB) USART_INT Control B  Reset Value */

#define SERCOM_USART_INT_CTRLB_CHSIZE_Pos _UINT32_(0) /* (SERCOM_USART_INT_CTRLB) Character Size Position */
#define SERCOM_USART_INT_CTRLB_CHSIZE_Msk                                                                              \
        (_UINT32_(0x7) << SERCOM_USART_INT_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_INT_CTRLB) Character Size Mask */
#define SERCOM_USART_INT_CTRLB_CHSIZE(value)                                                                           \
        (SERCOM_USART_INT_CTRLB_CHSIZE_Msk &                                                                           \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLB_CHSIZE_Pos)) /* Assigment of value for CHSIZE in the               \
                                                                    SERCOM_USART_INT_CTRLB register */
#define SERCOM_USART_INT_CTRLB_CHSIZE_8_BIT_Val _UINT32_(0x0) /* (SERCOM_USART_INT_CTRLB) 8 Bits  */
#define SERCOM_USART_INT_CTRLB_CHSIZE_9_BIT_Val _UINT32_(0x1) /* (SERCOM_USART_INT_CTRLB) 9 Bits  */
#define SERCOM_USART_INT_CTRLB_CHSIZE_5_BIT_Val _UINT32_(0x5) /* (SERCOM_USART_INT_CTRLB) 5 Bits  */
#define SERCOM_USART_INT_CTRLB_CHSIZE_6_BIT_Val _UINT32_(0x6) /* (SERCOM_USART_INT_CTRLB) 6 Bits  */
#define SERCOM_USART_INT_CTRLB_CHSIZE_7_BIT_Val _UINT32_(0x7) /* (SERCOM_USART_INT_CTRLB) 7 Bits  */
#define SERCOM_USART_INT_CTRLB_CHSIZE_8_BIT                                                                            \
        (SERCOM_USART_INT_CTRLB_CHSIZE_8_BIT_Val                                                                       \
         << SERCOM_USART_INT_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_INT_CTRLB) 8 Bits Position  */
#define SERCOM_USART_INT_CTRLB_CHSIZE_9_BIT                                                                            \
        (SERCOM_USART_INT_CTRLB_CHSIZE_9_BIT_Val                                                                       \
         << SERCOM_USART_INT_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_INT_CTRLB) 9 Bits Position  */
#define SERCOM_USART_INT_CTRLB_CHSIZE_5_BIT                                                                            \
        (SERCOM_USART_INT_CTRLB_CHSIZE_5_BIT_Val                                                                       \
         << SERCOM_USART_INT_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_INT_CTRLB) 5 Bits Position  */
#define SERCOM_USART_INT_CTRLB_CHSIZE_6_BIT                                                                            \
        (SERCOM_USART_INT_CTRLB_CHSIZE_6_BIT_Val                                                                       \
         << SERCOM_USART_INT_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_INT_CTRLB) 6 Bits Position  */
#define SERCOM_USART_INT_CTRLB_CHSIZE_7_BIT                                                                            \
        (SERCOM_USART_INT_CTRLB_CHSIZE_7_BIT_Val                                                                       \
         << SERCOM_USART_INT_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_INT_CTRLB) 7 Bits Position  */
#define SERCOM_USART_INT_CTRLB_SBMODE_Pos _UINT32_(6) /* (SERCOM_USART_INT_CTRLB) Stop Bit Mode Position */
#define SERCOM_USART_INT_CTRLB_SBMODE_Msk                                                                              \
        (_UINT32_(0x1) << SERCOM_USART_INT_CTRLB_SBMODE_Pos) /* (SERCOM_USART_INT_CTRLB) Stop Bit Mode Mask */
#define SERCOM_USART_INT_CTRLB_SBMODE(value)                                                                           \
        (SERCOM_USART_INT_CTRLB_SBMODE_Msk &                                                                           \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLB_SBMODE_Pos)) /* Assigment of value for SBMODE in the               \
                                                                    SERCOM_USART_INT_CTRLB register */
#define SERCOM_USART_INT_CTRLB_SBMODE_1_BIT_Val _UINT32_(0x0) /* (SERCOM_USART_INT_CTRLB) One Stop Bit  */
#define SERCOM_USART_INT_CTRLB_SBMODE_2_BIT_Val _UINT32_(0x1) /* (SERCOM_USART_INT_CTRLB) Two Stop Bits  */
#define SERCOM_USART_INT_CTRLB_SBMODE_1_BIT                                                                            \
        (SERCOM_USART_INT_CTRLB_SBMODE_1_BIT_Val                                                                       \
         << SERCOM_USART_INT_CTRLB_SBMODE_Pos) /* (SERCOM_USART_INT_CTRLB) One Stop Bit Position  */
#define SERCOM_USART_INT_CTRLB_SBMODE_2_BIT                                                                            \
        (SERCOM_USART_INT_CTRLB_SBMODE_2_BIT_Val                                                                       \
         << SERCOM_USART_INT_CTRLB_SBMODE_Pos) /* (SERCOM_USART_INT_CTRLB) Two Stop Bits Position  */
#define SERCOM_USART_INT_CTRLB_COLDEN_Pos _UINT32_(8) /* (SERCOM_USART_INT_CTRLB) Collision Detection Enable Position  \
                                                       */
#define SERCOM_USART_INT_CTRLB_COLDEN_Msk                                                                              \
        (_UINT32_(0x1)                                                                                                 \
         << SERCOM_USART_INT_CTRLB_COLDEN_Pos) /* (SERCOM_USART_INT_CTRLB) Collision Detection Enable Mask */
#define SERCOM_USART_INT_CTRLB_COLDEN(value)                                                                           \
        (SERCOM_USART_INT_CTRLB_COLDEN_Msk &                                                                           \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLB_COLDEN_Pos)) /* Assigment of value for COLDEN in the               \
                                                                    SERCOM_USART_INT_CTRLB register */
#define SERCOM_USART_INT_CTRLB_SFDE_Pos                                                                                \
        _UINT32_(9) /* (SERCOM_USART_INT_CTRLB) Start of Frame Detection Enable Position */
#define SERCOM_USART_INT_CTRLB_SFDE_Msk                                                                                \
        (_UINT32_(0x1)                                                                                                 \
         << SERCOM_USART_INT_CTRLB_SFDE_Pos) /* (SERCOM_USART_INT_CTRLB) Start of Frame Detection Enable Mask */
#define SERCOM_USART_INT_CTRLB_SFDE(value)                                                                             \
        (SERCOM_USART_INT_CTRLB_SFDE_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLB_SFDE_Pos)) /* Assigment of value for SFDE in the                   \
                                                                  SERCOM_USART_INT_CTRLB register */
#define SERCOM_USART_INT_CTRLB_ENC_Pos _UINT32_(10) /* (SERCOM_USART_INT_CTRLB) Encoding Format Position */
#define SERCOM_USART_INT_CTRLB_ENC_Msk                                                                                 \
        (_UINT32_(0x1) << SERCOM_USART_INT_CTRLB_ENC_Pos) /* (SERCOM_USART_INT_CTRLB) Encoding Format Mask */
#define SERCOM_USART_INT_CTRLB_ENC(value)                                                                              \
        (SERCOM_USART_INT_CTRLB_ENC_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SERCOM_USART_INT_CTRLB_ENC_Pos)) /* Assigment of value for ENC in the SERCOM_USART_INT_CTRLB register */
#define SERCOM_USART_INT_CTRLB_PMODE_Pos _UINT32_(13) /* (SERCOM_USART_INT_CTRLB) Parity Mode Position */
#define SERCOM_USART_INT_CTRLB_PMODE_Msk                                                                               \
        (_UINT32_(0x1) << SERCOM_USART_INT_CTRLB_PMODE_Pos) /* (SERCOM_USART_INT_CTRLB) Parity Mode Mask */
#define SERCOM_USART_INT_CTRLB_PMODE(value)                                                                            \
        (SERCOM_USART_INT_CTRLB_PMODE_Msk &                                                                            \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLB_PMODE_Pos)) /* Assigment of value for PMODE in the                 \
                                                                   SERCOM_USART_INT_CTRLB register */
#define SERCOM_USART_INT_CTRLB_PMODE_EVEN_Val _UINT32_(0x0) /* (SERCOM_USART_INT_CTRLB) Even Parity  */
#define SERCOM_USART_INT_CTRLB_PMODE_ODD_Val _UINT32_(0x1) /* (SERCOM_USART_INT_CTRLB) Odd Parity  */
#define SERCOM_USART_INT_CTRLB_PMODE_EVEN                                                                              \
        (SERCOM_USART_INT_CTRLB_PMODE_EVEN_Val                                                                         \
         << SERCOM_USART_INT_CTRLB_PMODE_Pos) /* (SERCOM_USART_INT_CTRLB) Even Parity Position  */
#define SERCOM_USART_INT_CTRLB_PMODE_ODD                                                                               \
        (SERCOM_USART_INT_CTRLB_PMODE_ODD_Val                                                                          \
         << SERCOM_USART_INT_CTRLB_PMODE_Pos) /* (SERCOM_USART_INT_CTRLB) Odd Parity Position  */
#define SERCOM_USART_INT_CTRLB_TXEN_Pos _UINT32_(16) /* (SERCOM_USART_INT_CTRLB) Transmitter Enable Position */
#define SERCOM_USART_INT_CTRLB_TXEN_Msk                                                                                \
        (_UINT32_(0x1) << SERCOM_USART_INT_CTRLB_TXEN_Pos) /* (SERCOM_USART_INT_CTRLB) Transmitter Enable Mask */
#define SERCOM_USART_INT_CTRLB_TXEN(value)                                                                             \
        (SERCOM_USART_INT_CTRLB_TXEN_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLB_TXEN_Pos)) /* Assigment of value for TXEN in the                   \
                                                                  SERCOM_USART_INT_CTRLB register */
#define SERCOM_USART_INT_CTRLB_RXEN_Pos _UINT32_(17) /* (SERCOM_USART_INT_CTRLB) Receiver Enable Position */
#define SERCOM_USART_INT_CTRLB_RXEN_Msk                                                                                \
        (_UINT32_(0x1) << SERCOM_USART_INT_CTRLB_RXEN_Pos) /* (SERCOM_USART_INT_CTRLB) Receiver Enable Mask */
#define SERCOM_USART_INT_CTRLB_RXEN(value)                                                                             \
        (SERCOM_USART_INT_CTRLB_RXEN_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_USART_INT_CTRLB_RXEN_Pos)) /* Assigment of value for RXEN in the                   \
                                                                  SERCOM_USART_INT_CTRLB register */
#define SERCOM_USART_INT_CTRLB_Msk _UINT32_(0x00032747) /* (SERCOM_USART_INT_CTRLB) Register Mask  */


/* -------- SERCOM_I2CM_BAUD : (SERCOM Offset: 0x0C) (R/W 32) I2CM Baud Rate -------- */
#define SERCOM_I2CM_BAUD_RESETVALUE _UINT32_(0x00) /*  (SERCOM_I2CM_BAUD) I2CM Baud Rate  Reset Value */

