ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
/* -------- SERCOM_I2CM_INTENCLR : (SERCOM Offset: 0x14) (R/W 8) I2CM Interrupt Enable Clear -------- */
#define SERCOM_I2CM_INTENCLR_RESETVALUE                                                                                \
        _UINT8_(0x00) /*  (SERCOM_I2CM_INTENCLR) I2CM Interrupt Enable Clear  Reset Value */

#define SERCOM_I2CM_INTENCLR_MB_Pos _UINT8_(0) /* (SERCOM_I2CM_INTENCLR) Master On Bus Interrupt Disable Position */
#define SERCOM_I2CM_INTENCLR_MB_Msk                                                                                    \
        (_UINT8_(0x1) << SERCOM_I2CM_INTENCLR_MB_Pos) /* (SERCOM_I2CM_INTENCLR) Master On Bus Interrupt Disable Mask   \
                                                       */
#define SERCOM_I2CM_INTENCLR_MB(value)                                                                                 \
        (SERCOM_I2CM_INTENCLR_MB_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CM_INTENCLR_MB_Pos)) /* Assigment of value for MB in the SERCOM_I2CM_INTENCLR register */
#define SERCOM_I2CM_INTENCLR_SB_Pos _UINT8_(1) /* (SERCOM_I2CM_INTENCLR) Slave On Bus Interrupt Disable Position */
#define SERCOM_I2CM_INTENCLR_SB_Msk                                                                                    \
        (_UINT8_(0x1) << SERCOM_I2CM_INTENCLR_SB_Pos) /* (SERCOM_I2CM_INTENCLR) Slave On Bus Interrupt Disable Mask */
#define SERCOM_I2CM_INTENCLR_SB(value)                                                                                 \
        (SERCOM_I2CM_INTENCLR_SB_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CM_INTENCLR_SB_Pos)) /* Assigment of value for SB in the SERCOM_I2CM_INTENCLR register */
#define SERCOM_I2CM_INTENCLR_ERROR_Pos _UINT8_(7) /* (SERCOM_I2CM_INTENCLR) Combined Error Interrupt Disable Position  \
                                                   */
#define SERCOM_I2CM_INTENCLR_ERROR_Msk                                                                                 \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_I2CM_INTENCLR_ERROR_Pos) /* (SERCOM_I2CM_INTENCLR) Combined Error Interrupt Disable Mask */
#define SERCOM_I2CM_INTENCLR_ERROR(value)                                                                              \
        (SERCOM_I2CM_INTENCLR_ERROR_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CM_INTENCLR_ERROR_Pos)) /* Assigment of value for ERROR in the SERCOM_I2CM_INTENCLR register */
#define SERCOM_I2CM_INTENCLR_Msk _UINT8_(0x83) /* (SERCOM_I2CM_INTENCLR) Register Mask  */


/* -------- SERCOM_I2CS_INTENCLR : (SERCOM Offset: 0x14) (R/W 8) I2CS Interrupt Enable Clear -------- */
#define SERCOM_I2CS_INTENCLR_RESETVALUE                                                                                \
        _UINT8_(0x00) /*  (SERCOM_I2CS_INTENCLR) I2CS Interrupt Enable Clear  Reset Value */

#define SERCOM_I2CS_INTENCLR_PREC_Pos _UINT8_(0) /* (SERCOM_I2CS_INTENCLR) Stop Received Interrupt Disable Position */
#define SERCOM_I2CS_INTENCLR_PREC_Msk                                                                                  \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_I2CS_INTENCLR_PREC_Pos) /* (SERCOM_I2CS_INTENCLR) Stop Received Interrupt Disable Mask */
#define SERCOM_I2CS_INTENCLR_PREC(value)                                                                               \
        (SERCOM_I2CS_INTENCLR_PREC_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CS_INTENCLR_PREC_Pos)) /* Assigment of value for PREC in the SERCOM_I2CS_INTENCLR register */
#define SERCOM_I2CS_INTENCLR_AMATCH_Pos _UINT8_(1) /* (SERCOM_I2CS_INTENCLR) Address Match Interrupt Disable Position  \
                                                    */
#define SERCOM_I2CS_INTENCLR_AMATCH_Msk                                                                                \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_I2CS_INTENCLR_AMATCH_Pos) /* (SERCOM_I2CS_INTENCLR) Address Match Interrupt Disable Mask */
#define SERCOM_I2CS_INTENCLR_AMATCH(value)                                                                             \
        (SERCOM_I2CS_INTENCLR_AMATCH_Msk &                                                                             \
         (_UINT8_(value) << SERCOM_I2CS_INTENCLR_AMATCH_Pos)) /* Assigment of value for AMATCH in the                  \
                                                                 SERCOM_I2CS_INTENCLR register */
#define SERCOM_I2CS_INTENCLR_DRDY_Pos _UINT8_(2) /* (SERCOM_I2CS_INTENCLR) Data Interrupt Disable Position */
#define SERCOM_I2CS_INTENCLR_DRDY_Msk                                                                                  \
        (_UINT8_(0x1) << SERCOM_I2CS_INTENCLR_DRDY_Pos) /* (SERCOM_I2CS_INTENCLR) Data Interrupt Disable Mask */
#define SERCOM_I2CS_INTENCLR_DRDY(value)                                                                               \
        (SERCOM_I2CS_INTENCLR_DRDY_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CS_INTENCLR_DRDY_Pos)) /* Assigment of value for DRDY in the SERCOM_I2CS_INTENCLR register */
#define SERCOM_I2CS_INTENCLR_ERROR_Pos _UINT8_(7) /* (SERCOM_I2CS_INTENCLR) Combined Error Interrupt Disable Position  \
                                                   */
#define SERCOM_I2CS_INTENCLR_ERROR_Msk                                                                                 \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_I2CS_INTENCLR_ERROR_Pos) /* (SERCOM_I2CS_INTENCLR) Combined Error Interrupt Disable Mask */
#define SERCOM_I2CS_INTENCLR_ERROR(value)                                                                              \
        (SERCOM_I2CS_INTENCLR_ERROR_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CS_INTENCLR_ERROR_Pos)) /* Assigment of value for ERROR in the SERCOM_I2CS_INTENCLR register */
#define SERCOM_I2CS_INTENCLR_Msk _UINT8_(0x87) /* (SERCOM_I2CS_INTENCLR) Register Mask  */


/* -------- SERCOM_SPIM_INTENCLR : (SERCOM Offset: 0x14) (R/W 8) SPIM Interrupt Enable Clear -------- */
#define SERCOM_SPIM_INTENCLR_RESETVALUE                                                                                \
        _UINT8_(0x00) /*  (SERCOM_SPIM_INTENCLR) SPIM Interrupt Enable Clear  Reset Value */

#define SERCOM_SPIM_INTENCLR_DRE_Pos                                                                                   \
        _UINT8_(0) /* (SERCOM_SPIM_INTENCLR) Data Register Empty Interrupt Disable Position */
#define SERCOM_SPIM_INTENCLR_DRE_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIM_INTENCLR_DRE_Pos) /* (SERCOM_SPIM_INTENCLR) Data Register Empty Interrupt Disable Mask */
#define SERCOM_SPIM_INTENCLR_DRE(value)                                                                                \
        (SERCOM_SPIM_INTENCLR_DRE_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTENCLR_DRE_Pos)) /* Assigment of value for DRE in the SERCOM_SPIM_INTENCLR register */
#define SERCOM_SPIM_INTENCLR_TXC_Pos                                                                                   \
        _UINT8_(1) /* (SERCOM_SPIM_INTENCLR) Transmit Complete Interrupt Disable Position */
#define SERCOM_SPIM_INTENCLR_TXC_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIM_INTENCLR_TXC_Pos) /* (SERCOM_SPIM_INTENCLR) Transmit Complete Interrupt Disable Mask */
#define SERCOM_SPIM_INTENCLR_TXC(value)                                                                                \
        (SERCOM_SPIM_INTENCLR_TXC_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTENCLR_TXC_Pos)) /* Assigment of value for TXC in the SERCOM_SPIM_INTENCLR register */
#define SERCOM_SPIM_INTENCLR_RXC_Pos _UINT8_(2) /* (SERCOM_SPIM_INTENCLR) Receive Complete Interrupt Disable Position  \
                                                 */
#define SERCOM_SPIM_INTENCLR_RXC_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIM_INTENCLR_RXC_Pos) /* (SERCOM_SPIM_INTENCLR) Receive Complete Interrupt Disable Mask */
#define SERCOM_SPIM_INTENCLR_RXC(value)                                                                                \
        (SERCOM_SPIM_INTENCLR_RXC_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTENCLR_RXC_Pos)) /* Assigment of value for RXC in the SERCOM_SPIM_INTENCLR register */
#define SERCOM_SPIM_INTENCLR_SSL_Pos _UINT8_(3) /* (SERCOM_SPIM_INTENCLR) Slave Select Low Interrupt Disable Position  \
                                                 */
#define SERCOM_SPIM_INTENCLR_SSL_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIM_INTENCLR_SSL_Pos) /* (SERCOM_SPIM_INTENCLR) Slave Select Low Interrupt Disable Mask */
#define SERCOM_SPIM_INTENCLR_SSL(value)                                                                                \
        (SERCOM_SPIM_INTENCLR_SSL_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTENCLR_SSL_Pos)) /* Assigment of value for SSL in the SERCOM_SPIM_INTENCLR register */
#define SERCOM_SPIM_INTENCLR_ERROR_Pos _UINT8_(7) /* (SERCOM_SPIM_INTENCLR) Combined Error Interrupt Disable Position  \
                                                   */
#define SERCOM_SPIM_INTENCLR_ERROR_Msk                                                                                 \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIM_INTENCLR_ERROR_Pos) /* (SERCOM_SPIM_INTENCLR) Combined Error Interrupt Disable Mask */
#define SERCOM_SPIM_INTENCLR_ERROR(value)                                                                              \
        (SERCOM_SPIM_INTENCLR_ERROR_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTENCLR_ERROR_Pos)) /* Assigment of value for ERROR in the SERCOM_SPIM_INTENCLR register */
#define SERCOM_SPIM_INTENCLR_Msk _UINT8_(0x8F) /* (SERCOM_SPIM_INTENCLR) Register Mask  */


/* -------- SERCOM_SPIS_INTENCLR : (SERCOM Offset: 0x14) (R/W 8) SPIS Interrupt Enable Clear -------- */
#define SERCOM_SPIS_INTENCLR_RESETVALUE                                                                                \
        _UINT8_(0x00) /*  (SERCOM_SPIS_INTENCLR) SPIS Interrupt Enable Clear  Reset Value */

#define SERCOM_SPIS_INTENCLR_DRE_Pos                                                                                   \
        _UINT8_(0) /* (SERCOM_SPIS_INTENCLR) Data Register Empty Interrupt Disable Position */
#define SERCOM_SPIS_INTENCLR_DRE_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIS_INTENCLR_DRE_Pos) /* (SERCOM_SPIS_INTENCLR) Data Register Empty Interrupt Disable Mask */
#define SERCOM_SPIS_INTENCLR_DRE(value)                                                                                \
        (SERCOM_SPIS_INTENCLR_DRE_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTENCLR_DRE_Pos)) /* Assigment of value for DRE in the SERCOM_SPIS_INTENCLR register */
#define SERCOM_SPIS_INTENCLR_TXC_Pos                                                                                   \
        _UINT8_(1) /* (SERCOM_SPIS_INTENCLR) Transmit Complete Interrupt Disable Position */
#define SERCOM_SPIS_INTENCLR_TXC_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIS_INTENCLR_TXC_Pos) /* (SERCOM_SPIS_INTENCLR) Transmit Complete Interrupt Disable Mask */
#define SERCOM_SPIS_INTENCLR_TXC(value)                                                                                \
        (SERCOM_SPIS_INTENCLR_TXC_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTENCLR_TXC_Pos)) /* Assigment of value for TXC in the SERCOM_SPIS_INTENCLR register */
#define SERCOM_SPIS_INTENCLR_RXC_Pos _UINT8_(2) /* (SERCOM_SPIS_INTENCLR) Receive Complete Interrupt Disable Position  \
                                                 */
#define SERCOM_SPIS_INTENCLR_RXC_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIS_INTENCLR_RXC_Pos) /* (SERCOM_SPIS_INTENCLR) Receive Complete Interrupt Disable Mask */
#define SERCOM_SPIS_INTENCLR_RXC(value)                                                                                \
        (SERCOM_SPIS_INTENCLR_RXC_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTENCLR_RXC_Pos)) /* Assigment of value for RXC in the SERCOM_SPIS_INTENCLR register */
#define SERCOM_SPIS_INTENCLR_SSL_Pos _UINT8_(3) /* (SERCOM_SPIS_INTENCLR) Slave Select Low Interrupt Disable Position  \
                                                 */
#define SERCOM_SPIS_INTENCLR_SSL_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIS_INTENCLR_SSL_Pos) /* (SERCOM_SPIS_INTENCLR) Slave Select Low Interrupt Disable Mask */
#define SERCOM_SPIS_INTENCLR_SSL(value)                                                                                \
        (SERCOM_SPIS_INTENCLR_SSL_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTENCLR_SSL_Pos)) /* Assigment of value for SSL in the SERCOM_SPIS_INTENCLR register */
#define SERCOM_SPIS_INTENCLR_ERROR_Pos _UINT8_(7) /* (SERCOM_SPIS_INTENCLR) Combined Error Interrupt Disable Position  \
                                                   */
#define SERCOM_SPIS_INTENCLR_ERROR_Msk                                                                                 \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIS_INTENCLR_ERROR_Pos) /* (SERCOM_SPIS_INTENCLR) Combined Error Interrupt Disable Mask */
#define SERCOM_SPIS_INTENCLR_ERROR(value)                                                                              \
        (SERCOM_SPIS_INTENCLR_ERROR_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTENCLR_ERROR_Pos)) /* Assigment of value for ERROR in the SERCOM_SPIS_INTENCLR register */
#define SERCOM_SPIS_INTENCLR_Msk _UINT8_(0x8F) /* (SERCOM_SPIS_INTENCLR) Register Mask  */


/* -------- SERCOM_USART_EXT_INTENCLR : (SERCOM Offset: 0x14) (R/W 8) USART_EXT Interrupt Enable Clear -------- */
#define SERCOM_USART_EXT_INTENCLR_RESETVALUE                                                                           \
        _UINT8_(0x00) /*  (SERCOM_USART_EXT_INTENCLR) USART_EXT Interrupt Enable Clear  Reset Value */

