ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
#define SERCOM_USART_EXT_INTENCLR_DRE_Pos                                                                              \
        _UINT8_(0) /* (SERCOM_USART_EXT_INTENCLR) Data Register Empty Interrupt Disable Position */
#define SERCOM_USART_EXT_INTENCLR_DRE_Msk                                                                              \
        (_UINT8_(0x1) << SERCOM_USART_EXT_INTENCLR_DRE_Pos) /* (SERCOM_USART_EXT_INTENCLR) Data Register Empty         \
                                                               Interrupt Disable Mask */
#define SERCOM_USART_EXT_INTENCLR_DRE(value)                                                                           \
        (SERCOM_USART_EXT_INTENCLR_DRE_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_EXT_INTENCLR_DRE_Pos)) /* Assigment of value for DRE in the                   \
                                                                   SERCOM_USART_EXT_INTENCLR register */
#define SERCOM_USART_EXT_INTENCLR_TXC_Pos                                                                              \
        _UINT8_(1) /* (SERCOM_USART_EXT_INTENCLR) Transmit Complete Interrupt Disable Position */
#define SERCOM_USART_EXT_INTENCLR_TXC_Msk                                                                              \
        (_UINT8_(0x1) << SERCOM_USART_EXT_INTENCLR_TXC_Pos) /* (SERCOM_USART_EXT_INTENCLR) Transmit Complete Interrupt \
                                                               Disable Mask */
#define SERCOM_USART_EXT_INTENCLR_TXC(value)                                                                           \
        (SERCOM_USART_EXT_INTENCLR_TXC_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_EXT_INTENCLR_TXC_Pos)) /* Assigment of value for TXC in the                   \
                                                                   SERCOM_USART_EXT_INTENCLR register */
#define SERCOM_USART_EXT_INTENCLR_RXC_Pos                                                                              \
        _UINT8_(2) /* (SERCOM_USART_EXT_INTENCLR) Receive Complete Interrupt Disable Position */
#define SERCOM_USART_EXT_INTENCLR_RXC_Msk                                                                              \
        (_UINT8_(0x1) << SERCOM_USART_EXT_INTENCLR_RXC_Pos) /* (SERCOM_USART_EXT_INTENCLR) Receive Complete Interrupt  \
                                                               Disable Mask */
#define SERCOM_USART_EXT_INTENCLR_RXC(value)                                                                           \
        (SERCOM_USART_EXT_INTENCLR_RXC_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_EXT_INTENCLR_RXC_Pos)) /* Assigment of value for RXC in the                   \
                                                                   SERCOM_USART_EXT_INTENCLR register */
#define SERCOM_USART_EXT_INTENCLR_RXS_Pos                                                                              \
        _UINT8_(3) /* (SERCOM_USART_EXT_INTENCLR) Receive Start Interrupt Disable Position */
#define SERCOM_USART_EXT_INTENCLR_RXS_Msk                                                                              \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_USART_EXT_INTENCLR_RXS_Pos) /* (SERCOM_USART_EXT_INTENCLR) Receive Start Interrupt Disable Mask */
#define SERCOM_USART_EXT_INTENCLR_RXS(value)                                                                           \
        (SERCOM_USART_EXT_INTENCLR_RXS_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_EXT_INTENCLR_RXS_Pos)) /* Assigment of value for RXS in the                   \
                                                                   SERCOM_USART_EXT_INTENCLR register */
#define SERCOM_USART_EXT_INTENCLR_CTSIC_Pos                                                                            \
        _UINT8_(4) /* (SERCOM_USART_EXT_INTENCLR) Clear To Send Input Change Interrupt Disable Position */
#define SERCOM_USART_EXT_INTENCLR_CTSIC_Msk                                                                            \
        (_UINT8_(0x1) << SERCOM_USART_EXT_INTENCLR_CTSIC_Pos) /* (SERCOM_USART_EXT_INTENCLR) Clear To Send Input       \
                                                                 Change Interrupt Disable Mask */
#define SERCOM_USART_EXT_INTENCLR_CTSIC(value)                                                                         \
        (SERCOM_USART_EXT_INTENCLR_CTSIC_Msk &                                                                         \
         (_UINT8_(value) << SERCOM_USART_EXT_INTENCLR_CTSIC_Pos)) /* Assigment of value for CTSIC in the               \
                                                                     SERCOM_USART_EXT_INTENCLR register */
#define SERCOM_USART_EXT_INTENCLR_RXBRK_Pos                                                                            \
        _UINT8_(5) /* (SERCOM_USART_EXT_INTENCLR) Break Received Interrupt Disable Position */
#define SERCOM_USART_EXT_INTENCLR_RXBRK_Msk                                                                            \
        (_UINT8_(0x1) << SERCOM_USART_EXT_INTENCLR_RXBRK_Pos) /* (SERCOM_USART_EXT_INTENCLR) Break Received Interrupt  \
                                                                 Disable Mask */
#define SERCOM_USART_EXT_INTENCLR_RXBRK(value)                                                                         \
        (SERCOM_USART_EXT_INTENCLR_RXBRK_Msk &                                                                         \
         (_UINT8_(value) << SERCOM_USART_EXT_INTENCLR_RXBRK_Pos)) /* Assigment of value for RXBRK in the               \
                                                                     SERCOM_USART_EXT_INTENCLR register */
#define SERCOM_USART_EXT_INTENCLR_ERROR_Pos                                                                            \
        _UINT8_(7) /* (SERCOM_USART_EXT_INTENCLR) Combined Error Interrupt Disable Position */
#define SERCOM_USART_EXT_INTENCLR_ERROR_Msk                                                                            \
        (_UINT8_(0x1) << SERCOM_USART_EXT_INTENCLR_ERROR_Pos) /* (SERCOM_USART_EXT_INTENCLR) Combined Error Interrupt  \
                                                                 Disable Mask */
#define SERCOM_USART_EXT_INTENCLR_ERROR(value)                                                                         \
        (SERCOM_USART_EXT_INTENCLR_ERROR_Msk &                                                                         \
         (_UINT8_(value) << SERCOM_USART_EXT_INTENCLR_ERROR_Pos)) /* Assigment of value for ERROR in the               \
                                                                     SERCOM_USART_EXT_INTENCLR register */
#define SERCOM_USART_EXT_INTENCLR_Msk _UINT8_(0xBF) /* (SERCOM_USART_EXT_INTENCLR) Register Mask  */


/* -------- SERCOM_USART_INT_INTENCLR : (SERCOM Offset: 0x14) (R/W 8) USART_INT Interrupt Enable Clear -------- */
#define SERCOM_USART_INT_INTENCLR_RESETVALUE                                                                           \
        _UINT8_(0x00) /*  (SERCOM_USART_INT_INTENCLR) USART_INT Interrupt Enable Clear  Reset Value */

#define SERCOM_USART_INT_INTENCLR_DRE_Pos                                                                              \
        _UINT8_(0) /* (SERCOM_USART_INT_INTENCLR) Data Register Empty Interrupt Disable Position */
#define SERCOM_USART_INT_INTENCLR_DRE_Msk                                                                              \
        (_UINT8_(0x1) << SERCOM_USART_INT_INTENCLR_DRE_Pos) /* (SERCOM_USART_INT_INTENCLR) Data Register Empty         \
                                                               Interrupt Disable Mask */
#define SERCOM_USART_INT_INTENCLR_DRE(value)                                                                           \
        (SERCOM_USART_INT_INTENCLR_DRE_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_INT_INTENCLR_DRE_Pos)) /* Assigment of value for DRE in the                   \
                                                                   SERCOM_USART_INT_INTENCLR register */
#define SERCOM_USART_INT_INTENCLR_TXC_Pos                                                                              \
        _UINT8_(1) /* (SERCOM_USART_INT_INTENCLR) Transmit Complete Interrupt Disable Position */
#define SERCOM_USART_INT_INTENCLR_TXC_Msk                                                                              \
        (_UINT8_(0x1) << SERCOM_USART_INT_INTENCLR_TXC_Pos) /* (SERCOM_USART_INT_INTENCLR) Transmit Complete Interrupt \
                                                               Disable Mask */
#define SERCOM_USART_INT_INTENCLR_TXC(value)                                                                           \
        (SERCOM_USART_INT_INTENCLR_TXC_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_INT_INTENCLR_TXC_Pos)) /* Assigment of value for TXC in the                   \
                                                                   SERCOM_USART_INT_INTENCLR register */
#define SERCOM_USART_INT_INTENCLR_RXC_Pos                                                                              \
        _UINT8_(2) /* (SERCOM_USART_INT_INTENCLR) Receive Complete Interrupt Disable Position */
#define SERCOM_USART_INT_INTENCLR_RXC_Msk                                                                              \
        (_UINT8_(0x1) << SERCOM_USART_INT_INTENCLR_RXC_Pos) /* (SERCOM_USART_INT_INTENCLR) Receive Complete Interrupt  \
                                                               Disable Mask */
#define SERCOM_USART_INT_INTENCLR_RXC(value)                                                                           \
        (SERCOM_USART_INT_INTENCLR_RXC_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_INT_INTENCLR_RXC_Pos)) /* Assigment of value for RXC in the                   \
                                                                   SERCOM_USART_INT_INTENCLR register */
#define SERCOM_USART_INT_INTENCLR_RXS_Pos                                                                              \
        _UINT8_(3) /* (SERCOM_USART_INT_INTENCLR) Receive Start Interrupt Disable Position */
#define SERCOM_USART_INT_INTENCLR_RXS_Msk                                                                              \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_USART_INT_INTENCLR_RXS_Pos) /* (SERCOM_USART_INT_INTENCLR) Receive Start Interrupt Disable Mask */
#define SERCOM_USART_INT_INTENCLR_RXS(value)                                                                           \
        (SERCOM_USART_INT_INTENCLR_RXS_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_INT_INTENCLR_RXS_Pos)) /* Assigment of value for RXS in the                   \
                                                                   SERCOM_USART_INT_INTENCLR register */
#define SERCOM_USART_INT_INTENCLR_CTSIC_Pos                                                                            \
        _UINT8_(4) /* (SERCOM_USART_INT_INTENCLR) Clear To Send Input Change Interrupt Disable Position */
#define SERCOM_USART_INT_INTENCLR_CTSIC_Msk                                                                            \
        (_UINT8_(0x1) << SERCOM_USART_INT_INTENCLR_CTSIC_Pos) /* (SERCOM_USART_INT_INTENCLR) Clear To Send Input       \
                                                                 Change Interrupt Disable Mask */
#define SERCOM_USART_INT_INTENCLR_CTSIC(value)                                                                         \
        (SERCOM_USART_INT_INTENCLR_CTSIC_Msk &                                                                         \
         (_UINT8_(value) << SERCOM_USART_INT_INTENCLR_CTSIC_Pos)) /* Assigment of value for CTSIC in the               \
                                                                     SERCOM_USART_INT_INTENCLR register */
#define SERCOM_USART_INT_INTENCLR_RXBRK_Pos                                                                            \
        _UINT8_(5) /* (SERCOM_USART_INT_INTENCLR) Break Received Interrupt Disable Position */
#define SERCOM_USART_INT_INTENCLR_RXBRK_Msk                                                                            \
        (_UINT8_(0x1) << SERCOM_USART_INT_INTENCLR_RXBRK_Pos) /* (SERCOM_USART_INT_INTENCLR) Break Received Interrupt  \
                                                                 Disable Mask */
#define SERCOM_USART_INT_INTENCLR_RXBRK(value)                                                                         \
        (SERCOM_USART_INT_INTENCLR_RXBRK_Msk &                                                                         \
         (_UINT8_(value) << SERCOM_USART_INT_INTENCLR_RXBRK_Pos)) /* Assigment of value for RXBRK in the               \
                                                                     SERCOM_USART_INT_INTENCLR register */
#define SERCOM_USART_INT_INTENCLR_ERROR_Pos                                                                            \
        _UINT8_(7) /* (SERCOM_USART_INT_INTENCLR) Combined Error Interrupt Disable Position */
#define SERCOM_USART_INT_INTENCLR_ERROR_Msk                                                                            \
        (_UINT8_(0x1) << SERCOM_USART_INT_INTENCLR_ERROR_Pos) /* (SERCOM_USART_INT_INTENCLR) Combined Error Interrupt  \
                                                                 Disable Mask */
#define SERCOM_USART_INT_INTENCLR_ERROR(value)                                                                         \
        (SERCOM_USART_INT_INTENCLR_ERROR_Msk &                                                                         \
         (_UINT8_(value) << SERCOM_USART_INT_INTENCLR_ERROR_Pos)) /* Assigment of value for ERROR in the               \
                                                                     SERCOM_USART_INT_INTENCLR register */
#define SERCOM_USART_INT_INTENCLR_Msk _UINT8_(0xBF) /* (SERCOM_USART_INT_INTENCLR) Register Mask  */


