ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
/* -------- SERCOM_I2CM_INTENSET : (SERCOM Offset: 0x16) (R/W 8) I2CM Interrupt Enable Set -------- */
#define SERCOM_I2CM_INTENSET_RESETVALUE                                                                                \
        _UINT8_(0x00) /*  (SERCOM_I2CM_INTENSET) I2CM Interrupt Enable Set  Reset Value */

#define SERCOM_I2CM_INTENSET_MB_Pos _UINT8_(0) /* (SERCOM_I2CM_INTENSET) Master On Bus Interrupt Enable Position */
#define SERCOM_I2CM_INTENSET_MB_Msk                                                                                    \
        (_UINT8_(0x1) << SERCOM_I2CM_INTENSET_MB_Pos) /* (SERCOM_I2CM_INTENSET) Master On Bus Interrupt Enable Mask */
#define SERCOM_I2CM_INTENSET_MB(value)                                                                                 \
        (SERCOM_I2CM_INTENSET_MB_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CM_INTENSET_MB_Pos)) /* Assigment of value for MB in the SERCOM_I2CM_INTENSET register */
#define SERCOM_I2CM_INTENSET_SB_Pos _UINT8_(1) /* (SERCOM_I2CM_INTENSET) Slave On Bus Interrupt Enable Position */
#define SERCOM_I2CM_INTENSET_SB_Msk                                                                                    \
        (_UINT8_(0x1) << SERCOM_I2CM_INTENSET_SB_Pos) /* (SERCOM_I2CM_INTENSET) Slave On Bus Interrupt Enable Mask */
#define SERCOM_I2CM_INTENSET_SB(value)                                                                                 \
        (SERCOM_I2CM_INTENSET_SB_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CM_INTENSET_SB_Pos)) /* Assigment of value for SB in the SERCOM_I2CM_INTENSET register */
#define SERCOM_I2CM_INTENSET_ERROR_Pos _UINT8_(7) /* (SERCOM_I2CM_INTENSET) Combined Error Interrupt Enable Position   \
                                                   */
#define SERCOM_I2CM_INTENSET_ERROR_Msk                                                                                 \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_I2CM_INTENSET_ERROR_Pos) /* (SERCOM_I2CM_INTENSET) Combined Error Interrupt Enable Mask */
#define SERCOM_I2CM_INTENSET_ERROR(value)                                                                              \
        (SERCOM_I2CM_INTENSET_ERROR_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CM_INTENSET_ERROR_Pos)) /* Assigment of value for ERROR in the SERCOM_I2CM_INTENSET register */
#define SERCOM_I2CM_INTENSET_Msk _UINT8_(0x83) /* (SERCOM_I2CM_INTENSET) Register Mask  */


/* -------- SERCOM_I2CS_INTENSET : (SERCOM Offset: 0x16) (R/W 8) I2CS Interrupt Enable Set -------- */
#define SERCOM_I2CS_INTENSET_RESETVALUE                                                                                \
        _UINT8_(0x00) /*  (SERCOM_I2CS_INTENSET) I2CS Interrupt Enable Set  Reset Value */

#define SERCOM_I2CS_INTENSET_PREC_Pos _UINT8_(0) /* (SERCOM_I2CS_INTENSET) Stop Received Interrupt Enable Position */
#define SERCOM_I2CS_INTENSET_PREC_Msk                                                                                  \
        (_UINT8_(0x1) << SERCOM_I2CS_INTENSET_PREC_Pos) /* (SERCOM_I2CS_INTENSET) Stop Received Interrupt Enable Mask  \
                                                         */
#define SERCOM_I2CS_INTENSET_PREC(value)                                                                               \
        (SERCOM_I2CS_INTENSET_PREC_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CS_INTENSET_PREC_Pos)) /* Assigment of value for PREC in the SERCOM_I2CS_INTENSET register */
#define SERCOM_I2CS_INTENSET_AMATCH_Pos _UINT8_(1) /* (SERCOM_I2CS_INTENSET) Address Match Interrupt Enable Position   \
                                                    */
#define SERCOM_I2CS_INTENSET_AMATCH_Msk                                                                                \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_I2CS_INTENSET_AMATCH_Pos) /* (SERCOM_I2CS_INTENSET) Address Match Interrupt Enable Mask */
#define SERCOM_I2CS_INTENSET_AMATCH(value)                                                                             \
        (SERCOM_I2CS_INTENSET_AMATCH_Msk &                                                                             \
         (_UINT8_(value) << SERCOM_I2CS_INTENSET_AMATCH_Pos)) /* Assigment of value for AMATCH in the                  \
                                                                 SERCOM_I2CS_INTENSET register */
#define SERCOM_I2CS_INTENSET_DRDY_Pos _UINT8_(2) /* (SERCOM_I2CS_INTENSET) Data Interrupt Enable Position */
#define SERCOM_I2CS_INTENSET_DRDY_Msk                                                                                  \
        (_UINT8_(0x1) << SERCOM_I2CS_INTENSET_DRDY_Pos) /* (SERCOM_I2CS_INTENSET) Data Interrupt Enable Mask */
#define SERCOM_I2CS_INTENSET_DRDY(value)                                                                               \
        (SERCOM_I2CS_INTENSET_DRDY_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CS_INTENSET_DRDY_Pos)) /* Assigment of value for DRDY in the SERCOM_I2CS_INTENSET register */
#define SERCOM_I2CS_INTENSET_ERROR_Pos _UINT8_(7) /* (SERCOM_I2CS_INTENSET) Combined Error Interrupt Enable Position   \
                                                   */
#define SERCOM_I2CS_INTENSET_ERROR_Msk                                                                                 \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_I2CS_INTENSET_ERROR_Pos) /* (SERCOM_I2CS_INTENSET) Combined Error Interrupt Enable Mask */
#define SERCOM_I2CS_INTENSET_ERROR(value)                                                                              \
        (SERCOM_I2CS_INTENSET_ERROR_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CS_INTENSET_ERROR_Pos)) /* Assigment of value for ERROR in the SERCOM_I2CS_INTENSET register */
#define SERCOM_I2CS_INTENSET_Msk _UINT8_(0x87) /* (SERCOM_I2CS_INTENSET) Register Mask  */


/* -------- SERCOM_SPIM_INTENSET : (SERCOM Offset: 0x16) (R/W 8) SPIM Interrupt Enable Set -------- */
#define SERCOM_SPIM_INTENSET_RESETVALUE                                                                                \
        _UINT8_(0x00) /*  (SERCOM_SPIM_INTENSET) SPIM Interrupt Enable Set  Reset Value */

#define SERCOM_SPIM_INTENSET_DRE_Pos                                                                                   \
        _UINT8_(0) /* (SERCOM_SPIM_INTENSET) Data Register Empty Interrupt Enable Position */
#define SERCOM_SPIM_INTENSET_DRE_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIM_INTENSET_DRE_Pos) /* (SERCOM_SPIM_INTENSET) Data Register Empty Interrupt Enable Mask */
#define SERCOM_SPIM_INTENSET_DRE(value)                                                                                \
        (SERCOM_SPIM_INTENSET_DRE_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTENSET_DRE_Pos)) /* Assigment of value for DRE in the SERCOM_SPIM_INTENSET register */
#define SERCOM_SPIM_INTENSET_TXC_Pos _UINT8_(1) /* (SERCOM_SPIM_INTENSET) Transmit Complete Interrupt Enable Position  \
                                                 */
#define SERCOM_SPIM_INTENSET_TXC_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIM_INTENSET_TXC_Pos) /* (SERCOM_SPIM_INTENSET) Transmit Complete Interrupt Enable Mask */
#define SERCOM_SPIM_INTENSET_TXC(value)                                                                                \
        (SERCOM_SPIM_INTENSET_TXC_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTENSET_TXC_Pos)) /* Assigment of value for TXC in the SERCOM_SPIM_INTENSET register */
#define SERCOM_SPIM_INTENSET_RXC_Pos _UINT8_(2) /* (SERCOM_SPIM_INTENSET) Receive Complete Interrupt Enable Position   \
                                                 */
#define SERCOM_SPIM_INTENSET_RXC_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIM_INTENSET_RXC_Pos) /* (SERCOM_SPIM_INTENSET) Receive Complete Interrupt Enable Mask */
#define SERCOM_SPIM_INTENSET_RXC(value)                                                                                \
        (SERCOM_SPIM_INTENSET_RXC_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTENSET_RXC_Pos)) /* Assigment of value for RXC in the SERCOM_SPIM_INTENSET register */
#define SERCOM_SPIM_INTENSET_SSL_Pos _UINT8_(3) /* (SERCOM_SPIM_INTENSET) Slave Select Low Interrupt Enable Position   \
                                                 */
#define SERCOM_SPIM_INTENSET_SSL_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIM_INTENSET_SSL_Pos) /* (SERCOM_SPIM_INTENSET) Slave Select Low Interrupt Enable Mask */
#define SERCOM_SPIM_INTENSET_SSL(value)                                                                                \
        (SERCOM_SPIM_INTENSET_SSL_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTENSET_SSL_Pos)) /* Assigment of value for SSL in the SERCOM_SPIM_INTENSET register */
#define SERCOM_SPIM_INTENSET_ERROR_Pos _UINT8_(7) /* (SERCOM_SPIM_INTENSET) Combined Error Interrupt Enable Position   \
                                                   */
#define SERCOM_SPIM_INTENSET_ERROR_Msk                                                                                 \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIM_INTENSET_ERROR_Pos) /* (SERCOM_SPIM_INTENSET) Combined Error Interrupt Enable Mask */
#define SERCOM_SPIM_INTENSET_ERROR(value)                                                                              \
        (SERCOM_SPIM_INTENSET_ERROR_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTENSET_ERROR_Pos)) /* Assigment of value for ERROR in the SERCOM_SPIM_INTENSET register */
#define SERCOM_SPIM_INTENSET_Msk _UINT8_(0x8F) /* (SERCOM_SPIM_INTENSET) Register Mask  */


