ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
/* -------- SERCOM_SPIS_INTENSET : (SERCOM Offset: 0x16) (R/W 8) SPIS Interrupt Enable Set -------- */
#define SERCOM_SPIS_INTENSET_RESETVALUE                                                                                \
        _UINT8_(0x00) /*  (SERCOM_SPIS_INTENSET) SPIS Interrupt Enable Set  Reset Value */

#define SERCOM_SPIS_INTENSET_DRE_Pos                                                                                   \
        _UINT8_(0) /* (SERCOM_SPIS_INTENSET) Data Register Empty Interrupt Enable Position */
#define SERCOM_SPIS_INTENSET_DRE_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIS_INTENSET_DRE_Pos) /* (SERCOM_SPIS_INTENSET) Data Register Empty Interrupt Enable Mask */
#define SERCOM_SPIS_INTENSET_DRE(value)                                                                                \
        (SERCOM_SPIS_INTENSET_DRE_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTENSET_DRE_Pos)) /* Assigment of value for DRE in the SERCOM_SPIS_INTENSET register */
#define SERCOM_SPIS_INTENSET_TXC_Pos _UINT8_(1) /* (SERCOM_SPIS_INTENSET) Transmit Complete Interrupt Enable Position  \
                                                 */
#define SERCOM_SPIS_INTENSET_TXC_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIS_INTENSET_TXC_Pos) /* (SERCOM_SPIS_INTENSET) Transmit Complete Interrupt Enable Mask */
#define SERCOM_SPIS_INTENSET_TXC(value)                                                                                \
        (SERCOM_SPIS_INTENSET_TXC_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTENSET_TXC_Pos)) /* Assigment of value for TXC in the SERCOM_SPIS_INTENSET register */
#define SERCOM_SPIS_INTENSET_RXC_Pos _UINT8_(2) /* (SERCOM_SPIS_INTENSET) Receive Complete Interrupt Enable Position   \
                                                 */
#define SERCOM_SPIS_INTENSET_RXC_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIS_INTENSET_RXC_Pos) /* (SERCOM_SPIS_INTENSET) Receive Complete Interrupt Enable Mask */
#define SERCOM_SPIS_INTENSET_RXC(value)                                                                                \
        (SERCOM_SPIS_INTENSET_RXC_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTENSET_RXC_Pos)) /* Assigment of value for RXC in the SERCOM_SPIS_INTENSET register */
#define SERCOM_SPIS_INTENSET_SSL_Pos _UINT8_(3) /* (SERCOM_SPIS_INTENSET) Slave Select Low Interrupt Enable Position   \
                                                 */
#define SERCOM_SPIS_INTENSET_SSL_Msk                                                                                   \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIS_INTENSET_SSL_Pos) /* (SERCOM_SPIS_INTENSET) Slave Select Low Interrupt Enable Mask */
#define SERCOM_SPIS_INTENSET_SSL(value)                                                                                \
        (SERCOM_SPIS_INTENSET_SSL_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTENSET_SSL_Pos)) /* Assigment of value for SSL in the SERCOM_SPIS_INTENSET register */
#define SERCOM_SPIS_INTENSET_ERROR_Pos _UINT8_(7) /* (SERCOM_SPIS_INTENSET) Combined Error Interrupt Enable Position   \
                                                   */
#define SERCOM_SPIS_INTENSET_ERROR_Msk                                                                                 \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_SPIS_INTENSET_ERROR_Pos) /* (SERCOM_SPIS_INTENSET) Combined Error Interrupt Enable Mask */
#define SERCOM_SPIS_INTENSET_ERROR(value)                                                                              \
        (SERCOM_SPIS_INTENSET_ERROR_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTENSET_ERROR_Pos)) /* Assigment of value for ERROR in the SERCOM_SPIS_INTENSET register */
#define SERCOM_SPIS_INTENSET_Msk _UINT8_(0x8F) /* (SERCOM_SPIS_INTENSET) Register Mask  */


/* -------- SERCOM_USART_EXT_INTENSET : (SERCOM Offset: 0x16) (R/W 8) USART_EXT Interrupt Enable Set -------- */
#define SERCOM_USART_EXT_INTENSET_RESETVALUE                                                                           \
        _UINT8_(0x00) /*  (SERCOM_USART_EXT_INTENSET) USART_EXT Interrupt Enable Set  Reset Value */

#define SERCOM_USART_EXT_INTENSET_DRE_Pos                                                                              \
        _UINT8_(0) /* (SERCOM_USART_EXT_INTENSET) Data Register Empty Interrupt Enable Position */
#define SERCOM_USART_EXT_INTENSET_DRE_Msk                                                                              \
        (_UINT8_(0x1) << SERCOM_USART_EXT_INTENSET_DRE_Pos) /* (SERCOM_USART_EXT_INTENSET) Data Register Empty         \
                                                               Interrupt Enable Mask */
#define SERCOM_USART_EXT_INTENSET_DRE(value)                                                                           \
        (SERCOM_USART_EXT_INTENSET_DRE_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_EXT_INTENSET_DRE_Pos)) /* Assigment of value for DRE in the                   \
                                                                   SERCOM_USART_EXT_INTENSET register */
#define SERCOM_USART_EXT_INTENSET_TXC_Pos                                                                              \
        _UINT8_(1) /* (SERCOM_USART_EXT_INTENSET) Transmit Complete Interrupt Enable Position */
#define SERCOM_USART_EXT_INTENSET_TXC_Msk                                                                              \
        (_UINT8_(0x1) << SERCOM_USART_EXT_INTENSET_TXC_Pos) /* (SERCOM_USART_EXT_INTENSET) Transmit Complete Interrupt \
                                                               Enable Mask */
#define SERCOM_USART_EXT_INTENSET_TXC(value)                                                                           \
        (SERCOM_USART_EXT_INTENSET_TXC_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_EXT_INTENSET_TXC_Pos)) /* Assigment of value for TXC in the                   \
                                                                   SERCOM_USART_EXT_INTENSET register */
#define SERCOM_USART_EXT_INTENSET_RXC_Pos                                                                              \
        _UINT8_(2) /* (SERCOM_USART_EXT_INTENSET) Receive Complete Interrupt Enable Position */
#define SERCOM_USART_EXT_INTENSET_RXC_Msk                                                                              \
        (_UINT8_(0x1) << SERCOM_USART_EXT_INTENSET_RXC_Pos) /* (SERCOM_USART_EXT_INTENSET) Receive Complete Interrupt  \
                                                               Enable Mask */
#define SERCOM_USART_EXT_INTENSET_RXC(value)                                                                           \
        (SERCOM_USART_EXT_INTENSET_RXC_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_EXT_INTENSET_RXC_Pos)) /* Assigment of value for RXC in the                   \
                                                                   SERCOM_USART_EXT_INTENSET register */
#define SERCOM_USART_EXT_INTENSET_RXS_Pos                                                                              \
        _UINT8_(3) /* (SERCOM_USART_EXT_INTENSET) Receive Start Interrupt Enable Position */
#define SERCOM_USART_EXT_INTENSET_RXS_Msk                                                                              \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_USART_EXT_INTENSET_RXS_Pos) /* (SERCOM_USART_EXT_INTENSET) Receive Start Interrupt Enable Mask */
#define SERCOM_USART_EXT_INTENSET_RXS(value)                                                                           \
        (SERCOM_USART_EXT_INTENSET_RXS_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_EXT_INTENSET_RXS_Pos)) /* Assigment of value for RXS in the                   \
                                                                   SERCOM_USART_EXT_INTENSET register */
#define SERCOM_USART_EXT_INTENSET_CTSIC_Pos                                                                            \
        _UINT8_(4) /* (SERCOM_USART_EXT_INTENSET) Clear To Send Input Change Interrupt Enable Position */
#define SERCOM_USART_EXT_INTENSET_CTSIC_Msk                                                                            \
        (_UINT8_(0x1) << SERCOM_USART_EXT_INTENSET_CTSIC_Pos) /* (SERCOM_USART_EXT_INTENSET) Clear To Send Input       \
                                                                 Change Interrupt Enable Mask */
#define SERCOM_USART_EXT_INTENSET_CTSIC(value)                                                                         \
        (SERCOM_USART_EXT_INTENSET_CTSIC_Msk &                                                                         \
         (_UINT8_(value) << SERCOM_USART_EXT_INTENSET_CTSIC_Pos)) /* Assigment of value for CTSIC in the               \
                                                                     SERCOM_USART_EXT_INTENSET register */
#define SERCOM_USART_EXT_INTENSET_RXBRK_Pos                                                                            \
        _UINT8_(5) /* (SERCOM_USART_EXT_INTENSET) Break Received Interrupt Enable Position */
#define SERCOM_USART_EXT_INTENSET_RXBRK_Msk                                                                            \
        (_UINT8_(0x1) << SERCOM_USART_EXT_INTENSET_RXBRK_Pos) /* (SERCOM_USART_EXT_INTENSET) Break Received Interrupt  \
                                                                 Enable Mask */
#define SERCOM_USART_EXT_INTENSET_RXBRK(value)                                                                         \
        (SERCOM_USART_EXT_INTENSET_RXBRK_Msk &                                                                         \
         (_UINT8_(value) << SERCOM_USART_EXT_INTENSET_RXBRK_Pos)) /* Assigment of value for RXBRK in the               \
                                                                     SERCOM_USART_EXT_INTENSET register */
#define SERCOM_USART_EXT_INTENSET_ERROR_Pos                                                                            \
        _UINT8_(7) /* (SERCOM_USART_EXT_INTENSET) Combined Error Interrupt Enable Position */
#define SERCOM_USART_EXT_INTENSET_ERROR_Msk                                                                            \
        (_UINT8_(0x1) << SERCOM_USART_EXT_INTENSET_ERROR_Pos) /* (SERCOM_USART_EXT_INTENSET) Combined Error Interrupt  \
                                                                 Enable Mask */
#define SERCOM_USART_EXT_INTENSET_ERROR(value)                                                                         \
        (SERCOM_USART_EXT_INTENSET_ERROR_Msk &                                                                         \
         (_UINT8_(value) << SERCOM_USART_EXT_INTENSET_ERROR_Pos)) /* Assigment of value for ERROR in the               \
                                                                     SERCOM_USART_EXT_INTENSET register */
#define SERCOM_USART_EXT_INTENSET_Msk _UINT8_(0xBF) /* (SERCOM_USART_EXT_INTENSET) Register Mask  */


/* -------- SERCOM_USART_INT_INTENSET : (SERCOM Offset: 0x16) (R/W 8) USART_INT Interrupt Enable Set -------- */
#define SERCOM_USART_INT_INTENSET_RESETVALUE                                                                           \
        _UINT8_(0x00) /*  (SERCOM_USART_INT_INTENSET) USART_INT Interrupt Enable Set  Reset Value */

#define SERCOM_USART_INT_INTENSET_DRE_Pos                                                                              \
        _UINT8_(0) /* (SERCOM_USART_INT_INTENSET) Data Register Empty Interrupt Enable Position */
#define SERCOM_USART_INT_INTENSET_DRE_Msk                                                                              \
        (_UINT8_(0x1) << SERCOM_USART_INT_INTENSET_DRE_Pos) /* (SERCOM_USART_INT_INTENSET) Data Register Empty         \
                                                               Interrupt Enable Mask */
#define SERCOM_USART_INT_INTENSET_DRE(value)                                                                           \
        (SERCOM_USART_INT_INTENSET_DRE_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_INT_INTENSET_DRE_Pos)) /* Assigment of value for DRE in the                   \
                                                                   SERCOM_USART_INT_INTENSET register */
#define SERCOM_USART_INT_INTENSET_TXC_Pos                                                                              \
        _UINT8_(1) /* (SERCOM_USART_INT_INTENSET) Transmit Complete Interrupt Enable Position */
#define SERCOM_USART_INT_INTENSET_TXC_Msk                                                                              \
        (_UINT8_(0x1) << SERCOM_USART_INT_INTENSET_TXC_Pos) /* (SERCOM_USART_INT_INTENSET) Transmit Complete Interrupt \
                                                               Enable Mask */
#define SERCOM_USART_INT_INTENSET_TXC(value)                                                                           \
        (SERCOM_USART_INT_INTENSET_TXC_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_INT_INTENSET_TXC_Pos)) /* Assigment of value for TXC in the                   \
                                                                   SERCOM_USART_INT_INTENSET register */
#define SERCOM_USART_INT_INTENSET_RXC_Pos                                                                              \
        _UINT8_(2) /* (SERCOM_USART_INT_INTENSET) Receive Complete Interrupt Enable Position */
#define SERCOM_USART_INT_INTENSET_RXC_Msk                                                                              \
        (_UINT8_(0x1) << SERCOM_USART_INT_INTENSET_RXC_Pos) /* (SERCOM_USART_INT_INTENSET) Receive Complete Interrupt  \
                                                               Enable Mask */
#define SERCOM_USART_INT_INTENSET_RXC(value)                                                                           \
        (SERCOM_USART_INT_INTENSET_RXC_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_INT_INTENSET_RXC_Pos)) /* Assigment of value for RXC in the                   \
                                                                   SERCOM_USART_INT_INTENSET register */
#define SERCOM_USART_INT_INTENSET_RXS_Pos                                                                              \
        _UINT8_(3) /* (SERCOM_USART_INT_INTENSET) Receive Start Interrupt Enable Position */
#define SERCOM_USART_INT_INTENSET_RXS_Msk                                                                              \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_USART_INT_INTENSET_RXS_Pos) /* (SERCOM_USART_INT_INTENSET) Receive Start Interrupt Enable Mask */
#define SERCOM_USART_INT_INTENSET_RXS(value)                                                                           \
        (SERCOM_USART_INT_INTENSET_RXS_Msk &                                                                           \
         (_UINT8_(value) << SERCOM_USART_INT_INTENSET_RXS_Pos)) /* Assigment of value for RXS in the                   \
                                                                   SERCOM_USART_INT_INTENSET register */
#define SERCOM_USART_INT_INTENSET_CTSIC_Pos                                                                            \
        _UINT8_(4) /* (SERCOM_USART_INT_INTENSET) Clear To Send Input Change Interrupt Enable Position */
#define SERCOM_USART_INT_INTENSET_CTSIC_Msk                                                                            \
        (_UINT8_(0x1) << SERCOM_USART_INT_INTENSET_CTSIC_Pos) /* (SERCOM_USART_INT_INTENSET) Clear To Send Input       \
                                                                 Change Interrupt Enable Mask */
#define SERCOM_USART_INT_INTENSET_CTSIC(value)                                                                         \
        (SERCOM_USART_INT_INTENSET_CTSIC_Msk &                                                                         \
         (_UINT8_(value) << SERCOM_USART_INT_INTENSET_CTSIC_Pos)) /* Assigment of value for CTSIC in the               \
                                                                     SERCOM_USART_INT_INTENSET register */
#define SERCOM_USART_INT_INTENSET_RXBRK_Pos                                                                            \
        _UINT8_(5) /* (SERCOM_USART_INT_INTENSET) Break Received Interrupt Enable Position */
#define SERCOM_USART_INT_INTENSET_RXBRK_Msk                                                                            \
        (_UINT8_(0x1) << SERCOM_USART_INT_INTENSET_RXBRK_Pos) /* (SERCOM_USART_INT_INTENSET) Break Received Interrupt  \
                                                                 Enable Mask */
#define SERCOM_USART_INT_INTENSET_RXBRK(value)                                                                         \
        (SERCOM_USART_INT_INTENSET_RXBRK_Msk &                                                                         \
         (_UINT8_(value) << SERCOM_USART_INT_INTENSET_RXBRK_Pos)) /* Assigment of value for RXBRK in the               \
                                                                     SERCOM_USART_INT_INTENSET register */
#define SERCOM_USART_INT_INTENSET_ERROR_Pos                                                                            \
        _UINT8_(7) /* (SERCOM_USART_INT_INTENSET) Combined Error Interrupt Enable Position */
#define SERCOM_USART_INT_INTENSET_ERROR_Msk                                                                            \
        (_UINT8_(0x1) << SERCOM_USART_INT_INTENSET_ERROR_Pos) /* (SERCOM_USART_INT_INTENSET) Combined Error Interrupt  \
                                                                 Enable Mask */
#define SERCOM_USART_INT_INTENSET_ERROR(value)                                                                         \
        (SERCOM_USART_INT_INTENSET_ERROR_Msk &                                                                         \
         (_UINT8_(value) << SERCOM_USART_INT_INTENSET_ERROR_Pos)) /* Assigment of value for ERROR in the               \
                                                                     SERCOM_USART_INT_INTENSET register */
#define SERCOM_USART_INT_INTENSET_Msk _UINT8_(0xBF) /* (SERCOM_USART_INT_INTENSET) Register Mask  */


