ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
/* -------- SERCOM_I2CM_INTFLAG : (SERCOM Offset: 0x18) (R/W 8) I2CM Interrupt Flag Status and Clear -------- */
#define SERCOM_I2CM_INTFLAG_RESETVALUE                                                                                 \
        _UINT8_(0x00) /*  (SERCOM_I2CM_INTFLAG) I2CM Interrupt Flag Status and Clear  Reset Value */

#define SERCOM_I2CM_INTFLAG_MB_Pos _UINT8_(0) /* (SERCOM_I2CM_INTFLAG) Master On Bus Interrupt Position */
#define SERCOM_I2CM_INTFLAG_MB_Msk                                                                                     \
        (_UINT8_(0x1) << SERCOM_I2CM_INTFLAG_MB_Pos) /* (SERCOM_I2CM_INTFLAG) Master On Bus Interrupt Mask */
#define SERCOM_I2CM_INTFLAG_MB(value)                                                                                  \
        (SERCOM_I2CM_INTFLAG_MB_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CM_INTFLAG_MB_Pos)) /* Assigment of value for MB in the SERCOM_I2CM_INTFLAG register */
#define SERCOM_I2CM_INTFLAG_SB_Pos _UINT8_(1) /* (SERCOM_I2CM_INTFLAG) Slave On Bus Interrupt Position */
#define SERCOM_I2CM_INTFLAG_SB_Msk                                                                                     \
        (_UINT8_(0x1) << SERCOM_I2CM_INTFLAG_SB_Pos) /* (SERCOM_I2CM_INTFLAG) Slave On Bus Interrupt Mask */
#define SERCOM_I2CM_INTFLAG_SB(value)                                                                                  \
        (SERCOM_I2CM_INTFLAG_SB_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CM_INTFLAG_SB_Pos)) /* Assigment of value for SB in the SERCOM_I2CM_INTFLAG register */
#define SERCOM_I2CM_INTFLAG_ERROR_Pos _UINT8_(7) /* (SERCOM_I2CM_INTFLAG) Combined Error Interrupt Position */
#define SERCOM_I2CM_INTFLAG_ERROR_Msk                                                                                  \
        (_UINT8_(0x1) << SERCOM_I2CM_INTFLAG_ERROR_Pos) /* (SERCOM_I2CM_INTFLAG) Combined Error Interrupt Mask */
#define SERCOM_I2CM_INTFLAG_ERROR(value)                                                                               \
        (SERCOM_I2CM_INTFLAG_ERROR_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CM_INTFLAG_ERROR_Pos)) /* Assigment of value for ERROR in the SERCOM_I2CM_INTFLAG register */
#define SERCOM_I2CM_INTFLAG_Msk _UINT8_(0x83) /* (SERCOM_I2CM_INTFLAG) Register Mask  */


/* -------- SERCOM_I2CS_INTFLAG : (SERCOM Offset: 0x18) (R/W 8) I2CS Interrupt Flag Status and Clear -------- */
#define SERCOM_I2CS_INTFLAG_RESETVALUE                                                                                 \
        _UINT8_(0x00) /*  (SERCOM_I2CS_INTFLAG) I2CS Interrupt Flag Status and Clear  Reset Value */

#define SERCOM_I2CS_INTFLAG_PREC_Pos _UINT8_(0) /* (SERCOM_I2CS_INTFLAG) Stop Received Interrupt Position */
#define SERCOM_I2CS_INTFLAG_PREC_Msk                                                                                   \
        (_UINT8_(0x1) << SERCOM_I2CS_INTFLAG_PREC_Pos) /* (SERCOM_I2CS_INTFLAG) Stop Received Interrupt Mask */
#define SERCOM_I2CS_INTFLAG_PREC(value)                                                                                \
        (SERCOM_I2CS_INTFLAG_PREC_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CS_INTFLAG_PREC_Pos)) /* Assigment of value for PREC in the SERCOM_I2CS_INTFLAG register */
#define SERCOM_I2CS_INTFLAG_AMATCH_Pos _UINT8_(1) /* (SERCOM_I2CS_INTFLAG) Address Match Interrupt Position */
#define SERCOM_I2CS_INTFLAG_AMATCH_Msk                                                                                 \
        (_UINT8_(0x1) << SERCOM_I2CS_INTFLAG_AMATCH_Pos) /* (SERCOM_I2CS_INTFLAG) Address Match Interrupt Mask */
#define SERCOM_I2CS_INTFLAG_AMATCH(value)                                                                              \
        (SERCOM_I2CS_INTFLAG_AMATCH_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CS_INTFLAG_AMATCH_Pos)) /* Assigment of value for AMATCH in the SERCOM_I2CS_INTFLAG register */
#define SERCOM_I2CS_INTFLAG_DRDY_Pos _UINT8_(2) /* (SERCOM_I2CS_INTFLAG) Data Interrupt Position */
#define SERCOM_I2CS_INTFLAG_DRDY_Msk                                                                                   \
        (_UINT8_(0x1) << SERCOM_I2CS_INTFLAG_DRDY_Pos) /* (SERCOM_I2CS_INTFLAG) Data Interrupt Mask */
#define SERCOM_I2CS_INTFLAG_DRDY(value)                                                                                \
        (SERCOM_I2CS_INTFLAG_DRDY_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CS_INTFLAG_DRDY_Pos)) /* Assigment of value for DRDY in the SERCOM_I2CS_INTFLAG register */
#define SERCOM_I2CS_INTFLAG_ERROR_Pos _UINT8_(7) /* (SERCOM_I2CS_INTFLAG) Combined Error Interrupt Position */
#define SERCOM_I2CS_INTFLAG_ERROR_Msk                                                                                  \
        (_UINT8_(0x1) << SERCOM_I2CS_INTFLAG_ERROR_Pos) /* (SERCOM_I2CS_INTFLAG) Combined Error Interrupt Mask */
#define SERCOM_I2CS_INTFLAG_ERROR(value)                                                                               \
        (SERCOM_I2CS_INTFLAG_ERROR_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CS_INTFLAG_ERROR_Pos)) /* Assigment of value for ERROR in the SERCOM_I2CS_INTFLAG register */
#define SERCOM_I2CS_INTFLAG_Msk _UINT8_(0x87) /* (SERCOM_I2CS_INTFLAG) Register Mask  */


/* -------- SERCOM_SPIM_INTFLAG : (SERCOM Offset: 0x18) (R/W 8) SPIM Interrupt Flag Status and Clear -------- */
#define SERCOM_SPIM_INTFLAG_RESETVALUE                                                                                 \
        _UINT8_(0x00) /*  (SERCOM_SPIM_INTFLAG) SPIM Interrupt Flag Status and Clear  Reset Value */

#define SERCOM_SPIM_INTFLAG_DRE_Pos _UINT8_(0) /* (SERCOM_SPIM_INTFLAG) Data Register Empty Interrupt Position */
#define SERCOM_SPIM_INTFLAG_DRE_Msk                                                                                    \
        (_UINT8_(0x1) << SERCOM_SPIM_INTFLAG_DRE_Pos) /* (SERCOM_SPIM_INTFLAG) Data Register Empty Interrupt Mask */
#define SERCOM_SPIM_INTFLAG_DRE(value)                                                                                 \
        (SERCOM_SPIM_INTFLAG_DRE_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTFLAG_DRE_Pos)) /* Assigment of value for DRE in the SERCOM_SPIM_INTFLAG register */
#define SERCOM_SPIM_INTFLAG_TXC_Pos _UINT8_(1) /* (SERCOM_SPIM_INTFLAG) Transmit Complete Interrupt Position */
#define SERCOM_SPIM_INTFLAG_TXC_Msk                                                                                    \
        (_UINT8_(0x1) << SERCOM_SPIM_INTFLAG_TXC_Pos) /* (SERCOM_SPIM_INTFLAG) Transmit Complete Interrupt Mask */
#define SERCOM_SPIM_INTFLAG_TXC(value)                                                                                 \
        (SERCOM_SPIM_INTFLAG_TXC_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTFLAG_TXC_Pos)) /* Assigment of value for TXC in the SERCOM_SPIM_INTFLAG register */
#define SERCOM_SPIM_INTFLAG_RXC_Pos _UINT8_(2) /* (SERCOM_SPIM_INTFLAG) Receive Complete Interrupt Position */
#define SERCOM_SPIM_INTFLAG_RXC_Msk                                                                                    \
        (_UINT8_(0x1) << SERCOM_SPIM_INTFLAG_RXC_Pos) /* (SERCOM_SPIM_INTFLAG) Receive Complete Interrupt Mask */
#define SERCOM_SPIM_INTFLAG_RXC(value)                                                                                 \
        (SERCOM_SPIM_INTFLAG_RXC_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTFLAG_RXC_Pos)) /* Assigment of value for RXC in the SERCOM_SPIM_INTFLAG register */
#define SERCOM_SPIM_INTFLAG_SSL_Pos _UINT8_(3) /* (SERCOM_SPIM_INTFLAG) Slave Select Low Interrupt Flag Position */
#define SERCOM_SPIM_INTFLAG_SSL_Msk                                                                                    \
        (_UINT8_(0x1) << SERCOM_SPIM_INTFLAG_SSL_Pos) /* (SERCOM_SPIM_INTFLAG) Slave Select Low Interrupt Flag Mask */
#define SERCOM_SPIM_INTFLAG_SSL(value)                                                                                 \
        (SERCOM_SPIM_INTFLAG_SSL_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTFLAG_SSL_Pos)) /* Assigment of value for SSL in the SERCOM_SPIM_INTFLAG register */
#define SERCOM_SPIM_INTFLAG_ERROR_Pos _UINT8_(7) /* (SERCOM_SPIM_INTFLAG) Combined Error Interrupt Position */
#define SERCOM_SPIM_INTFLAG_ERROR_Msk                                                                                  \
        (_UINT8_(0x1) << SERCOM_SPIM_INTFLAG_ERROR_Pos) /* (SERCOM_SPIM_INTFLAG) Combined Error Interrupt Mask */
#define SERCOM_SPIM_INTFLAG_ERROR(value)                                                                               \
        (SERCOM_SPIM_INTFLAG_ERROR_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIM_INTFLAG_ERROR_Pos)) /* Assigment of value for ERROR in the SERCOM_SPIM_INTFLAG register */
#define SERCOM_SPIM_INTFLAG_Msk _UINT8_(0x8F) /* (SERCOM_SPIM_INTFLAG) Register Mask  */


