ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
/* -------- SERCOM_SPIS_INTFLAG : (SERCOM Offset: 0x18) (R/W 8) SPIS Interrupt Flag Status and Clear -------- */
#define SERCOM_SPIS_INTFLAG_RESETVALUE                                                                                 \
        _UINT8_(0x00) /*  (SERCOM_SPIS_INTFLAG) SPIS Interrupt Flag Status and Clear  Reset Value */

#define SERCOM_SPIS_INTFLAG_DRE_Pos _UINT8_(0) /* (SERCOM_SPIS_INTFLAG) Data Register Empty Interrupt Position */
#define SERCOM_SPIS_INTFLAG_DRE_Msk                                                                                    \
        (_UINT8_(0x1) << SERCOM_SPIS_INTFLAG_DRE_Pos) /* (SERCOM_SPIS_INTFLAG) Data Register Empty Interrupt Mask */
#define SERCOM_SPIS_INTFLAG_DRE(value)                                                                                 \
        (SERCOM_SPIS_INTFLAG_DRE_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTFLAG_DRE_Pos)) /* Assigment of value for DRE in the SERCOM_SPIS_INTFLAG register */
#define SERCOM_SPIS_INTFLAG_TXC_Pos _UINT8_(1) /* (SERCOM_SPIS_INTFLAG) Transmit Complete Interrupt Position */
#define SERCOM_SPIS_INTFLAG_TXC_Msk                                                                                    \
        (_UINT8_(0x1) << SERCOM_SPIS_INTFLAG_TXC_Pos) /* (SERCOM_SPIS_INTFLAG) Transmit Complete Interrupt Mask */
#define SERCOM_SPIS_INTFLAG_TXC(value)                                                                                 \
        (SERCOM_SPIS_INTFLAG_TXC_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTFLAG_TXC_Pos)) /* Assigment of value for TXC in the SERCOM_SPIS_INTFLAG register */
#define SERCOM_SPIS_INTFLAG_RXC_Pos _UINT8_(2) /* (SERCOM_SPIS_INTFLAG) Receive Complete Interrupt Position */
#define SERCOM_SPIS_INTFLAG_RXC_Msk                                                                                    \
        (_UINT8_(0x1) << SERCOM_SPIS_INTFLAG_RXC_Pos) /* (SERCOM_SPIS_INTFLAG) Receive Complete Interrupt Mask */
#define SERCOM_SPIS_INTFLAG_RXC(value)                                                                                 \
        (SERCOM_SPIS_INTFLAG_RXC_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTFLAG_RXC_Pos)) /* Assigment of value for RXC in the SERCOM_SPIS_INTFLAG register */
#define SERCOM_SPIS_INTFLAG_SSL_Pos _UINT8_(3) /* (SERCOM_SPIS_INTFLAG) Slave Select Low Interrupt Flag Position */
#define SERCOM_SPIS_INTFLAG_SSL_Msk                                                                                    \
        (_UINT8_(0x1) << SERCOM_SPIS_INTFLAG_SSL_Pos) /* (SERCOM_SPIS_INTFLAG) Slave Select Low Interrupt Flag Mask */
#define SERCOM_SPIS_INTFLAG_SSL(value)                                                                                 \
        (SERCOM_SPIS_INTFLAG_SSL_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTFLAG_SSL_Pos)) /* Assigment of value for SSL in the SERCOM_SPIS_INTFLAG register */
#define SERCOM_SPIS_INTFLAG_ERROR_Pos _UINT8_(7) /* (SERCOM_SPIS_INTFLAG) Combined Error Interrupt Position */
#define SERCOM_SPIS_INTFLAG_ERROR_Msk                                                                                  \
        (_UINT8_(0x1) << SERCOM_SPIS_INTFLAG_ERROR_Pos) /* (SERCOM_SPIS_INTFLAG) Combined Error Interrupt Mask */
#define SERCOM_SPIS_INTFLAG_ERROR(value)                                                                               \
        (SERCOM_SPIS_INTFLAG_ERROR_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << SERCOM_SPIS_INTFLAG_ERROR_Pos)) /* Assigment of value for ERROR in the SERCOM_SPIS_INTFLAG register */
#define SERCOM_SPIS_INTFLAG_Msk _UINT8_(0x8F) /* (SERCOM_SPIS_INTFLAG) Register Mask  */


/* -------- SERCOM_USART_EXT_INTFLAG : (SERCOM Offset: 0x18) (R/W 8) USART_EXT Interrupt Flag Status and Clear --------
 */
#define SERCOM_USART_EXT_INTFLAG_RESETVALUE                                                                            \
        _UINT8_(0x00) /*  (SERCOM_USART_EXT_INTFLAG) USART_EXT Interrupt Flag Status and Clear  Reset Value */

#define SERCOM_USART_EXT_INTFLAG_DRE_Pos                                                                               \
        _UINT8_(0) /* (SERCOM_USART_EXT_INTFLAG) Data Register Empty Interrupt Position */
#define SERCOM_USART_EXT_INTFLAG_DRE_Msk                                                                               \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_USART_EXT_INTFLAG_DRE_Pos) /* (SERCOM_USART_EXT_INTFLAG) Data Register Empty Interrupt Mask */
#define SERCOM_USART_EXT_INTFLAG_DRE(value)                                                                            \
        (SERCOM_USART_EXT_INTFLAG_DRE_Msk &                                                                            \
         (_UINT8_(value) << SERCOM_USART_EXT_INTFLAG_DRE_Pos)) /* Assigment of value for DRE in the                    \
                                                                  SERCOM_USART_EXT_INTFLAG register */
#define SERCOM_USART_EXT_INTFLAG_TXC_Pos                                                                               \
        _UINT8_(1) /* (SERCOM_USART_EXT_INTFLAG) Transmit Complete Interrupt Position */
#define SERCOM_USART_EXT_INTFLAG_TXC_Msk                                                                               \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_USART_EXT_INTFLAG_TXC_Pos) /* (SERCOM_USART_EXT_INTFLAG) Transmit Complete Interrupt Mask */
#define SERCOM_USART_EXT_INTFLAG_TXC(value)                                                                            \
        (SERCOM_USART_EXT_INTFLAG_TXC_Msk &                                                                            \
         (_UINT8_(value) << SERCOM_USART_EXT_INTFLAG_TXC_Pos)) /* Assigment of value for TXC in the                    \
                                                                  SERCOM_USART_EXT_INTFLAG register */
#define SERCOM_USART_EXT_INTFLAG_RXC_Pos _UINT8_(2) /* (SERCOM_USART_EXT_INTFLAG) Receive Complete Interrupt Position  \
                                                     */
#define SERCOM_USART_EXT_INTFLAG_RXC_Msk                                                                               \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_USART_EXT_INTFLAG_RXC_Pos) /* (SERCOM_USART_EXT_INTFLAG) Receive Complete Interrupt Mask */
#define SERCOM_USART_EXT_INTFLAG_RXC(value)                                                                            \
        (SERCOM_USART_EXT_INTFLAG_RXC_Msk &                                                                            \
         (_UINT8_(value) << SERCOM_USART_EXT_INTFLAG_RXC_Pos)) /* Assigment of value for RXC in the                    \
                                                                  SERCOM_USART_EXT_INTFLAG register */
#define SERCOM_USART_EXT_INTFLAG_RXS_Pos _UINT8_(3) /* (SERCOM_USART_EXT_INTFLAG) Receive Start Interrupt Position */
#define SERCOM_USART_EXT_INTFLAG_RXS_Msk                                                                               \
        (_UINT8_(0x1) << SERCOM_USART_EXT_INTFLAG_RXS_Pos) /* (SERCOM_USART_EXT_INTFLAG) Receive Start Interrupt Mask  \
                                                            */
#define SERCOM_USART_EXT_INTFLAG_RXS(value)                                                                            \
        (SERCOM_USART_EXT_INTFLAG_RXS_Msk &                                                                            \
         (_UINT8_(value) << SERCOM_USART_EXT_INTFLAG_RXS_Pos)) /* Assigment of value for RXS in the                    \
                                                                  SERCOM_USART_EXT_INTFLAG register */
#define SERCOM_USART_EXT_INTFLAG_CTSIC_Pos                                                                             \
        _UINT8_(4) /* (SERCOM_USART_EXT_INTFLAG) Clear To Send Input Change Interrupt Position */
#define SERCOM_USART_EXT_INTFLAG_CTSIC_Msk                                                                             \
        (_UINT8_(0x1) << SERCOM_USART_EXT_INTFLAG_CTSIC_Pos) /* (SERCOM_USART_EXT_INTFLAG) Clear To Send Input Change  \
                                                                Interrupt Mask */
#define SERCOM_USART_EXT_INTFLAG_CTSIC(value)                                                                          \
        (SERCOM_USART_EXT_INTFLAG_CTSIC_Msk &                                                                          \
         (_UINT8_(value) << SERCOM_USART_EXT_INTFLAG_CTSIC_Pos)) /* Assigment of value for CTSIC in the                \
                                                                    SERCOM_USART_EXT_INTFLAG register */
#define SERCOM_USART_EXT_INTFLAG_RXBRK_Pos _UINT8_(5) /* (SERCOM_USART_EXT_INTFLAG) Break Received Interrupt Position  \
                                                       */
#define SERCOM_USART_EXT_INTFLAG_RXBRK_Msk                                                                             \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_USART_EXT_INTFLAG_RXBRK_Pos) /* (SERCOM_USART_EXT_INTFLAG) Break Received Interrupt Mask */
#define SERCOM_USART_EXT_INTFLAG_RXBRK(value)                                                                          \
        (SERCOM_USART_EXT_INTFLAG_RXBRK_Msk &                                                                          \
         (_UINT8_(value) << SERCOM_USART_EXT_INTFLAG_RXBRK_Pos)) /* Assigment of value for RXBRK in the                \
                                                                    SERCOM_USART_EXT_INTFLAG register */
#define SERCOM_USART_EXT_INTFLAG_ERROR_Pos _UINT8_(7) /* (SERCOM_USART_EXT_INTFLAG) Combined Error Interrupt Position  \
                                                       */
#define SERCOM_USART_EXT_INTFLAG_ERROR_Msk                                                                             \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_USART_EXT_INTFLAG_ERROR_Pos) /* (SERCOM_USART_EXT_INTFLAG) Combined Error Interrupt Mask */
#define SERCOM_USART_EXT_INTFLAG_ERROR(value)                                                                          \
        (SERCOM_USART_EXT_INTFLAG_ERROR_Msk &                                                                          \
         (_UINT8_(value) << SERCOM_USART_EXT_INTFLAG_ERROR_Pos)) /* Assigment of value for ERROR in the                \
                                                                    SERCOM_USART_EXT_INTFLAG register */
#define SERCOM_USART_EXT_INTFLAG_Msk _UINT8_(0xBF) /* (SERCOM_USART_EXT_INTFLAG) Register Mask  */


/* -------- SERCOM_USART_INT_INTFLAG : (SERCOM Offset: 0x18) (R/W 8) USART_INT Interrupt Flag Status and Clear --------
 */
#define SERCOM_USART_INT_INTFLAG_RESETVALUE                                                                            \
        _UINT8_(0x00) /*  (SERCOM_USART_INT_INTFLAG) USART_INT Interrupt Flag Status and Clear  Reset Value */

#define SERCOM_USART_INT_INTFLAG_DRE_Pos                                                                               \
        _UINT8_(0) /* (SERCOM_USART_INT_INTFLAG) Data Register Empty Interrupt Position */
#define SERCOM_USART_INT_INTFLAG_DRE_Msk                                                                               \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_USART_INT_INTFLAG_DRE_Pos) /* (SERCOM_USART_INT_INTFLAG) Data Register Empty Interrupt Mask */
#define SERCOM_USART_INT_INTFLAG_DRE(value)                                                                            \
        (SERCOM_USART_INT_INTFLAG_DRE_Msk &                                                                            \
         (_UINT8_(value) << SERCOM_USART_INT_INTFLAG_DRE_Pos)) /* Assigment of value for DRE in the                    \
                                                                  SERCOM_USART_INT_INTFLAG register */
#define SERCOM_USART_INT_INTFLAG_TXC_Pos                                                                               \
        _UINT8_(1) /* (SERCOM_USART_INT_INTFLAG) Transmit Complete Interrupt Position */
#define SERCOM_USART_INT_INTFLAG_TXC_Msk                                                                               \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_USART_INT_INTFLAG_TXC_Pos) /* (SERCOM_USART_INT_INTFLAG) Transmit Complete Interrupt Mask */
#define SERCOM_USART_INT_INTFLAG_TXC(value)                                                                            \
        (SERCOM_USART_INT_INTFLAG_TXC_Msk &                                                                            \
         (_UINT8_(value) << SERCOM_USART_INT_INTFLAG_TXC_Pos)) /* Assigment of value for TXC in the                    \
                                                                  SERCOM_USART_INT_INTFLAG register */
#define SERCOM_USART_INT_INTFLAG_RXC_Pos _UINT8_(2) /* (SERCOM_USART_INT_INTFLAG) Receive Complete Interrupt Position  \
                                                     */
#define SERCOM_USART_INT_INTFLAG_RXC_Msk                                                                               \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_USART_INT_INTFLAG_RXC_Pos) /* (SERCOM_USART_INT_INTFLAG) Receive Complete Interrupt Mask */
#define SERCOM_USART_INT_INTFLAG_RXC(value)                                                                            \
        (SERCOM_USART_INT_INTFLAG_RXC_Msk &                                                                            \
         (_UINT8_(value) << SERCOM_USART_INT_INTFLAG_RXC_Pos)) /* Assigment of value for RXC in the                    \
                                                                  SERCOM_USART_INT_INTFLAG register */
#define SERCOM_USART_INT_INTFLAG_RXS_Pos _UINT8_(3) /* (SERCOM_USART_INT_INTFLAG) Receive Start Interrupt Position */
#define SERCOM_USART_INT_INTFLAG_RXS_Msk                                                                               \
        (_UINT8_(0x1) << SERCOM_USART_INT_INTFLAG_RXS_Pos) /* (SERCOM_USART_INT_INTFLAG) Receive Start Interrupt Mask  \
                                                            */
#define SERCOM_USART_INT_INTFLAG_RXS(value)                                                                            \
        (SERCOM_USART_INT_INTFLAG_RXS_Msk &                                                                            \
         (_UINT8_(value) << SERCOM_USART_INT_INTFLAG_RXS_Pos)) /* Assigment of value for RXS in the                    \
                                                                  SERCOM_USART_INT_INTFLAG register */
#define SERCOM_USART_INT_INTFLAG_CTSIC_Pos                                                                             \
        _UINT8_(4) /* (SERCOM_USART_INT_INTFLAG) Clear To Send Input Change Interrupt Position */
#define SERCOM_USART_INT_INTFLAG_CTSIC_Msk                                                                             \
        (_UINT8_(0x1) << SERCOM_USART_INT_INTFLAG_CTSIC_Pos) /* (SERCOM_USART_INT_INTFLAG) Clear To Send Input Change  \
                                                                Interrupt Mask */
#define SERCOM_USART_INT_INTFLAG_CTSIC(value)                                                                          \
        (SERCOM_USART_INT_INTFLAG_CTSIC_Msk &                                                                          \
         (_UINT8_(value) << SERCOM_USART_INT_INTFLAG_CTSIC_Pos)) /* Assigment of value for CTSIC in the                \
                                                                    SERCOM_USART_INT_INTFLAG register */
#define SERCOM_USART_INT_INTFLAG_RXBRK_Pos _UINT8_(5) /* (SERCOM_USART_INT_INTFLAG) Break Received Interrupt Position  \
                                                       */
#define SERCOM_USART_INT_INTFLAG_RXBRK_Msk                                                                             \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_USART_INT_INTFLAG_RXBRK_Pos) /* (SERCOM_USART_INT_INTFLAG) Break Received Interrupt Mask */
#define SERCOM_USART_INT_INTFLAG_RXBRK(value)                                                                          \
        (SERCOM_USART_INT_INTFLAG_RXBRK_Msk &                                                                          \
         (_UINT8_(value) << SERCOM_USART_INT_INTFLAG_RXBRK_Pos)) /* Assigment of value for RXBRK in the                \
                                                                    SERCOM_USART_INT_INTFLAG register */
#define SERCOM_USART_INT_INTFLAG_ERROR_Pos _UINT8_(7) /* (SERCOM_USART_INT_INTFLAG) Combined Error Interrupt Position  \
                                                       */
#define SERCOM_USART_INT_INTFLAG_ERROR_Msk                                                                             \
        (_UINT8_(0x1)                                                                                                  \
         << SERCOM_USART_INT_INTFLAG_ERROR_Pos) /* (SERCOM_USART_INT_INTFLAG) Combined Error Interrupt Mask */
#define SERCOM_USART_INT_INTFLAG_ERROR(value)                                                                          \
        (SERCOM_USART_INT_INTFLAG_ERROR_Msk &                                                                          \
         (_UINT8_(value) << SERCOM_USART_INT_INTFLAG_ERROR_Pos)) /* Assigment of value for ERROR in the                \
                                                                    SERCOM_USART_INT_INTFLAG register */
#define SERCOM_USART_INT_INTFLAG_Msk _UINT8_(0xBF) /* (SERCOM_USART_INT_INTFLAG) Register Mask  */


