ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
/* -------- SERCOM_I2CM_STATUS : (SERCOM Offset: 0x1A) (R/W 16) I2CM Status -------- */
#define SERCOM_I2CM_STATUS_RESETVALUE _UINT16_(0x00) /*  (SERCOM_I2CM_STATUS) I2CM Status  Reset Value */

#define SERCOM_I2CM_STATUS_BUSERR_Pos _UINT16_(0) /* (SERCOM_I2CM_STATUS) Bus Error Position */
#define SERCOM_I2CM_STATUS_BUSERR_Msk                                                                                  \
        (_UINT16_(0x1) << SERCOM_I2CM_STATUS_BUSERR_Pos) /* (SERCOM_I2CM_STATUS) Bus Error Mask */
#define SERCOM_I2CM_STATUS_BUSERR(value)                                                                               \
        (SERCOM_I2CM_STATUS_BUSERR_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << SERCOM_I2CM_STATUS_BUSERR_Pos)) /* Assigment of value for BUSERR in the SERCOM_I2CM_STATUS register */
#define SERCOM_I2CM_STATUS_ARBLOST_Pos _UINT16_(1) /* (SERCOM_I2CM_STATUS) Arbitration Lost Position */
#define SERCOM_I2CM_STATUS_ARBLOST_Msk                                                                                 \
        (_UINT16_(0x1) << SERCOM_I2CM_STATUS_ARBLOST_Pos) /* (SERCOM_I2CM_STATUS) Arbitration Lost Mask */
#define SERCOM_I2CM_STATUS_ARBLOST(value)                                                                              \
        (SERCOM_I2CM_STATUS_ARBLOST_Msk &                                                                              \
         (_UINT16_(value)                                                                                              \
          << SERCOM_I2CM_STATUS_ARBLOST_Pos)) /* Assigment of value for ARBLOST in the SERCOM_I2CM_STATUS register */
#define SERCOM_I2CM_STATUS_RXNACK_Pos _UINT16_(2) /* (SERCOM_I2CM_STATUS) Received Not Acknowledge Position */
#define SERCOM_I2CM_STATUS_RXNACK_Msk                                                                                  \
        (_UINT16_(0x1) << SERCOM_I2CM_STATUS_RXNACK_Pos) /* (SERCOM_I2CM_STATUS) Received Not Acknowledge Mask */
#define SERCOM_I2CM_STATUS_RXNACK(value)                                                                               \
        (SERCOM_I2CM_STATUS_RXNACK_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << SERCOM_I2CM_STATUS_RXNACK_Pos)) /* Assigment of value for RXNACK in the SERCOM_I2CM_STATUS register */
#define SERCOM_I2CM_STATUS_BUSSTATE_Pos _UINT16_(4) /* (SERCOM_I2CM_STATUS) Bus State Position */
#define SERCOM_I2CM_STATUS_BUSSTATE_Msk                                                                                \
        (_UINT16_(0x3) << SERCOM_I2CM_STATUS_BUSSTATE_Pos) /* (SERCOM_I2CM_STATUS) Bus State Mask */
#define SERCOM_I2CM_STATUS_BUSSTATE(value)                                                                             \
        (SERCOM_I2CM_STATUS_BUSSTATE_Msk &                                                                             \
         (_UINT16_(value) << SERCOM_I2CM_STATUS_BUSSTATE_Pos)) /* Assigment of value for BUSSTATE in the               \
                                                                  SERCOM_I2CM_STATUS register */
#define SERCOM_I2CM_STATUS_LOWTOUT_Pos _UINT16_(6) /* (SERCOM_I2CM_STATUS) SCL Low Timeout Position */
#define SERCOM_I2CM_STATUS_LOWTOUT_Msk                                                                                 \
        (_UINT16_(0x1) << SERCOM_I2CM_STATUS_LOWTOUT_Pos) /* (SERCOM_I2CM_STATUS) SCL Low Timeout Mask */
#define SERCOM_I2CM_STATUS_LOWTOUT(value)                                                                              \
        (SERCOM_I2CM_STATUS_LOWTOUT_Msk &                                                                              \
         (_UINT16_(value)                                                                                              \
          << SERCOM_I2CM_STATUS_LOWTOUT_Pos)) /* Assigment of value for LOWTOUT in the SERCOM_I2CM_STATUS register */
#define SERCOM_I2CM_STATUS_CLKHOLD_Pos _UINT16_(7) /* (SERCOM_I2CM_STATUS) Clock Hold Position */
#define SERCOM_I2CM_STATUS_CLKHOLD_Msk                                                                                 \
        (_UINT16_(0x1) << SERCOM_I2CM_STATUS_CLKHOLD_Pos) /* (SERCOM_I2CM_STATUS) Clock Hold Mask */
#define SERCOM_I2CM_STATUS_CLKHOLD(value)                                                                              \
        (SERCOM_I2CM_STATUS_CLKHOLD_Msk &                                                                              \
         (_UINT16_(value)                                                                                              \
          << SERCOM_I2CM_STATUS_CLKHOLD_Pos)) /* Assigment of value for CLKHOLD in the SERCOM_I2CM_STATUS register */
#define SERCOM_I2CM_STATUS_MEXTTOUT_Pos _UINT16_(8) /* (SERCOM_I2CM_STATUS) Master SCL Low Extend Timeout Position */
#define SERCOM_I2CM_STATUS_MEXTTOUT_Msk                                                                                \
        (_UINT16_(0x1) << SERCOM_I2CM_STATUS_MEXTTOUT_Pos) /* (SERCOM_I2CM_STATUS) Master SCL Low Extend Timeout Mask  \
                                                            */
#define SERCOM_I2CM_STATUS_MEXTTOUT(value)                                                                             \
        (SERCOM_I2CM_STATUS_MEXTTOUT_Msk &                                                                             \
         (_UINT16_(value) << SERCOM_I2CM_STATUS_MEXTTOUT_Pos)) /* Assigment of value for MEXTTOUT in the               \
                                                                  SERCOM_I2CM_STATUS register */
#define SERCOM_I2CM_STATUS_SEXTTOUT_Pos _UINT16_(9) /* (SERCOM_I2CM_STATUS) Slave SCL Low Extend Timeout Position */
#define SERCOM_I2CM_STATUS_SEXTTOUT_Msk                                                                                \
        (_UINT16_(0x1) << SERCOM_I2CM_STATUS_SEXTTOUT_Pos) /* (SERCOM_I2CM_STATUS) Slave SCL Low Extend Timeout Mask   \
                                                            */
#define SERCOM_I2CM_STATUS_SEXTTOUT(value)                                                                             \
        (SERCOM_I2CM_STATUS_SEXTTOUT_Msk &                                                                             \
         (_UINT16_(value) << SERCOM_I2CM_STATUS_SEXTTOUT_Pos)) /* Assigment of value for SEXTTOUT in the               \
                                                                  SERCOM_I2CM_STATUS register */
#define SERCOM_I2CM_STATUS_LENERR_Pos _UINT16_(10) /* (SERCOM_I2CM_STATUS) Length Error Position */
#define SERCOM_I2CM_STATUS_LENERR_Msk                                                                                  \
        (_UINT16_(0x1) << SERCOM_I2CM_STATUS_LENERR_Pos) /* (SERCOM_I2CM_STATUS) Length Error Mask */
#define SERCOM_I2CM_STATUS_LENERR(value)                                                                               \
        (SERCOM_I2CM_STATUS_LENERR_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << SERCOM_I2CM_STATUS_LENERR_Pos)) /* Assigment of value for LENERR in the SERCOM_I2CM_STATUS register */
#define SERCOM_I2CM_STATUS_Msk _UINT16_(0x07F7) /* (SERCOM_I2CM_STATUS) Register Mask  */


/* -------- SERCOM_I2CS_STATUS : (SERCOM Offset: 0x1A) (R/W 16) I2CS Status -------- */
#define SERCOM_I2CS_STATUS_RESETVALUE _UINT16_(0x00) /*  (SERCOM_I2CS_STATUS) I2CS Status  Reset Value */

