ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
#define SERCOM_I2CS_STATUS_BUSERR_Pos _UINT16_(0) /* (SERCOM_I2CS_STATUS) Bus Error Position */
#define SERCOM_I2CS_STATUS_BUSERR_Msk                                                                                  \
        (_UINT16_(0x1) << SERCOM_I2CS_STATUS_BUSERR_Pos) /* (SERCOM_I2CS_STATUS) Bus Error Mask */
#define SERCOM_I2CS_STATUS_BUSERR(value)                                                                               \
        (SERCOM_I2CS_STATUS_BUSERR_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << SERCOM_I2CS_STATUS_BUSERR_Pos)) /* Assigment of value for BUSERR in the SERCOM_I2CS_STATUS register */
#define SERCOM_I2CS_STATUS_COLL_Pos _UINT16_(1) /* (SERCOM_I2CS_STATUS) Transmit Collision Position */
#define SERCOM_I2CS_STATUS_COLL_Msk                                                                                    \
        (_UINT16_(0x1) << SERCOM_I2CS_STATUS_COLL_Pos) /* (SERCOM_I2CS_STATUS) Transmit Collision Mask */
#define SERCOM_I2CS_STATUS_COLL(value)                                                                                 \
        (SERCOM_I2CS_STATUS_COLL_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << SERCOM_I2CS_STATUS_COLL_Pos)) /* Assigment of value for COLL in the SERCOM_I2CS_STATUS register */
#define SERCOM_I2CS_STATUS_RXNACK_Pos _UINT16_(2) /* (SERCOM_I2CS_STATUS) Received Not Acknowledge Position */
#define SERCOM_I2CS_STATUS_RXNACK_Msk                                                                                  \
        (_UINT16_(0x1) << SERCOM_I2CS_STATUS_RXNACK_Pos) /* (SERCOM_I2CS_STATUS) Received Not Acknowledge Mask */
#define SERCOM_I2CS_STATUS_RXNACK(value)                                                                               \
        (SERCOM_I2CS_STATUS_RXNACK_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << SERCOM_I2CS_STATUS_RXNACK_Pos)) /* Assigment of value for RXNACK in the SERCOM_I2CS_STATUS register */
#define SERCOM_I2CS_STATUS_DIR_Pos _UINT16_(3) /* (SERCOM_I2CS_STATUS) Read/Write Direction Position */
#define SERCOM_I2CS_STATUS_DIR_Msk                                                                                     \
        (_UINT16_(0x1) << SERCOM_I2CS_STATUS_DIR_Pos) /* (SERCOM_I2CS_STATUS) Read/Write Direction Mask */
#define SERCOM_I2CS_STATUS_DIR(value)                                                                                  \
        (SERCOM_I2CS_STATUS_DIR_Msk &                                                                                  \
         (_UINT16_(value)                                                                                              \
          << SERCOM_I2CS_STATUS_DIR_Pos)) /* Assigment of value for DIR in the SERCOM_I2CS_STATUS register */
#define SERCOM_I2CS_STATUS_SR_Pos _UINT16_(4) /* (SERCOM_I2CS_STATUS) Repeated Start Position */
#define SERCOM_I2CS_STATUS_SR_Msk                                                                                      \
        (_UINT16_(0x1) << SERCOM_I2CS_STATUS_SR_Pos) /* (SERCOM_I2CS_STATUS) Repeated Start Mask */
#define SERCOM_I2CS_STATUS_SR(value)                                                                                   \
        (SERCOM_I2CS_STATUS_SR_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << SERCOM_I2CS_STATUS_SR_Pos)) /* Assigment of value for SR in the SERCOM_I2CS_STATUS register */
#define SERCOM_I2CS_STATUS_LOWTOUT_Pos _UINT16_(6) /* (SERCOM_I2CS_STATUS) SCL Low Timeout Position */
#define SERCOM_I2CS_STATUS_LOWTOUT_Msk                                                                                 \
        (_UINT16_(0x1) << SERCOM_I2CS_STATUS_LOWTOUT_Pos) /* (SERCOM_I2CS_STATUS) SCL Low Timeout Mask */
#define SERCOM_I2CS_STATUS_LOWTOUT(value)                                                                              \
        (SERCOM_I2CS_STATUS_LOWTOUT_Msk &                                                                              \
         (_UINT16_(value)                                                                                              \
          << SERCOM_I2CS_STATUS_LOWTOUT_Pos)) /* Assigment of value for LOWTOUT in the SERCOM_I2CS_STATUS register */
#define SERCOM_I2CS_STATUS_CLKHOLD_Pos _UINT16_(7) /* (SERCOM_I2CS_STATUS) Clock Hold Position */
#define SERCOM_I2CS_STATUS_CLKHOLD_Msk                                                                                 \
        (_UINT16_(0x1) << SERCOM_I2CS_STATUS_CLKHOLD_Pos) /* (SERCOM_I2CS_STATUS) Clock Hold Mask */
#define SERCOM_I2CS_STATUS_CLKHOLD(value)                                                                              \
        (SERCOM_I2CS_STATUS_CLKHOLD_Msk &                                                                              \
         (_UINT16_(value)                                                                                              \
          << SERCOM_I2CS_STATUS_CLKHOLD_Pos)) /* Assigment of value for CLKHOLD in the SERCOM_I2CS_STATUS register */
#define SERCOM_I2CS_STATUS_SEXTTOUT_Pos _UINT16_(9) /* (SERCOM_I2CS_STATUS) Slave SCL Low Extend Timeout Position */
#define SERCOM_I2CS_STATUS_SEXTTOUT_Msk                                                                                \
        (_UINT16_(0x1) << SERCOM_I2CS_STATUS_SEXTTOUT_Pos) /* (SERCOM_I2CS_STATUS) Slave SCL Low Extend Timeout Mask   \
                                                            */
#define SERCOM_I2CS_STATUS_SEXTTOUT(value)                                                                             \
        (SERCOM_I2CS_STATUS_SEXTTOUT_Msk &                                                                             \
         (_UINT16_(value) << SERCOM_I2CS_STATUS_SEXTTOUT_Pos)) /* Assigment of value for SEXTTOUT in the               \
                                                                  SERCOM_I2CS_STATUS register */
#define SERCOM_I2CS_STATUS_HS_Pos _UINT16_(10) /* (SERCOM_I2CS_STATUS) High Speed Position */
#define SERCOM_I2CS_STATUS_HS_Msk                                                                                      \
        (_UINT16_(0x1) << SERCOM_I2CS_STATUS_HS_Pos) /* (SERCOM_I2CS_STATUS) High Speed Mask */
#define SERCOM_I2CS_STATUS_HS(value)                                                                                   \
        (SERCOM_I2CS_STATUS_HS_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << SERCOM_I2CS_STATUS_HS_Pos)) /* Assigment of value for HS in the SERCOM_I2CS_STATUS register */
#define SERCOM_I2CS_STATUS_Msk _UINT16_(0x06DF) /* (SERCOM_I2CS_STATUS) Register Mask  */


/* -------- SERCOM_SPIM_STATUS : (SERCOM Offset: 0x1A) (R/W 16) SPIM Status -------- */
#define SERCOM_SPIM_STATUS_RESETVALUE _UINT16_(0x00) /*  (SERCOM_SPIM_STATUS) SPIM Status  Reset Value */

#define SERCOM_SPIM_STATUS_BUFOVF_Pos _UINT16_(2) /* (SERCOM_SPIM_STATUS) Buffer Overflow Position */
#define SERCOM_SPIM_STATUS_BUFOVF_Msk                                                                                  \
        (_UINT16_(0x1) << SERCOM_SPIM_STATUS_BUFOVF_Pos) /* (SERCOM_SPIM_STATUS) Buffer Overflow Mask */
#define SERCOM_SPIM_STATUS_BUFOVF(value)                                                                               \
        (SERCOM_SPIM_STATUS_BUFOVF_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << SERCOM_SPIM_STATUS_BUFOVF_Pos)) /* Assigment of value for BUFOVF in the SERCOM_SPIM_STATUS register */
#define SERCOM_SPIM_STATUS_Msk _UINT16_(0x0004) /* (SERCOM_SPIM_STATUS) Register Mask  */


