ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
/* -------- SERCOM_SPIS_STATUS : (SERCOM Offset: 0x1A) (R/W 16) SPIS Status -------- */
#define SERCOM_SPIS_STATUS_RESETVALUE _UINT16_(0x00) /*  (SERCOM_SPIS_STATUS) SPIS Status  Reset Value */

#define SERCOM_SPIS_STATUS_BUFOVF_Pos _UINT16_(2) /* (SERCOM_SPIS_STATUS) Buffer Overflow Position */
#define SERCOM_SPIS_STATUS_BUFOVF_Msk                                                                                  \
        (_UINT16_(0x1) << SERCOM_SPIS_STATUS_BUFOVF_Pos) /* (SERCOM_SPIS_STATUS) Buffer Overflow Mask */
#define SERCOM_SPIS_STATUS_BUFOVF(value)                                                                               \
        (SERCOM_SPIS_STATUS_BUFOVF_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << SERCOM_SPIS_STATUS_BUFOVF_Pos)) /* Assigment of value for BUFOVF in the SERCOM_SPIS_STATUS register */
#define SERCOM_SPIS_STATUS_Msk _UINT16_(0x0004) /* (SERCOM_SPIS_STATUS) Register Mask  */


/* -------- SERCOM_USART_EXT_STATUS : (SERCOM Offset: 0x1A) (R/W 16) USART_EXT Status -------- */
#define SERCOM_USART_EXT_STATUS_RESETVALUE _UINT16_(0x00) /*  (SERCOM_USART_EXT_STATUS) USART_EXT Status  Reset Value  \
                                                           */

#define SERCOM_USART_EXT_STATUS_PERR_Pos _UINT16_(0) /* (SERCOM_USART_EXT_STATUS) Parity Error Position */
#define SERCOM_USART_EXT_STATUS_PERR_Msk                                                                               \
        (_UINT16_(0x1) << SERCOM_USART_EXT_STATUS_PERR_Pos) /* (SERCOM_USART_EXT_STATUS) Parity Error Mask */
#define SERCOM_USART_EXT_STATUS_PERR(value)                                                                            \
        (SERCOM_USART_EXT_STATUS_PERR_Msk &                                                                            \
         (_UINT16_(value) << SERCOM_USART_EXT_STATUS_PERR_Pos)) /* Assigment of value for PERR in the                  \
                                                                   SERCOM_USART_EXT_STATUS register */
#define SERCOM_USART_EXT_STATUS_FERR_Pos _UINT16_(1) /* (SERCOM_USART_EXT_STATUS) Frame Error Position */
#define SERCOM_USART_EXT_STATUS_FERR_Msk                                                                               \
        (_UINT16_(0x1) << SERCOM_USART_EXT_STATUS_FERR_Pos) /* (SERCOM_USART_EXT_STATUS) Frame Error Mask */
#define SERCOM_USART_EXT_STATUS_FERR(value)                                                                            \
        (SERCOM_USART_EXT_STATUS_FERR_Msk &                                                                            \
         (_UINT16_(value) << SERCOM_USART_EXT_STATUS_FERR_Pos)) /* Assigment of value for FERR in the                  \
                                                                   SERCOM_USART_EXT_STATUS register */
#define SERCOM_USART_EXT_STATUS_BUFOVF_Pos _UINT16_(2) /* (SERCOM_USART_EXT_STATUS) Buffer Overflow Position */
#define SERCOM_USART_EXT_STATUS_BUFOVF_Msk                                                                             \
        (_UINT16_(0x1) << SERCOM_USART_EXT_STATUS_BUFOVF_Pos) /* (SERCOM_USART_EXT_STATUS) Buffer Overflow Mask */
#define SERCOM_USART_EXT_STATUS_BUFOVF(value)                                                                          \
        (SERCOM_USART_EXT_STATUS_BUFOVF_Msk &                                                                          \
         (_UINT16_(value) << SERCOM_USART_EXT_STATUS_BUFOVF_Pos)) /* Assigment of value for BUFOVF in the              \
                                                                     SERCOM_USART_EXT_STATUS register */
#define SERCOM_USART_EXT_STATUS_CTS_Pos _UINT16_(3) /* (SERCOM_USART_EXT_STATUS) Clear To Send Position */
#define SERCOM_USART_EXT_STATUS_CTS_Msk                                                                                \
        (_UINT16_(0x1) << SERCOM_USART_EXT_STATUS_CTS_Pos) /* (SERCOM_USART_EXT_STATUS) Clear To Send Mask */
#define SERCOM_USART_EXT_STATUS_CTS(value)                                                                             \
        (SERCOM_USART_EXT_STATUS_CTS_Msk &                                                                             \
         (_UINT16_(value) << SERCOM_USART_EXT_STATUS_CTS_Pos)) /* Assigment of value for CTS in the                    \
                                                                  SERCOM_USART_EXT_STATUS register */
#define SERCOM_USART_EXT_STATUS_ISF_Pos _UINT16_(4) /* (SERCOM_USART_EXT_STATUS) Inconsistent Sync Field Position */
#define SERCOM_USART_EXT_STATUS_ISF_Msk                                                                                \
        (_UINT16_(0x1) << SERCOM_USART_EXT_STATUS_ISF_Pos) /* (SERCOM_USART_EXT_STATUS) Inconsistent Sync Field Mask   \
                                                            */
#define SERCOM_USART_EXT_STATUS_ISF(value)                                                                             \
        (SERCOM_USART_EXT_STATUS_ISF_Msk &                                                                             \
         (_UINT16_(value) << SERCOM_USART_EXT_STATUS_ISF_Pos)) /* Assigment of value for ISF in the                    \
                                                                  SERCOM_USART_EXT_STATUS register */
#define SERCOM_USART_EXT_STATUS_COLL_Pos _UINT16_(5) /* (SERCOM_USART_EXT_STATUS) Collision Detected Position */
#define SERCOM_USART_EXT_STATUS_COLL_Msk                                                                               \
        (_UINT16_(0x1) << SERCOM_USART_EXT_STATUS_COLL_Pos) /* (SERCOM_USART_EXT_STATUS) Collision Detected Mask */
#define SERCOM_USART_EXT_STATUS_COLL(value)                                                                            \
        (SERCOM_USART_EXT_STATUS_COLL_Msk &                                                                            \
         (_UINT16_(value) << SERCOM_USART_EXT_STATUS_COLL_Pos)) /* Assigment of value for COLL in the                  \
                                                                   SERCOM_USART_EXT_STATUS register */
#define SERCOM_USART_EXT_STATUS_TXE_Pos _UINT16_(6) /* (SERCOM_USART_EXT_STATUS) Transmitter Empty Position */
#define SERCOM_USART_EXT_STATUS_TXE_Msk                                                                                \
        (_UINT16_(0x1) << SERCOM_USART_EXT_STATUS_TXE_Pos) /* (SERCOM_USART_EXT_STATUS) Transmitter Empty Mask */
#define SERCOM_USART_EXT_STATUS_TXE(value)                                                                             \
        (SERCOM_USART_EXT_STATUS_TXE_Msk &                                                                             \
         (_UINT16_(value) << SERCOM_USART_EXT_STATUS_TXE_Pos)) /* Assigment of value for TXE in the                    \
                                                                  SERCOM_USART_EXT_STATUS register */
#define SERCOM_USART_EXT_STATUS_Msk _UINT16_(0x007F) /* (SERCOM_USART_EXT_STATUS) Register Mask  */


