ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
#define SERCOM_I2CM_SYNCBUSY_SWRST_Pos                                                                                 \
        _UINT32_(0) /* (SERCOM_I2CM_SYNCBUSY) Software Reset Synchronization Busy Position */
#define SERCOM_I2CM_SYNCBUSY_SWRST_Msk                                                                                 \
        (_UINT32_(0x1)                                                                                                 \
         << SERCOM_I2CM_SYNCBUSY_SWRST_Pos) /* (SERCOM_I2CM_SYNCBUSY) Software Reset Synchronization Busy Mask */
#define SERCOM_I2CM_SYNCBUSY_SWRST(value)                                                                              \
        (SERCOM_I2CM_SYNCBUSY_SWRST_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CM_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the SERCOM_I2CM_SYNCBUSY register */
#define SERCOM_I2CM_SYNCBUSY_ENABLE_Pos                                                                                \
        _UINT32_(1) /* (SERCOM_I2CM_SYNCBUSY) SERCOM Enable Synchronization Busy Position */
#define SERCOM_I2CM_SYNCBUSY_ENABLE_Msk                                                                                \
        (_UINT32_(0x1)                                                                                                 \
         << SERCOM_I2CM_SYNCBUSY_ENABLE_Pos) /* (SERCOM_I2CM_SYNCBUSY) SERCOM Enable Synchronization Busy Mask */
#define SERCOM_I2CM_SYNCBUSY_ENABLE(value)                                                                             \
        (SERCOM_I2CM_SYNCBUSY_ENABLE_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_I2CM_SYNCBUSY_ENABLE_Pos)) /* Assigment of value for ENABLE in the                 \
                                                                  SERCOM_I2CM_SYNCBUSY register */
#define SERCOM_I2CM_SYNCBUSY_SYSOP_Pos                                                                                 \
        _UINT32_(2) /* (SERCOM_I2CM_SYNCBUSY) System Operation Synchronization Busy Position */
#define SERCOM_I2CM_SYNCBUSY_SYSOP_Msk                                                                                 \
        (_UINT32_(0x1)                                                                                                 \
         << SERCOM_I2CM_SYNCBUSY_SYSOP_Pos) /* (SERCOM_I2CM_SYNCBUSY) System Operation Synchronization Busy Mask */
#define SERCOM_I2CM_SYNCBUSY_SYSOP(value)                                                                              \
        (SERCOM_I2CM_SYNCBUSY_SYSOP_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CM_SYNCBUSY_SYSOP_Pos)) /* Assigment of value for SYSOP in the SERCOM_I2CM_SYNCBUSY register */
#define SERCOM_I2CM_SYNCBUSY_Msk _UINT32_(0x00000007) /* (SERCOM_I2CM_SYNCBUSY) Register Mask  */


/* -------- SERCOM_I2CS_SYNCBUSY : (SERCOM Offset: 0x1C) ( R/ 32) I2CS Synchronization Busy -------- */
#define SERCOM_I2CS_SYNCBUSY_RESETVALUE                                                                                \
        _UINT32_(0x00) /*  (SERCOM_I2CS_SYNCBUSY) I2CS Synchronization Busy  Reset Value */

#define SERCOM_I2CS_SYNCBUSY_SWRST_Pos                                                                                 \
        _UINT32_(0) /* (SERCOM_I2CS_SYNCBUSY) Software Reset Synchronization Busy Position */
#define SERCOM_I2CS_SYNCBUSY_SWRST_Msk                                                                                 \
        (_UINT32_(0x1)                                                                                                 \
         << SERCOM_I2CS_SYNCBUSY_SWRST_Pos) /* (SERCOM_I2CS_SYNCBUSY) Software Reset Synchronization Busy Mask */
#define SERCOM_I2CS_SYNCBUSY_SWRST(value)                                                                              \
        (SERCOM_I2CS_SYNCBUSY_SWRST_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the SERCOM_I2CS_SYNCBUSY register */
#define SERCOM_I2CS_SYNCBUSY_ENABLE_Pos                                                                                \
        _UINT32_(1) /* (SERCOM_I2CS_SYNCBUSY) SERCOM Enable Synchronization Busy Position */
#define SERCOM_I2CS_SYNCBUSY_ENABLE_Msk                                                                                \
        (_UINT32_(0x1)                                                                                                 \
         << SERCOM_I2CS_SYNCBUSY_ENABLE_Pos) /* (SERCOM_I2CS_SYNCBUSY) SERCOM Enable Synchronization Busy Mask */
#define SERCOM_I2CS_SYNCBUSY_ENABLE(value)                                                                             \
        (SERCOM_I2CS_SYNCBUSY_ENABLE_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_I2CS_SYNCBUSY_ENABLE_Pos)) /* Assigment of value for ENABLE in the                 \
                                                                  SERCOM_I2CS_SYNCBUSY register */
#define SERCOM_I2CS_SYNCBUSY_Msk _UINT32_(0x00000003) /* (SERCOM_I2CS_SYNCBUSY) Register Mask  */


/* -------- SERCOM_SPIM_SYNCBUSY : (SERCOM Offset: 0x1C) ( R/ 32) SPIM Synchronization Busy -------- */
#define SERCOM_SPIM_SYNCBUSY_RESETVALUE                                                                                \
        _UINT32_(0x00) /*  (SERCOM_SPIM_SYNCBUSY) SPIM Synchronization Busy  Reset Value */

#define SERCOM_SPIM_SYNCBUSY_SWRST_Pos                                                                                 \
        _UINT32_(0) /* (SERCOM_SPIM_SYNCBUSY) Software Reset Synchronization Busy Position */
#define SERCOM_SPIM_SYNCBUSY_SWRST_Msk                                                                                 \
        (_UINT32_(0x1)                                                                                                 \
         << SERCOM_SPIM_SYNCBUSY_SWRST_Pos) /* (SERCOM_SPIM_SYNCBUSY) Software Reset Synchronization Busy Mask */
#define SERCOM_SPIM_SYNCBUSY_SWRST(value)                                                                              \
        (SERCOM_SPIM_SYNCBUSY_SWRST_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIM_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the SERCOM_SPIM_SYNCBUSY register */
#define SERCOM_SPIM_SYNCBUSY_ENABLE_Pos                                                                                \
        _UINT32_(1) /* (SERCOM_SPIM_SYNCBUSY) SERCOM Enable Synchronization Busy Position */
#define SERCOM_SPIM_SYNCBUSY_ENABLE_Msk                                                                                \
        (_UINT32_(0x1)                                                                                                 \
         << SERCOM_SPIM_SYNCBUSY_ENABLE_Pos) /* (SERCOM_SPIM_SYNCBUSY) SERCOM Enable Synchronization Busy Mask */
#define SERCOM_SPIM_SYNCBUSY_ENABLE(value)                                                                             \
        (SERCOM_SPIM_SYNCBUSY_ENABLE_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_SPIM_SYNCBUSY_ENABLE_Pos)) /* Assigment of value for ENABLE in the                 \
                                                                  SERCOM_SPIM_SYNCBUSY register */
#define SERCOM_SPIM_SYNCBUSY_CTRLB_Pos _UINT32_(2) /* (SERCOM_SPIM_SYNCBUSY) CTRLB Synchronization Busy Position */
#define SERCOM_SPIM_SYNCBUSY_CTRLB_Msk                                                                                 \
        (_UINT32_(0x1) << SERCOM_SPIM_SYNCBUSY_CTRLB_Pos) /* (SERCOM_SPIM_SYNCBUSY) CTRLB Synchronization Busy Mask */
#define SERCOM_SPIM_SYNCBUSY_CTRLB(value)                                                                              \
        (SERCOM_SPIM_SYNCBUSY_CTRLB_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIM_SYNCBUSY_CTRLB_Pos)) /* Assigment of value for CTRLB in the SERCOM_SPIM_SYNCBUSY register */
#define SERCOM_SPIM_SYNCBUSY_Msk _UINT32_(0x00000007) /* (SERCOM_SPIM_SYNCBUSY) Register Mask  */


/* -------- SERCOM_SPIS_SYNCBUSY : (SERCOM Offset: 0x1C) ( R/ 32) SPIS Synchronization Busy -------- */
#define SERCOM_SPIS_SYNCBUSY_RESETVALUE                                                                                \
        _UINT32_(0x00) /*  (SERCOM_SPIS_SYNCBUSY) SPIS Synchronization Busy  Reset Value */

#define SERCOM_SPIS_SYNCBUSY_SWRST_Pos                                                                                 \
        _UINT32_(0) /* (SERCOM_SPIS_SYNCBUSY) Software Reset Synchronization Busy Position */
#define SERCOM_SPIS_SYNCBUSY_SWRST_Msk                                                                                 \
        (_UINT32_(0x1)                                                                                                 \
         << SERCOM_SPIS_SYNCBUSY_SWRST_Pos) /* (SERCOM_SPIS_SYNCBUSY) Software Reset Synchronization Busy Mask */
#define SERCOM_SPIS_SYNCBUSY_SWRST(value)                                                                              \
        (SERCOM_SPIS_SYNCBUSY_SWRST_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the SERCOM_SPIS_SYNCBUSY register */
#define SERCOM_SPIS_SYNCBUSY_ENABLE_Pos                                                                                \
        _UINT32_(1) /* (SERCOM_SPIS_SYNCBUSY) SERCOM Enable Synchronization Busy Position */
#define SERCOM_SPIS_SYNCBUSY_ENABLE_Msk                                                                                \
        (_UINT32_(0x1)                                                                                                 \
         << SERCOM_SPIS_SYNCBUSY_ENABLE_Pos) /* (SERCOM_SPIS_SYNCBUSY) SERCOM Enable Synchronization Busy Mask */
#define SERCOM_SPIS_SYNCBUSY_ENABLE(value)                                                                             \
        (SERCOM_SPIS_SYNCBUSY_ENABLE_Msk &                                                                             \
         (_UINT32_(value) << SERCOM_SPIS_SYNCBUSY_ENABLE_Pos)) /* Assigment of value for ENABLE in the                 \
                                                                  SERCOM_SPIS_SYNCBUSY register */
#define SERCOM_SPIS_SYNCBUSY_CTRLB_Pos _UINT32_(2) /* (SERCOM_SPIS_SYNCBUSY) CTRLB Synchronization Busy Position */
#define SERCOM_SPIS_SYNCBUSY_CTRLB_Msk                                                                                 \
        (_UINT32_(0x1) << SERCOM_SPIS_SYNCBUSY_CTRLB_Pos) /* (SERCOM_SPIS_SYNCBUSY) CTRLB Synchronization Busy Mask */
#define SERCOM_SPIS_SYNCBUSY_CTRLB(value)                                                                              \
        (SERCOM_SPIS_SYNCBUSY_CTRLB_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_SYNCBUSY_CTRLB_Pos)) /* Assigment of value for CTRLB in the SERCOM_SPIS_SYNCBUSY register */
#define SERCOM_SPIS_SYNCBUSY_Msk _UINT32_(0x00000007) /* (SERCOM_SPIS_SYNCBUSY) Register Mask  */


