ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
#define SERCOM_I2CM_ADDR_ADDR_Pos _UINT32_(0) /* (SERCOM_I2CM_ADDR) Address Value Position */
#define SERCOM_I2CM_ADDR_ADDR_Msk                                                                                      \
        (_UINT32_(0x7FF) << SERCOM_I2CM_ADDR_ADDR_Pos) /* (SERCOM_I2CM_ADDR) Address Value Mask */
#define SERCOM_I2CM_ADDR_ADDR(value)                                                                                   \
        (SERCOM_I2CM_ADDR_ADDR_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CM_ADDR_ADDR_Pos)) /* Assigment of value for ADDR in the SERCOM_I2CM_ADDR register */
#define SERCOM_I2CM_ADDR_LENEN_Pos _UINT32_(13) /* (SERCOM_I2CM_ADDR) Length Enable Position */
#define SERCOM_I2CM_ADDR_LENEN_Msk                                                                                     \
        (_UINT32_(0x1) << SERCOM_I2CM_ADDR_LENEN_Pos) /* (SERCOM_I2CM_ADDR) Length Enable Mask */
#define SERCOM_I2CM_ADDR_LENEN(value)                                                                                  \
        (SERCOM_I2CM_ADDR_LENEN_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CM_ADDR_LENEN_Pos)) /* Assigment of value for LENEN in the SERCOM_I2CM_ADDR register */
#define SERCOM_I2CM_ADDR_HS_Pos _UINT32_(14) /* (SERCOM_I2CM_ADDR) High Speed Mode Position */
#define SERCOM_I2CM_ADDR_HS_Msk (_UINT32_(0x1) << SERCOM_I2CM_ADDR_HS_Pos) /* (SERCOM_I2CM_ADDR) High Speed Mode Mask  \
                                                                            */
#define SERCOM_I2CM_ADDR_HS(value)                                                                                     \
        (SERCOM_I2CM_ADDR_HS_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CM_ADDR_HS_Pos)) /* Assigment of value for HS in the SERCOM_I2CM_ADDR register */
#define SERCOM_I2CM_ADDR_TENBITEN_Pos _UINT32_(15) /* (SERCOM_I2CM_ADDR) Ten Bit Addressing Enable Position */
#define SERCOM_I2CM_ADDR_TENBITEN_Msk                                                                                  \
        (_UINT32_(0x1) << SERCOM_I2CM_ADDR_TENBITEN_Pos) /* (SERCOM_I2CM_ADDR) Ten Bit Addressing Enable Mask */
#define SERCOM_I2CM_ADDR_TENBITEN(value)                                                                               \
        (SERCOM_I2CM_ADDR_TENBITEN_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CM_ADDR_TENBITEN_Pos)) /* Assigment of value for TENBITEN in the SERCOM_I2CM_ADDR register */
#define SERCOM_I2CM_ADDR_LEN_Pos _UINT32_(16) /* (SERCOM_I2CM_ADDR) Length Position */
#define SERCOM_I2CM_ADDR_LEN_Msk (_UINT32_(0xFF) << SERCOM_I2CM_ADDR_LEN_Pos) /* (SERCOM_I2CM_ADDR) Length Mask */
#define SERCOM_I2CM_ADDR_LEN(value)                                                                                    \
        (SERCOM_I2CM_ADDR_LEN_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CM_ADDR_LEN_Pos)) /* Assigment of value for LEN in the SERCOM_I2CM_ADDR register */
#define SERCOM_I2CM_ADDR_Msk _UINT32_(0x00FFE7FF) /* (SERCOM_I2CM_ADDR) Register Mask  */


/* -------- SERCOM_I2CS_ADDR : (SERCOM Offset: 0x24) (R/W 32) I2CS Address -------- */
#define SERCOM_I2CS_ADDR_RESETVALUE _UINT32_(0x00) /*  (SERCOM_I2CS_ADDR) I2CS Address  Reset Value */

#define SERCOM_I2CS_ADDR_GENCEN_Pos _UINT32_(0) /* (SERCOM_I2CS_ADDR) General Call Address Enable Position */
#define SERCOM_I2CS_ADDR_GENCEN_Msk                                                                                    \
        (_UINT32_(0x1) << SERCOM_I2CS_ADDR_GENCEN_Pos) /* (SERCOM_I2CS_ADDR) General Call Address Enable Mask */
#define SERCOM_I2CS_ADDR_GENCEN(value)                                                                                 \
        (SERCOM_I2CS_ADDR_GENCEN_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_ADDR_GENCEN_Pos)) /* Assigment of value for GENCEN in the SERCOM_I2CS_ADDR register */
#define SERCOM_I2CS_ADDR_ADDR_Pos _UINT32_(1) /* (SERCOM_I2CS_ADDR) Address Value Position */
#define SERCOM_I2CS_ADDR_ADDR_Msk                                                                                      \
        (_UINT32_(0x3FF) << SERCOM_I2CS_ADDR_ADDR_Pos) /* (SERCOM_I2CS_ADDR) Address Value Mask */
#define SERCOM_I2CS_ADDR_ADDR(value)                                                                                   \
        (SERCOM_I2CS_ADDR_ADDR_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_ADDR_ADDR_Pos)) /* Assigment of value for ADDR in the SERCOM_I2CS_ADDR register */
#define SERCOM_I2CS_ADDR_TENBITEN_Pos _UINT32_(15) /* (SERCOM_I2CS_ADDR) Ten Bit Addressing Enable Position */
#define SERCOM_I2CS_ADDR_TENBITEN_Msk                                                                                  \
        (_UINT32_(0x1) << SERCOM_I2CS_ADDR_TENBITEN_Pos) /* (SERCOM_I2CS_ADDR) Ten Bit Addressing Enable Mask */
#define SERCOM_I2CS_ADDR_TENBITEN(value)                                                                               \
        (SERCOM_I2CS_ADDR_TENBITEN_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_ADDR_TENBITEN_Pos)) /* Assigment of value for TENBITEN in the SERCOM_I2CS_ADDR register */
#define SERCOM_I2CS_ADDR_ADDRMASK_Pos _UINT32_(17) /* (SERCOM_I2CS_ADDR) Address Mask Position */
#define SERCOM_I2CS_ADDR_ADDRMASK_Msk                                                                                  \
        (_UINT32_(0x3FF) << SERCOM_I2CS_ADDR_ADDRMASK_Pos) /* (SERCOM_I2CS_ADDR) Address Mask Mask */
#define SERCOM_I2CS_ADDR_ADDRMASK(value)                                                                               \
        (SERCOM_I2CS_ADDR_ADDRMASK_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SERCOM_I2CS_ADDR_ADDRMASK_Pos)) /* Assigment of value for ADDRMASK in the SERCOM_I2CS_ADDR register */
#define SERCOM_I2CS_ADDR_Msk _UINT32_(0x07FE87FF) /* (SERCOM_I2CS_ADDR) Register Mask  */


/* -------- SERCOM_SPIM_ADDR : (SERCOM Offset: 0x24) (R/W 32) SPIM Address -------- */
#define SERCOM_SPIM_ADDR_RESETVALUE _UINT32_(0x00) /*  (SERCOM_SPIM_ADDR) SPIM Address  Reset Value */

#define SERCOM_SPIM_ADDR_ADDR_Pos _UINT32_(0) /* (SERCOM_SPIM_ADDR) Address Value Position */
#define SERCOM_SPIM_ADDR_ADDR_Msk                                                                                      \
        (_UINT32_(0xFF) << SERCOM_SPIM_ADDR_ADDR_Pos) /* (SERCOM_SPIM_ADDR) Address Value Mask */
#define SERCOM_SPIM_ADDR_ADDR(value)                                                                                   \
        (SERCOM_SPIM_ADDR_ADDR_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIM_ADDR_ADDR_Pos)) /* Assigment of value for ADDR in the SERCOM_SPIM_ADDR register */
#define SERCOM_SPIM_ADDR_ADDRMASK_Pos _UINT32_(16) /* (SERCOM_SPIM_ADDR) Address Mask Position */
#define SERCOM_SPIM_ADDR_ADDRMASK_Msk                                                                                  \
        (_UINT32_(0xFF) << SERCOM_SPIM_ADDR_ADDRMASK_Pos) /* (SERCOM_SPIM_ADDR) Address Mask Mask */
#define SERCOM_SPIM_ADDR_ADDRMASK(value)                                                                               \
        (SERCOM_SPIM_ADDR_ADDRMASK_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIM_ADDR_ADDRMASK_Pos)) /* Assigment of value for ADDRMASK in the SERCOM_SPIM_ADDR register */
#define SERCOM_SPIM_ADDR_Msk _UINT32_(0x00FF00FF) /* (SERCOM_SPIM_ADDR) Register Mask  */


/* -------- SERCOM_SPIS_ADDR : (SERCOM Offset: 0x24) (R/W 32) SPIS Address -------- */
#define SERCOM_SPIS_ADDR_RESETVALUE _UINT32_(0x00) /*  (SERCOM_SPIS_ADDR) SPIS Address  Reset Value */

#define SERCOM_SPIS_ADDR_ADDR_Pos _UINT32_(0) /* (SERCOM_SPIS_ADDR) Address Value Position */
#define SERCOM_SPIS_ADDR_ADDR_Msk                                                                                      \
        (_UINT32_(0xFF) << SERCOM_SPIS_ADDR_ADDR_Pos) /* (SERCOM_SPIS_ADDR) Address Value Mask */
#define SERCOM_SPIS_ADDR_ADDR(value)                                                                                   \
        (SERCOM_SPIS_ADDR_ADDR_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_ADDR_ADDR_Pos)) /* Assigment of value for ADDR in the SERCOM_SPIS_ADDR register */
#define SERCOM_SPIS_ADDR_ADDRMASK_Pos _UINT32_(16) /* (SERCOM_SPIS_ADDR) Address Mask Position */
#define SERCOM_SPIS_ADDR_ADDRMASK_Msk                                                                                  \
        (_UINT32_(0xFF) << SERCOM_SPIS_ADDR_ADDRMASK_Pos) /* (SERCOM_SPIS_ADDR) Address Mask Mask */
#define SERCOM_SPIS_ADDR_ADDRMASK(value)                                                                               \
        (SERCOM_SPIS_ADDR_ADDRMASK_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_ADDR_ADDRMASK_Pos)) /* Assigment of value for ADDRMASK in the SERCOM_SPIS_ADDR register */
#define SERCOM_SPIS_ADDR_Msk _UINT32_(0x00FF00FF) /* (SERCOM_SPIS_ADDR) Register Mask  */


