ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
/* -------- SERCOM_I2CM_DATA : (SERCOM Offset: 0x28) (R/W 8) I2CM Data -------- */
#define SERCOM_I2CM_DATA_RESETVALUE _UINT8_(0x00) /*  (SERCOM_I2CM_DATA) I2CM Data  Reset Value */

#define SERCOM_I2CM_DATA_DATA_Pos _UINT8_(0) /* (SERCOM_I2CM_DATA) Data Value Position */
#define SERCOM_I2CM_DATA_DATA_Msk (_UINT8_(0xFF) << SERCOM_I2CM_DATA_DATA_Pos) /* (SERCOM_I2CM_DATA) Data Value Mask   \
                                                                                */
#define SERCOM_I2CM_DATA_DATA(value)                                                                                   \
        (SERCOM_I2CM_DATA_DATA_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CM_DATA_DATA_Pos)) /* Assigment of value for DATA in the SERCOM_I2CM_DATA register */
#define SERCOM_I2CM_DATA_Msk _UINT8_(0xFF) /* (SERCOM_I2CM_DATA) Register Mask  */


/* -------- SERCOM_I2CS_DATA : (SERCOM Offset: 0x28) (R/W 8) I2CS Data -------- */
#define SERCOM_I2CS_DATA_RESETVALUE _UINT8_(0x00) /*  (SERCOM_I2CS_DATA) I2CS Data  Reset Value */

#define SERCOM_I2CS_DATA_DATA_Pos _UINT8_(0) /* (SERCOM_I2CS_DATA) Data Value Position */
#define SERCOM_I2CS_DATA_DATA_Msk (_UINT8_(0xFF) << SERCOM_I2CS_DATA_DATA_Pos) /* (SERCOM_I2CS_DATA) Data Value Mask   \
                                                                                */
#define SERCOM_I2CS_DATA_DATA(value)                                                                                   \
        (SERCOM_I2CS_DATA_DATA_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << SERCOM_I2CS_DATA_DATA_Pos)) /* Assigment of value for DATA in the SERCOM_I2CS_DATA register */
#define SERCOM_I2CS_DATA_Msk _UINT8_(0xFF) /* (SERCOM_I2CS_DATA) Register Mask  */


/* -------- SERCOM_SPIM_DATA : (SERCOM Offset: 0x28) (R/W 32) SPIM Data -------- */
#define SERCOM_SPIM_DATA_RESETVALUE _UINT32_(0x00) /*  (SERCOM_SPIM_DATA) SPIM Data  Reset Value */

#define SERCOM_SPIM_DATA_DATA_Pos _UINT32_(0) /* (SERCOM_SPIM_DATA) Data Value Position */
#define SERCOM_SPIM_DATA_DATA_Msk                                                                                      \
        (_UINT32_(0x1FF) << SERCOM_SPIM_DATA_DATA_Pos) /* (SERCOM_SPIM_DATA) Data Value Mask */
#define SERCOM_SPIM_DATA_DATA(value)                                                                                   \
        (SERCOM_SPIM_DATA_DATA_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIM_DATA_DATA_Pos)) /* Assigment of value for DATA in the SERCOM_SPIM_DATA register */
#define SERCOM_SPIM_DATA_Msk _UINT32_(0x000001FF) /* (SERCOM_SPIM_DATA) Register Mask  */


/* -------- SERCOM_SPIS_DATA : (SERCOM Offset: 0x28) (R/W 32) SPIS Data -------- */
#define SERCOM_SPIS_DATA_RESETVALUE _UINT32_(0x00) /*  (SERCOM_SPIS_DATA) SPIS Data  Reset Value */

#define SERCOM_SPIS_DATA_DATA_Pos _UINT32_(0) /* (SERCOM_SPIS_DATA) Data Value Position */
#define SERCOM_SPIS_DATA_DATA_Msk                                                                                      \
        (_UINT32_(0x1FF) << SERCOM_SPIS_DATA_DATA_Pos) /* (SERCOM_SPIS_DATA) Data Value Mask */
#define SERCOM_SPIS_DATA_DATA(value)                                                                                   \
        (SERCOM_SPIS_DATA_DATA_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << SERCOM_SPIS_DATA_DATA_Pos)) /* Assigment of value for DATA in the SERCOM_SPIS_DATA register */
#define SERCOM_SPIS_DATA_Msk _UINT32_(0x000001FF) /* (SERCOM_SPIS_DATA) Register Mask  */


/* -------- SERCOM_USART_EXT_DATA : (SERCOM Offset: 0x28) (R/W 16) USART_EXT Data -------- */
#define SERCOM_USART_EXT_DATA_RESETVALUE _UINT16_(0x00) /*  (SERCOM_USART_EXT_DATA) USART_EXT Data  Reset Value */

#define SERCOM_USART_EXT_DATA_DATA_Pos _UINT16_(0) /* (SERCOM_USART_EXT_DATA) Data Value Position */
#define SERCOM_USART_EXT_DATA_DATA_Msk                                                                                 \
        (_UINT16_(0x1FF) << SERCOM_USART_EXT_DATA_DATA_Pos) /* (SERCOM_USART_EXT_DATA) Data Value Mask */
#define SERCOM_USART_EXT_DATA_DATA(value)                                                                              \
        (SERCOM_USART_EXT_DATA_DATA_Msk &                                                                              \
         (_UINT16_(value)                                                                                              \
          << SERCOM_USART_EXT_DATA_DATA_Pos)) /* Assigment of value for DATA in the SERCOM_USART_EXT_DATA register */
#define SERCOM_USART_EXT_DATA_Msk _UINT16_(0x01FF) /* (SERCOM_USART_EXT_DATA) Register Mask  */


/* -------- SERCOM_USART_INT_DATA : (SERCOM Offset: 0x28) (R/W 16) USART_INT Data -------- */
#define SERCOM_USART_INT_DATA_RESETVALUE _UINT16_(0x00) /*  (SERCOM_USART_INT_DATA) USART_INT Data  Reset Value */

#define SERCOM_USART_INT_DATA_DATA_Pos _UINT16_(0) /* (SERCOM_USART_INT_DATA) Data Value Position */
#define SERCOM_USART_INT_DATA_DATA_Msk                                                                                 \
        (_UINT16_(0x1FF) << SERCOM_USART_INT_DATA_DATA_Pos) /* (SERCOM_USART_INT_DATA) Data Value Mask */
#define SERCOM_USART_INT_DATA_DATA(value)                                                                              \
        (SERCOM_USART_INT_DATA_DATA_Msk &                                                                              \
         (_UINT16_(value)                                                                                              \
          << SERCOM_USART_INT_DATA_DATA_Pos)) /* Assigment of value for DATA in the SERCOM_USART_INT_DATA register */
#define SERCOM_USART_INT_DATA_Msk _UINT16_(0x01FF) /* (SERCOM_USART_INT_DATA) Register Mask  */


