ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SERCOM register API structure */
typedef struct { /* Serial Communication Interface */
        __IO uint32_t SERCOM_CTRLA; /**< Offset: 0x00 (R/W  32) I2CM Control A */
        __IO uint32_t SERCOM_CTRLB; /**< Offset: 0x04 (R/W  32) I2CM Control B */
        __I uint8_t Reserved1[0x04];
        __IO uint32_t SERCOM_BAUD; /**< Offset: 0x0C (R/W  32) I2CM Baud Rate */
        __I uint8_t Reserved2[0x04];
        __IO uint8_t SERCOM_INTENCLR; /**< Offset: 0x14 (R/W  8) I2CM Interrupt Enable Clear */
        __I uint8_t Reserved3[0x01];
        __IO uint8_t SERCOM_INTENSET; /**< Offset: 0x16 (R/W  8) I2CM Interrupt Enable Set */
        __I uint8_t Reserved4[0x01];
        __IO uint8_t SERCOM_INTFLAG; /**< Offset: 0x18 (R/W  8) I2CM Interrupt Flag Status and Clear */
        __I uint8_t Reserved5[0x01];
        __IO uint16_t SERCOM_STATUS; /**< Offset: 0x1A (R/W  16) I2CM Status */
        __I uint32_t SERCOM_SYNCBUSY; /**< Offset: 0x1C (R/   32) I2CM Synchronization Busy */
        __I uint8_t Reserved6[0x04];
        __IO uint32_t SERCOM_ADDR; /**< Offset: 0x24 (R/W  32) I2CM Address */
        __IO uint8_t SERCOM_DATA; /**< Offset: 0x28 (R/W  8) I2CM Data */
        __I uint8_t Reserved7[0x07];
        __IO uint8_t SERCOM_DBGCTRL; /**< Offset: 0x30 (R/W  8) I2CM Debug Control */
} sercom_i2cm_registers_t;

/** \brief SERCOM register API structure */
typedef struct { /* Serial Communication Interface */
        __IO uint32_t SERCOM_CTRLA; /**< Offset: 0x00 (R/W  32) I2CS Control A */
        __IO uint32_t SERCOM_CTRLB; /**< Offset: 0x04 (R/W  32) I2CS Control B */
        __I uint8_t Reserved1[0x0C];
        __IO uint8_t SERCOM_INTENCLR; /**< Offset: 0x14 (R/W  8) I2CS Interrupt Enable Clear */
        __I uint8_t Reserved2[0x01];
        __IO uint8_t SERCOM_INTENSET; /**< Offset: 0x16 (R/W  8) I2CS Interrupt Enable Set */
        __I uint8_t Reserved3[0x01];
        __IO uint8_t SERCOM_INTFLAG; /**< Offset: 0x18 (R/W  8) I2CS Interrupt Flag Status and Clear */
        __I uint8_t Reserved4[0x01];
        __IO uint16_t SERCOM_STATUS; /**< Offset: 0x1A (R/W  16) I2CS Status */
        __I uint32_t SERCOM_SYNCBUSY; /**< Offset: 0x1C (R/   32) I2CS Synchronization Busy */
        __I uint8_t Reserved5[0x04];
        __IO uint32_t SERCOM_ADDR; /**< Offset: 0x24 (R/W  32) I2CS Address */
        __IO uint8_t SERCOM_DATA; /**< Offset: 0x28 (R/W  8) I2CS Data */
} sercom_i2cs_registers_t;

/** \brief SERCOM register API structure */
typedef struct { /* Serial Communication Interface */
        __IO uint32_t SERCOM_CTRLA; /**< Offset: 0x00 (R/W  32) SPIS Control A */
        __IO uint32_t SERCOM_CTRLB; /**< Offset: 0x04 (R/W  32) SPIS Control B */
        __I uint8_t Reserved1[0x04];
        __IO uint8_t SERCOM_BAUD; /**< Offset: 0x0C (R/W  8) SPIS Baud Rate */
        __I uint8_t Reserved2[0x07];
        __IO uint8_t SERCOM_INTENCLR; /**< Offset: 0x14 (R/W  8) SPIS Interrupt Enable Clear */
        __I uint8_t Reserved3[0x01];
        __IO uint8_t SERCOM_INTENSET; /**< Offset: 0x16 (R/W  8) SPIS Interrupt Enable Set */
        __I uint8_t Reserved4[0x01];
        __IO uint8_t SERCOM_INTFLAG; /**< Offset: 0x18 (R/W  8) SPIS Interrupt Flag Status and Clear */
        __I uint8_t Reserved5[0x01];
        __IO uint16_t SERCOM_STATUS; /**< Offset: 0x1A (R/W  16) SPIS Status */
        __I uint32_t SERCOM_SYNCBUSY; /**< Offset: 0x1C (R/   32) SPIS Synchronization Busy */
        __I uint8_t Reserved6[0x04];
        __IO uint32_t SERCOM_ADDR; /**< Offset: 0x24 (R/W  32) SPIS Address */
        __IO uint32_t SERCOM_DATA; /**< Offset: 0x28 (R/W  32) SPIS Data */
        __I uint8_t Reserved7[0x04];
        __IO uint8_t SERCOM_DBGCTRL; /**< Offset: 0x30 (R/W  8) SPIS Debug Control */
} sercom_spis_registers_t;

/** \brief SERCOM register API structure */
typedef struct { /* Serial Communication Interface */
        __IO uint32_t SERCOM_CTRLA; /**< Offset: 0x00 (R/W  32) SPIM Control A */
        __IO uint32_t SERCOM_CTRLB; /**< Offset: 0x04 (R/W  32) SPIM Control B */
        __I uint8_t Reserved1[0x04];
        __IO uint8_t SERCOM_BAUD; /**< Offset: 0x0C (R/W  8) SPIM Baud Rate */
        __I uint8_t Reserved2[0x07];
        __IO uint8_t SERCOM_INTENCLR; /**< Offset: 0x14 (R/W  8) SPIM Interrupt Enable Clear */
        __I uint8_t Reserved3[0x01];
        __IO uint8_t SERCOM_INTENSET; /**< Offset: 0x16 (R/W  8) SPIM Interrupt Enable Set */
        __I uint8_t Reserved4[0x01];
        __IO uint8_t SERCOM_INTFLAG; /**< Offset: 0x18 (R/W  8) SPIM Interrupt Flag Status and Clear */
        __I uint8_t Reserved5[0x01];
        __IO uint16_t SERCOM_STATUS; /**< Offset: 0x1A (R/W  16) SPIM Status */
        __I uint32_t SERCOM_SYNCBUSY; /**< Offset: 0x1C (R/   32) SPIM Synchronization Busy */
        __I uint8_t Reserved6[0x04];
        __IO uint32_t SERCOM_ADDR; /**< Offset: 0x24 (R/W  32) SPIM Address */
        __IO uint32_t SERCOM_DATA; /**< Offset: 0x28 (R/W  32) SPIM Data */
        __I uint8_t Reserved7[0x04];
        __IO uint8_t SERCOM_DBGCTRL; /**< Offset: 0x30 (R/W  8) SPIM Debug Control */
} sercom_spim_registers_t;

/** \brief SERCOM register API structure */
typedef struct { /* Serial Communication Interface */
        __IO uint32_t SERCOM_CTRLA; /**< Offset: 0x00 (R/W  32) USART_EXT Control A */
        __IO uint32_t SERCOM_CTRLB; /**< Offset: 0x04 (R/W  32) USART_EXT Control B */
        __I uint8_t Reserved1[0x04];
        __IO uint16_t SERCOM_BAUD; /**< Offset: 0x0C (R/W  16) USART_EXT Baud Rate */
        __IO uint8_t SERCOM_RXPL; /**< Offset: 0x0E (R/W  8) USART_EXT Receive Pulse Length */
        __I uint8_t Reserved2[0x05];
        __IO uint8_t SERCOM_INTENCLR; /**< Offset: 0x14 (R/W  8) USART_EXT Interrupt Enable Clear */
        __I uint8_t Reserved3[0x01];
        __IO uint8_t SERCOM_INTENSET; /**< Offset: 0x16 (R/W  8) USART_EXT Interrupt Enable Set */
        __I uint8_t Reserved4[0x01];
        __IO uint8_t SERCOM_INTFLAG; /**< Offset: 0x18 (R/W  8) USART_EXT Interrupt Flag Status and Clear */
        __I uint8_t Reserved5[0x01];
        __IO uint16_t SERCOM_STATUS; /**< Offset: 0x1A (R/W  16) USART_EXT Status */
        __I uint32_t SERCOM_SYNCBUSY; /**< Offset: 0x1C (R/   32) USART_EXT Synchronization Busy */
        __I uint8_t Reserved6[0x08];
        __IO uint16_t SERCOM_DATA; /**< Offset: 0x28 (R/W  16) USART_EXT Data */
        __I uint8_t Reserved7[0x06];
        __IO uint8_t SERCOM_DBGCTRL; /**< Offset: 0x30 (R/W  8) USART_EXT Debug Control */
} sercom_usart_ext_registers_t;

