ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sercom.h
/** \brief SERCOM register API structure */
typedef struct { /* Serial Communication Interface */
        __IO uint32_t SERCOM_CTRLA; /**< Offset: 0x00 (R/W  32) USART_INT Control A */
        __IO uint32_t SERCOM_CTRLB; /**< Offset: 0x04 (R/W  32) USART_INT Control B */
        __I uint8_t Reserved1[0x04];
        __IO uint16_t SERCOM_BAUD; /**< Offset: 0x0C (R/W  16) USART_INT Baud Rate */
        __IO uint8_t SERCOM_RXPL; /**< Offset: 0x0E (R/W  8) USART_INT Receive Pulse Length */
        __I uint8_t Reserved2[0x05];
        __IO uint8_t SERCOM_INTENCLR; /**< Offset: 0x14 (R/W  8) USART_INT Interrupt Enable Clear */
        __I uint8_t Reserved3[0x01];
        __IO uint8_t SERCOM_INTENSET; /**< Offset: 0x16 (R/W  8) USART_INT Interrupt Enable Set */
        __I uint8_t Reserved4[0x01];
        __IO uint8_t SERCOM_INTFLAG; /**< Offset: 0x18 (R/W  8) USART_INT Interrupt Flag Status and Clear */
        __I uint8_t Reserved5[0x01];
        __IO uint16_t SERCOM_STATUS; /**< Offset: 0x1A (R/W  16) USART_INT Status */
        __I uint32_t SERCOM_SYNCBUSY; /**< Offset: 0x1C (R/   32) USART_INT Synchronization Busy */
        __I uint8_t Reserved6[0x08];
        __IO uint16_t SERCOM_DATA; /**< Offset: 0x28 (R/W  16) USART_INT Data */
        __I uint8_t Reserved7[0x06];
        __IO uint8_t SERCOM_DBGCTRL; /**< Offset: 0x30 (R/W  8) USART_INT Debug Control */
} sercom_usart_int_registers_t;

/** \brief SERCOM hardware registers */
typedef union { /* Serial Communication Interface */
        sercom_i2cm_registers_t I2CM; /**< I2C Master Mode */
        sercom_i2cs_registers_t I2CS; /**< I2C Slave Mode */
        sercom_spis_registers_t SPIS; /**< SPI Slave Mode */
        sercom_spim_registers_t SPIM; /**< SPI Master Mode */
        sercom_usart_ext_registers_t USART_EXT; /**< USART EXTERNAL CLOCK Mode */
        sercom_usart_int_registers_t USART_INT; /**< USART INTERNAL CLOCK Mode */
} sercom_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_SERCOM_COMPONENT_H_ */
